Repository: stefanreuther/c2ng
Catalog: po/*.po
Languages: de

source: Usage: %s -h|help This help message %$0s list|ls [-l|-b] [-o] List installed plugins %$0s add|install [-n] [-f] FILE.c2p... Install given plugins %$0s remove|rm|uninstall [-n] [-f] ID... Remove given plugins %$0s test [-v] FILE.c2p... Test given plugins Options: %s Report bugs to <Streu@gmx.de>
de: Aufruf: %s -h|help Diese Hilfemeldung %$0s list|ls [-l|-b] [-o] Liste installierter Plugins %$0s add|install [-n] [-f] DATEI.c2p... Angegebene Plugins installieren %$0s remove|rm|uninstall [-n] [-f] ID... Angegebene Plugins entfernen %$0s test [-v] DATEI.c2p... Angegebene Plugins testen Optionen: %s Fehler bitte melden an <Streu@gmx.de>

source: Usage: %s [-OPTIONS|FILES...] %s Report bugs to <Streu@gmx.de>
de: Aufruf: %s [-OPTIONEN|DATEIEN...] %s Fehler bitte melden an <Streu@gmx.de>

source: Usage: %s [-h] %0$s COMMAND [-OPTS] %s Report bugs to <Streu@gmx.de>
de: Aufruf: %s [-h] %0$s BEFEHL [-OPTIONEN] %s Report bugs to <Streu@gmx.de>

source: Usage: %s [-h|-v] %0$s [-pPtTsckr] [-d] [-f expr] playerX.trn Filter expressions: a&b, a|b, !a, (a), command, com*, id, id-id, true, false, #num, #num-num %s Report bugs to <Streu@gmx.de>
de: Aufruf: %s [-h|-v] %0$s [-pPtTsckr] [-d] [-f expr] playerX.trn Filterausdrücke: a&b, a|b, !a, (a), kommando, kom*, id, id-id, true, false, #num, #num-num %s Fehler bitte melden an <Streu@gmx.de>

source: Usage: %s APPLET [ARGS] Applets: %s
de: Aufruf: %s APPLET [ARGS] Applets: %s

source: Code Literals Total Routine
de: Code Literale Total Routine

source: remaining
de: verbleibend:

source: (%s starship)
de: (%s Raumschiff)

source: (+%d kt cloak)
de: (+%d kt Tarnung)

source: (from planet)
de: (vom Planet aus)

source: (from ship)
de: (from Schiff aus)

source: (using %d%% ESB)
de: (mit %d%% ESB)

source: - Defense
de: - Verteidigung

source: - Mining Industry
de: - Bergbau

source: - Planetary Economy
de: - Wirtschaft

source: -l List more details -b List fewer details -o List in load order (default: alphabetical) -n Dry run (don't modify anything, just check) -f Ignore dependencies/requirements -v Verbose
de: -l Mehr Details auflisten -b Weniger Details auflisten -o Auflistung in Ladereihenfolge (Standard: alphabetisch) -n Probelauf (nichts verändern, nur prüfen) -f Abhängigkeiten ignorieren -v Mehr Ausgaben

source: At this point, PCC2 will buy only the required tech upgrades.
de: Zu diesem Zeitpunkt wird PCC2 nur die benötigte Technologie kaufen.

source: The planet %s may be hiding ships from our sensors.
de: Möglicherweise verdeckt der Planet %s Schiffe vor unseren Sensoren.

source: under %s control
de: , unter %s Steuerung

source: under our control
de: , von uns gesteuert

source: "-D" option must have format "-DNAME=VALUE"
de: Die Option "-D" muss das Format "-DNAME=VALUE" haben

source: # - Extended Mission
de: # - Erweiterte Mission

source: # - Options
de: # - Optionen

source: # Additional commands
de: # Zusaetzliche Befehle

source: %X - (don't give it away)
de: %X - (nicht fortgeben)

source: %d %1{%s%|%ss%} and %d %1{fighter%|fighters%}
de: %d %1{%s%|%ss%} und %d Raumjäger

source: %d %1{crewman%|crewmen%}
de: %d Mann Crew

source: %d %s group%0$!d%!1{s%}
de: %d %s Gruppe%0$!d%!1{n%}

source: %d %s launcher%!1{s%}
de: %d %s Rohr%!1{e%}

source: %d %s ship%!1{s%}
de: %d %s Schiff%!1{e%}

source: %d %s unit%0$!d%!1{s%}
de: %d %s Einheit%0$!d%!1{en%}

source: %d (of %d) units added to the simulation.
de: %d (von %d) Einheiten zur Simulation hinzugefügt.

source: %d DP%!1{s%}
de: %d Verteid.

source: %d bay%!1{s%}, %d fighter%!1{s%}
de: %d Startrampe%!1{n%}, %d Raumjäger%!1{n%}

source: %d beam%!1{s%}
de: %d Geschütz%!1{e%}

source: %d bytes data
de: %d Bytes Daten

source: %d capital ship%!1{s%}
de: %d Kampfschiff%!1{e%}

source: %d clan%1{ survives%|s survive%}.
de: %d Clan%1{ überlebt%|s überleben%}.

source: %d colonist%!1{s%}, %d mc, %d suppl%1{y%|ies%}
de: %d Kolonist%!1{en%}, %d mc, %d kt Vorräte

source: %d crew (of %d)
de: %d von %d Crew

source: %d database record%!1{s have%| has%} been ignored
de: %d Datenbank-%!1{Einträge wurden%|Eintrag wurde%} ignoriert

source: %d engine%!1{s%}
de: %d Triebwerk%!1{e%}

source: %d factor%!1{ies%|y%}
de: %d Fabrik%!1{en%}

source: %d fighter bay%!1{s%}
de: %d Startrampe%!1{n%}

source: %d fighter bay%!1{s%} with %d fighter%!1{s%}
de: %d Startrampe%!1{n%} mit %d Raumjäger%!1{n%}

source: %d fighter%!1{s%}
de: %d Raumjäger

source: %d fighter%!1{s%} ready
de: %d Raumjäger bereit

source: %d file%!1{s%} removed.
de: %d Datei%!1{en%} gelöscht.

source: %d file%1{ has%|s have%} been deleted.
de: %d Datei%1{ wurde%|en wurden%} gelöscht.

source: %d fleet member%1{ is%|s are%} being towed.
de: %d Flotten-Mitglied%1{ wird%|er werden%} geschleppt

source: %d freighter%!1{s%}
de: %d Frachter

source: %d friendly code%!1{s%} changed.
de: %d Kommandocode%!1{s%} geändert

source: %d grav. engine%!1{s%}
de: %d grav. Triebwerk%!1{e%}

source: %d kt cargo
de: %d kt Frachtraum

source: %d kt fuel aboard
de: %d kt Treibstoff

source: %d kt remaining
de: %d kt übrig

source: %d kt supplies per turn
de: %d kt Vorräte pro Zug

source: %d kt supplies per turn for %s
de: %d kt Vorräte pro Zug für %s

source: %d kt too little
de: %d kt zu wenig

source: %d kt/Enter only
de: %d kt/nur Eingang

source: %d kt/turn
de: %d kt/Zug

source: %d kt/turn, %d kt/fight
de: %d kt/Zug, %d kt/Kampf

source: %d launcher%!1{s%}
de: %d Rohr%!1{e%}

source: %d launcher%!1{s%}, %d torpedo%!1{es%}
de: %d Rohr%!1{e%} mit %d Torpedo%!1{s%}

source: %d ly (%d torp%!1{s%})
de: %d ly (%d Torpedo%!1{s%})

source: %d ly - %.1f%% (cloaked)
de: %d ly - %.1f%% (getarnt)

source: %d ly from %d to %d
de: %d ly von %d bis %d

source: %d marker tag%!1{s were%| was%} too long to be stored in the chart file, and truncated to 255 characters.
de: %d Marker-Tag%!1{s%} waren zu lang um in der Kartendatenbank gespeichert zu werden. Sie wurden auf 255 Zeichen gekürzt.

source: %d mc remaining
de: %d mc übrig

source: %d mc too little
de: %d mc zu wenig

source: %d mc; %d kt supplies
de: %d mc; %d kt Vorräte

source: %d message%!1{s%}
de: %d Nachricht%!1{en%}

source: %d mine%!1{s%}
de: %d Mine%!1{n%}

source: %d mines
de: %d Minen

source: %d mines, %d webs
de: %d Minen, %d Fangminen

source: %d of %d
de: %d von %d

source: %d of %d kt fuel used
de: %d von %d kt Treibstoff benötigt

source: %d of their clans survive%1{s%}.
de: %d ihrer Clans überleb%1{t%|en%}.

source: %d or more
de: %d oder mehr

source: %d per turn for %s each
de: %d pro Zug für je %s

source: %d player%1{'s%|s'%} data remains.
de: Daten von %d Spieler%!1{n%} verbleiben.

source: %d plugin%!1{s%} installed.
de: %d Plugin%!1{s%} installiert.

source: %d result%!1{s%}
de: %d Ergebnis%!1{se%}

source: %d ship%!1{s%} hissing (+%d)
de: %d Schiff%!1{e hissen%| hisst%} (+%d)

source: %d ship%!1{s%} hissing (no effect)
de: %d Schiff%!1{e hissen%| hisst%} (keine Wirkung)

source: %d ship%!1{s%} hissing, %d ship%!1{s%} terraforming
de: %d Schiff%!1{e hissen%| hisst%}, %d Schiff%!1{e terraformen%| terraformt%}

source: %d ship%!1{s%} terraforming
de: %d Schiff%!1{e terraformen%| terraformt%}

source: %d simulation%!1{s%}
de: %d Simulation%!1{en%}

source: %d suppl%1{y%|ies%}
de: %d kt Vorräte

source: %d to %d
de: %d bis %d

source: %d to %d clans survive.
de: %d bis %d Clans überleben.

source: %d to %d of their clans survive.
de: %d bis %d ihrer Clans überleben.

source: %d torpedo launcher%!1{s%}
de: %d Torpedorohr%!1{e%}

source: %d torpedo%!1{es%}
de: %d Torpedo%!1{s%}

source: %d torpedo%!1{es%} aboard
de: %d Torpedo%!1{s%} geladen

source: %d torpedo%!1{es%} and %d %1{fighter%|fighters%}
de: %d Torpedo%!1{s%} und %d Jäger

source: %d turn%!1{s%}
de: %d %1{Zug%|Züge%}

source: %d turn%!1{s%} at warp %d
de: %d %!1{Züge%|Zug%} bei Warp %d

source: %d turn%!1{s%}, %d kt fuel
de: %d %!1{Züge%|Zug%}, %d kt Sprit

source: %d turns ago
de: vor %d %1{Zug%|Zügen%}

source: %d unit%!1{s have%| has%} been updated from the game.
de: %d Einheit%!1{en wurden%| wurde%} aus dem Spiel aktualisiert.

source: %d unit%!1{s have%| has%} been written back to the game.
de: %d Einheit%!1{en wurden%| wurde%} in das Spiel zurück übertragen.

source: %d unit%!1{s%} could not be updated from the game.
de: %d Einheit%!1{en konnten%| konnte%} nicht aus dem Spiel aktualisiert werden.

source: %d unit%!1{s%} could not be written back to the game.
de: %d Einheit%!1{en konnten%| konnte%} nicht in das Spiel zurück übertragen werden.

source: %d unit%!1{s%} in %d group%!1{s%}
de: %d Einheit%!1{en%} in %d Gruppe%!1{n%}

source: %d unit%!1{s%} in range.
de: %d Einheit%!1{en%} im Bereich

source: %d units
de: %d Einheit%!1{en%}

source: %d units (%d ly)
de: %d Einheiten (%d ly)

source: %d × %1{%s launcher%|%s launchers%} with %d torpedo%!1{es%}
de: %d × %1{%s Rohr%|%s Rohre%} mit %d Torpedo%!1{s%}

source: %d × torpedo launcher%!1{s%} with %d torpedo%!1{es%}
de: %d × Torpedorohr%!1{e%} mit %d Torpedo%!1{s%}

source: %d%% (fixed by base)
de: %d%% (durch Basis repariert)

source: %d%% damage
de: %d%% Schaden

source: %d%% damage from enemy fighter
de: %d%% Schaden durch Raumjäger

source: %d%% shield (%d kt), %d%% damaged
de: %d%% Schilde (%d kt), %d%% Schaden

source: %d%% shield loss from enemy fighter
de: %d%% Schildverlust durch Raumjäger

source: %d%% traitors when boarded
de: %d%% Überläufer wenn geentert

source: %d× build
de: %d× bauen

source: %d× clone
de: %d× klonen

source: %d× plan
de: %d× planen

source: %d×Ftr
de: %d×Jäg

source: %s (%s) Proceed anyway?
de: %s (%s) Dennoch fortfahren?

source: %s (Ship #%d)
de: %s (Schiff #%d)

source: %s (in line %d)
de: %s (in Zeile #%d)

source: %s (ship #%d)
de: %s (Schiff #%d)

source: %s + %d own ship%!1{s%}
de: %s + %d eigen%1{es Schiff%|e Schiffe%}

source: %s = %d (instead of %d)
de: %s = %d (statt %d)

source: %s Fighter
de: %s Raumjäger

source: %s Location
de: %s Position

source: %s Range
de: %s Ausdehnung

source: %s beams
de: %s-Geschütze

source: %s colony
de: %s-Kolonie

source: %s custom ship
de: %s eigenes Schiff

source: %s fighter
de: %s Jäger

source: %s fleet
de: %s Flotte

source: %s freighter
de: %s Frachter

source: %s industrial activity
de: %se Industrie-Aktivität

source: %s is from a different turn. File will be ignored.
de: %s stammt aus einem anderen Zug. Die Datei wird ignoriert.

source: %s launchers
de: %s-Rohre

source: %s natives
de: %s Eingeborene

source: %s natives, %d clan%!1{s%}
de: %s Eingeborene, %d Clan%!1{s%}

source: %s ship
de: %s Schiff

source: %s ship types
de: %s Schiffstypen

source: %s starship
de: %s Raumschiff

source: %s was captured%s.
de: %s wurde erobert%s.

source: %s won%s.
de: %s siegt%s.

source: %s. Do you want to load this file?
de: %s. Möchtest du diese Datei laden?

source: %s: %d%% (%d mc, with %d colonist clan%!1{s%})
de: %s: %d%% (%d mc, mit %d Kolonistenclan%!1{s%})

source: %s: Plugin '%s' (%s) tested successfully.
de: %s: Plugin '%s' (%s) erfolgreich getestet.

source: %s: Unknown file type
de: %s: unbekannter Dateityp

source: %s: compressed file
de: %s: komprimierte Datei

source: %s: network access exceeded limit
de: %s: Limit überschritten (network access exceeded limit)

source: %s: network access failed (%s)
de: %s: Fehler (network access failed, %s)

source: %s: network access failed (HTTP error %d)
de: %s: Fehler (network access failed, HTTP-Fehler %d)

source: %s: network access timed out
de: %s: Zeitlimit überschritten (network access timed out)

source: %s: not found
de: %s: nicht gefunden

source: %s: received invalid data from network
de: %s: ungültige Daten vom Netzwerk empfangen

source: %s: unknown file format
de: %s: unbekanntes Dateiformat

source: %s:%d: absolute link '%s' used as <page id>
de: %s:%d: absoluter Link '%s' als <page id> verwendet

source: %s:%d: cannot use 'next' on first entry
de: %s:%d: im ersten Eintrag kann 'next' nicht benutzt werden

source: %s:%d: file format error -- line ignored
de: %s:%d: Format-Fehler -- Zeile wurde ignoriert

source: %s:%d: invalid ID number
de: %s:%d: ungültige ID-Nummer

source: %s:%d: invalid number
de: %s:%d: ungültige Zahl

source: %s:%d: mismatching tag names, expect "</%s>", found "</%s>"
de: %s:%d: Unpassende Tag-Namen, erwarte "</%s>", gefunden: "</%s>"

source: %s:%d: missing delimiter
de: %s:%d: fehlendes Trennzeichen

source: %s:%d: raw text on page
de: %s:%d: reiner Text auf der Seite

source: %s:%d: referenced image not found
de: %s:%d: Bild nicht gefunden

source: %s:%d: source ID not defined yet
de: %s:%d: Quell-ID noch nicht definiert

source: %s:%d: tag <%s> inside <file> unexpected
de: %s:%d: Tag <%s> in <file> unerwartet

source: %s:%d: unexpected EOF in .text section
de: %s:%d: unerwartetes Dateiende in .text-Bereich

source: %s:%d: unexpected closing tag "</%s>"
de: %s:%d: unerwartetes Ende-Tag "</%s>"

source: (%d EP; in %d turn%!1{s%} at +%d/turn)
de: (%d EP; in %d %!1{Zügen%|Zug%} bei +%d/Zug)

source: (%d fighter bay%!1{s%} %snot used)
de: (%d Jäger-Startrampe%!1{n%} %snicht benutzt)

source: (%d ship%!1{s%})
de: (%d Schiff%!1{e%})

source: (%d turns from now)
de: (in %d %1{Zug%|Zügen%})

source: (+%d more)
de: (+%d weitere)

source: (-X0000)<<< Notification >>>
de: (-X0000)<<< Meldung >>>

source: (-h0000)<<< Unknown >>>
de: (-h0000)<<< Unbekannt >>>

source: (-s%04d)<<< Ship >>>
de: (-s%04d)<<< Schiff >>>

source: (Multiple files)
de: (Mehrere Dateien)

source: (_) Unknown
de: (_) Unbekannt

source: (age of this information is unknown)
de: (alter der Information nicht bekannt)

source: (allowed by default)
de: (standardmäßig erlaubt)

source: (available)
de: (verfügbar)

source: (changed)
de: (geändert)

source: (command not understood by PCC2)
de: (Befehl von PCC2 nicht unterstützt)

source: (currently broken)
de: (derzeit defekt)

source: (defense) %d
de: (Verteidigung) %d

source: (empty)
de: (leer)

source: (filter disabled)
de: (Filter deaktiviert)

source: (filter enabled)
de: (Filter aktiviert)

source: (forbidden by default)
de: (standardmäßig verboten)

source: (ground)
de: (Boden)

source: (here)
de: (hier)

source: (mined)
de: (abgebaut)

source: (more...)
de: (mehr...)

source: (next turn)
de: (nächster Zug)

source: (no change)
de: (unverändert)

source: (no description given)
de: (keine Beschreibung angegeben)

source: (no information on density and mined/ground masses available.)
de: (keine Informationen über Dichte und Verfügbarkeit vorhanden.)

source: (no starbase)
de: (keine Sternenbasis)

source: (none)
de: (keine)

source: (not changed)
de: (nicht geändert)

source: (not requested)
de: (nicht angefordert)

source: (not set)
de: (nicht gesetzt)

source: (press [F9] to add a note)
de: (Notiz hinzufügen mit [F9])

source: (requested)
de: (angefordert)

source: (set)
de: (gesetzt)

source: (small)
de: (klein)

source: (sup) %d
de: (Vor) %d

source: (this turn)
de: (dieser Zug)

source: (total)
de: (Gesamt)

source: (up to %s %snot used)
de: (bis zu %s %snicht benutzt)

source: , %d crewm%1{a%|e%}n
de: , %d Mann Crew

source: - Cloaking
de: - Tarnung

source: - Movement
de: - Bewegung

source: --log=CONFIG Set logger configuration --proxy=URL Add network proxy ENV=VALUE Set script environment variable COMMAND... Command to execute (interactive if none)
de: --log=KONFIG Setze Logger-Konfiguration --proxy=URL Netzwerk-Proxy hinzufügen ENV=WERT Setze Script-Umgebungsvariable KOMMANDO... Auszuführender Befehl (interaktiv wenn keiner angegeben)

source: -> Total
de: -> Gesamt

source: -DSECTION.OPTION=VALUE process option --file=FILE process config file fragment for options --total only show total value as integer --value=WHAT only show one sub-rating as integer, WHAT is shiplist, minerals, natives, production
de: -DABSCHNITT.OPTION=WERT Option verarbeiten --file=DATEI Optionen aus Konfigurationsdateifragment lesen --total Nur Gesamtwert als ganze Zahl anzeigen --value=WAS Nur ein bestimmtes Rating als ganze Zahl anzeigen, WAS ist shiplist, minerals, natives, production

source: -dir Open browser -log=CONFIG Configure log output -password=PASS Result file password -proxy=URL Set network proxy -resource=NAME Add resource provider
de: -dir Browser öffnen -log=KONFIG Log-Ausgabe konfigurieren -password=PASS Result-Datei-Passwort -proxy=URL Netzwerk-Proxy einstellen -resource=NAME Ressourcen hinzufügen

source: -fullscreen Run fullscreen -windowed Run in a window -bpp=N Use color depth of N bits per pixel -size=W[xH] Use resolution of WxH pixels -nomousegrab Don't grab (lock into window) mouse pointer
de: -fullscreen Vollbildmodus -windowed In einem Fenster ausführen -bpp=N Farbtiefe von N Bits pro Pixel benutzen -size=B[xH] Auflösung von BxH benutzen -nomousegrab Mauszeiger nicht im Fenster einsperren

source: 0 - none
de: 0 - keiner

source: 1 - Movement
de: 1 - Bewegung

source: 1 - Orders
de: 1 - Aufträge

source: 1000 mines
de: 1000 Minen

source: 150% damage limit
de: 150% Schadenslimit

source: 2 - Cargo
de: 2 - Fracht

source: 2× Beam Charge
de: Geschütze 2×-Geschwindigkeit

source: 2× Torp Charge
de: Torpedos 2×-Geschwindigkeit

source: 3 - Misc.
de: 3 - Diverse

source: 3× Beam Kill
de: Geschütze 3×-Kill

source: 4 - Misc.
de: 4 - Diverse

source: ; line has been ignored
de: ; Zeile wurde ignoriert

source: <<< Sub Space Message >>> FROM: %s TO: %s
de: <<< Subraumnachricht >>> VON: %s AN: %s

source: <big>Automatic</big> PCC2 will automatically assign a directory within your profile directory. If unsure, choose this.
de: <big>Automatisch</big> PCC2 wird automatisch ein Verzeichnis innerhalb deines Profilverzeichnisses benutzen. Wenn unsicher, nutze diese Option.

source: <big>Enter new password:</big> With PCC, the new password will become effective immediately. Other utilities may require the old password until the next turn. Remember that a result file password does not protect against a determined attacker.
de: <big>Neues Passwort eingeben:</big> Mit PCC wird das neue Passwort sofort wirksam. Andere Programme erfordern möglicherweise bis zum nächsten Zug noch das alte Passwort. Beachte, dass ein Result-Passwort keinen Schutz vor einem ernsthaften Angreifer bietet.

source: <big>Manual</big> Manually assign a directory. Use if you want to have full control.
de: <big>Manuell</big> Manuell ein Verzeichnis zuweisen. Nutze dies für volle Kontrolle.

source: <big>None</big> Do not assign a directory. The game will be opened for viewing only, and no changes can be saved.
de: <big>Kein</big> Kein Verzeichnis zuweisen. Das Spiel wird nur zum Ansehen geöffnet; Änderungen werden nicht gespeichert.

source: <big>Welcome to the Battle Simulator!</big> Press <kbd>Ins</kbd> to add a ship, <kbd>P</kbd> to add a planet.
de: <big>Willkommen zum Schlachtsimulator!</big> Nutze <kbd>Einfg</kbd>, um ein Raumschiff hinzuzufügen, <kbd>P</kbd> für einen Planeten.

source: <font color="static">This game does not yet have an associated game directory. PCC2 needs a directory on your computer to store configuration and history data. Please choose how the directory should be assigned.</font>
de: <font color="static">Dieses Spiel hat noch kein zugeordnetes Spielverzeichnis. PCC2 benötigt ein Verzeichnis auf deinem Computer, um Konfiguration und vergangene Züge zu speichern. Bitte wähle, wie das Spielverzeichnis zugeordnet werden soll.</font>

source: <kbd>Ctrl+Tab</kbd> to switch page.
de: Blättern mit <kbd>Strg+Tab</kbd>.

source: <not set>
de: <nicht gesetzt>

source: <over limit>
de: <Limit erreicht>

source: <p><b>See also:</b>&#160;<a href="toc">Help Content</a></p>
de: <p><b>Siehe auch:</b>&#160;<a href="toc">Hilfe-Inhalt</a></p>

source: <small>Overload Mode allows you to load more cargo onto ships than PCC usually permits. This is useful in some situations when you exactly know what you're doing; you need to clean up manually to stay within limits. Ending the turn with an overloaded ship is a rule violation; Host will usually detect that and destroy excess cargo.</small> Turn on Overload Mode?
de: <small>Der Überlast-Modus erlaubt dir, mehr Fracht auf Schiffe zu laden als normalerweise zulässig. Das ist in manchen Fällen nützlich, wenn du genau weißt, was du tust; du musst danach selbst aufräumen, um wieder innerhalb der erlaubten Grenzen zu bleiben. Den Zug mit einem überladenen Schiff zu beenden ist eine Regelverletzung; der Host erkennt das normalerweise und zerstört das Frachtgut.</small> Überlast-Modus einschalten?

source: = Remaining
de: = Verbleibend

source: === Unpacking player %d... ===
de: === Entpacke Spieler %d... ===

source: >%d turns
de: >%d Züge

source: A %s game
de: Ein %s-Spiel

source: A - Starchart
de: A - Sternenkarte

source: Abilities
de: Fähigkeiten

source: Abilities...
de: Fähigkeiten...

source: Aboard
de: Ladung

source: About: -h this help summary -v show version number Options: -p/-P show/don't show turn header -t/-T show/don't show turn trailer -f expr show only matching commands -e cmd edit turn file -C cset use specified character set -s sort turn before doing anything -c do not show most comments -a ignore Taccom attachments (delete them if -r used) -z zap commands before doing anything (just parse headers) Actions: -r re-write turn -d delete matching commands (ignores -pPtT, implies -r) -n no output (ignores -pPtT)
de: Informationen: -h diese Hilfeseite -v Versionsnummer anzeigen Optionen: -p/-P Turn-Header zeigen/nicht zeigen -t/-T Turn-Trailer zeigen/nicht zeigen -f ausdr nur passende Kommandos anzeigen -e anw Turn bearbeiten -C zs Zeichensatz wählen -s Turn zuerst sortieren -c die meisten Kommentare nicht anzeigen -a Taccom-Dateianhänge ignorieren (mit -r: löschen) -z Nur Header/Trailer auswerten, Kommandos ignorieren Befehle: -r Turn neu schreiben -d passende Kommandos löschen (ignoriert -pPtT, impliziert -r) -n keine Ausgabe (ignoriert -pPtT)

source: Accept
de: Akzeptieren

source: Actions (at least one): --save/-o OUT.ccb Save combined .ccb file --report/-r Report ships --verify Verify simulation against ship list --run N Run N simulations --run-series Run a series Options: --game/-G DIR Game directory --root/-R DIR Root directory --charset/-C CS Set game character set -q Do not show progress messages --log CONFIG Configure log output Simulation options: --jobs/-j N Set number of threads for simulation --mode=MODE Set mode (host, phost[2-4], flak, nuhost) --esb=N Set engine-shield bonus --[no-]scotty Scotty bonus --[no-]random-sides Random left/right --[no-]alliances Honor alliances --[no-]one Only one simulation --[no-]seed-control Seed control --[no-]random-fc Random friendly codes on every fight --balance=MODE Set balancing mode (none, 360, master) --seed=N Set random-number seed
de: Aktionen (mindestens eine): --save/-o OUT.ccb Kombinierte .ccb-Datei speichern --report/-r Bericht über Schiffe --verify Prüfe Simulation gegen Schiffsliste --run N N Simulationen ausführen --run-series Eine Serie ausführen Optionen: --game/-G DIR Spielverzeichnis --root/-R DIR Stammverzeichnis --charset/-C ZS Spiel-Zeichensatz setzen -q Keine Fortschrittsmeldungen anzeigen --log KONFIG Log-Ausgaben konfigurieren Simulations-Optionen: --jobs/-j N Anzahl Threads für Simulation einstellen --mode=MODUS Modus wählen (host, phost[2-4], flak, nuhost) --esb=N Triebwerk-Schild-Bonus --[no-]scotty Scotty-Bonus --[no-]random-sides Zufällige Seiten --[no-]alliances Allianzen berücksichtigen --[no-]one Nur eine Simulation --[no-]seed-control Startwert steuern --[no-]random-fc Kommandocodes für jeden Kampf verwürfeln --balance=MODUS Links/Rechts-Ausgleich (none, 360, master) --seed=N Startwert für Zufallsgenerator

source: Actions...
de: Aktionen...
