Repository: stefanreuther/c2ng
Catalog: po/*.po
Languages: de

source: Score #%d
de: Wertung #%d

source: Score Turn Limit
de: Punktestand Zug-Limit

source: Score Win Limit
de: Punktestand Sieg-Limit

source: Scores
de: Punkte

source: Scores [S]
de: Punkte [S]

source: Scores by player
de: Punktestände nach Spieler

source: Scores by team
de: Punktestände nach Team

source: Scrap
de: Schrott

source: Screen History
de: Vorige Ansichten

source: Screenshot saved as "%s"
de: Screenshot gespeichert als "%s"

source: Script command...
de: Script-Befehl...

source: Script file
de: Scriptdatei

source: Search
de: Suche

source: Search Object
de: Objekt suchen

source: Search failed: query did not produce a result (script called "End")
de: Suche fehlgeschlagen: Abfrage hat kein Ergebnis erzeugt (Script hat "End" aufgerufen)

source: Search failed: query suspended unexpectedly (script called "Stop")
de: Suche fehlgeschlagen: Abfrage unerwartet angehalten (Skript hat "Stop" aufgerufen)

source: Search for
de: Suche nach

source: Search for ship
de: Suche nach Schiff

source: Search in messages
de: Suche in Nachrichten

source: Search query
de: Suchanfrage

source: Search text not found.
de: Suchbegriff nicht gefunden.

source: Search type
de: Art der Suche

source: Search!
de: Suche!

source: Search...
de: Suche...

source: Secondary
de: Sekundär

source: Section %d has an invalid address
de: Bereich %d hat eine ungültige Adresse

source: Sector %d
de: Sektor %d

source: Sector borders
de: Sektorgrenzen

source: Seed control
de: Startwert steuern

source: Select Chunnel mate
de: Wähle Chunnel-Partner

source: Select Fleet
de: Flotte auswählen

source: Select Planet
de: Planet auswählen

source: Select Ship
de: Raumschiff auswählen

source: Select Starbase
de: Sternenbasis auswählen

source: Select Waypoint
de: Wähle Zielpunkt

source: Selection
de: Auswahl

source: Selection %c
de: Auswahl %c

source: Selection Manager
de: Auswahl-Manager

source: Self Repair mission
de: Selbstreparatur-Mission

source: Sell Supplies
de: Vorräte verkaufen

source: Sell supplies
de: Vorräte verkaufen

source: Semicolon-separated values
de: Semikolon-getrennte Werte

source: Send
de: Senden

source: Send Message
de: Nachricht senden

source: Send file with TRN (will echo back with next RST, PHost 4.0+)
de: Datei mit dem TRN übertragen (wird mit dem RST zurückgesendet, PHost 4.0+)

source: Send message to file
de: Nachricht in Datei senden

source: Send this message?
de: Diese Nachricht senden?

source: Sensor range
de: Sensoren-Reichweite

source: Sensor visibility
de: Sensor-Sichtbarkeit

source: Sensors
de: Sensoren

source: Server-side game directory
de: Spielverzeichnis auf Server

source: Set Aggressiveness
de: Agressivität setzen

source: Set Base Defense
de: Sternenbasis-Verteidigung setzen

source: Set Base Fighters
de: Anzahl Jäger setzen

source: Set Comment
de: Setze Notiz

source: Set Crew
de: Crew setzen

source: Set Damage Level
de: Schaden setzen

source: Set Defense
de: Verteidigung setzen

source: Set Enemy
de: Setze Primärziel

source: Set Engine Type
de: Triebwerkstyp setzen

source: Set Experience Level
de: Erfahrungsstufe setzen

source: Set FCode
de: Setze Kommandocode

source: Set Friendly Code
de: Kommandocode setzen

source: Set Hull Type
de: Rumpftyp setzen

source: Set Id
de: Id setzen

source: Set Intercept-Attack Target
de: Ziel für Intercept-Attack setzen

source: Set Leave Cancel
de: Setzen Verlassen Abbruch

source: Set Mass
de: Masse setzen

source: Set Mission
de: Setze Mission

source: Set Name
de: Name setzen

source: Set Number of Fighters
de: Setze Anzahl Jäger

source: Set Owner
de: Besitzer setzen

source: Set Planet Name
de: Planetenname setzen

source: Set Primary Weapon
de: Primärwaffe setzen

source: Set Secondary Weapon
de: Sekundärwaffe setzen

source: Set Shield Level
de: Schilde setzen

source: Set Ship Name
de: Name setzen

source: Set Speed
de: Geschwindigkeit setzen

source: Set Starbase Beam Tech
de: Setze Sternenbasis-Beam-Tech

source: Set Starbase Torpedo Tech
de: Setze Sternenbasis-Torpedo-Tech

source: Set Waypoint
de: Setze Kurs

source: Set circle size with [+]/[-], end with [ESC].
de: Größe des Kreises festlegen mit [+]/[-], Ende mit [ESC].

source: Set message detail...
de: Detailgrad für Nachrichten...

source: Set message language...
de: Sprache für Nachrichten ändern

source: Set remote control defaults...
de: Fernsteuerung für neugebaute Schiffe...

source: Set result file password...
de: Passwort für Result-Datei...

source: Set up for playing
de: Einrichten für Spiel

source: Settings
de: Einstellungen

source: Setup & Actions...
de: Einrichten & Aktionen...

source: Setup...
de: Einrichten...

source: Shape
de: Form

source: Shield
de: Schilde

source: Shield Bonus
de: Schild-Bonus

source: Shield Generator
de: Schildgenerator

source: Shields
de: Schilde

source: Shields: %d%%
de: Schilde: %d%%

source: Ship
de: Schiff

source: Ship #%d
de: Schiff #%d

source: Ship #%d (guessed position!)
de: Schiff #%d (vermutete Position!)

source: Ship #%d: %s
de: Schiff #%d: %s

source: Ship %d
de: Schiff %d

source: Ship %s (#%d) is currently transferring to %s (#%d). You can only transfer to one ship at a time. Cancel existing transfer to proceed?
de: Schiff %s (#%d) transferiert gerade Fracht zu %s (#%d). Du kannst nur zu einem Schiff auf einmal transferieren. Existierenden Transfer stornieren?

source: Ship Abilities
de: Schiffsfähigkeiten

source: Ship Build Order
de: Schiffs-Bauauftrag

source: Ship Functions
de: Schiffs-Funktionen

source: Ship History
de: Schiffs-Aufzeichnungen

source: Ship History #%d: %s
de: Schiffs-Aufzeichnungen #%d: %s

source: Ship Hulls
de: Schiffstypen

source: Ship List
de: Schiffs-Liste

source: Ship Mission
de: Schiffs-Mission

source: Ship Prediction
de: Schiffs-Vorhersage

source: Ship Properties
de: Schiffs-Eigenschaften

source: Ship Specification
de: Schiffs-Datenblatt

source: Ship Task #%d: %s
de: Schiffs-Anweisungen #%d: %s

source: Ship Types
de: Schiffstypen

source: Ship alliance
de: Schiffs-Allianz

source: Ship and Planet Labels
de: Schiff- und Planeten-Beschriftung

source: Ship building
de: Schiffsbau

source: Ship cannot have beams.
de: Schiff kann keine Geschütze haben.

source: Ship cannot have torpedo launchers.
de: Schiff kann keine Torpedorohre haben.

source: Ship friendly code
de: Schiffs-Kommandocode

source: Ship functions
de: Schiffsfunktionen

source: Ship mission
de: Schiffs-Mission

source: Ship requires %d engine%!1{s%}.
de: Schiff benötigt %d Triebwerk%!1{e%}.

source: Ship trails
de: Raumschiffs-Spuren

source: Ships
de: Schiffe

source: Ships Being Built
de: Im Bau befindliche Schiffe

source: Ships are dots
de: Raumschiffe sind Punkte

source: Ships by Experience Level
de: Schiffe nach Erfahrungsstufe

source: Ships by Hull Type
de: Schiffe nach Rumpf-Typ

source: Ships can build fighters using friendly code "lfm"
de: Schiffe können mittels Kommandocode "lfm" Jäger bauen

source: Ships cooling to 50°F
de: Schiffe kühlen auf 50°F

source: Ships exactly at %s
de: Schiffe exakt an %s

source: Ships heating to 100°F
de: Schiffe heizen auf 100°F

source: Ships heating to 50°F
de: Schiffe heizen auf 50°F

source: Ships hissing
de: Hissende Schiffe

source: Ships near %s
de: Schiffe nahe %s

source: Ships start with experience
de: Schiffe beginnen mit Erfahrung

source: Ships w/o fuel
de: Schiffe ohne Sprit

source: Shipyard
de: Raumdock

source: Short name
de: Kurzname

source: Show
de: Anzeigen

source: Show all 4 minerals
de: Zeige alle 4 Mineralien

source: Show all info
de: Zeige alle Bereiche

source: Show all ship types
de: Zeige alle Schiffstypen

source: Show grid
de: Raster anzeigen

source: Show minefield to an ally
de: Minenfeld einem Verbündeten zeigen

source: Show minefield to...
de: Zeige Minenfeld...

source: Show only Colonists
de: Zeige nur Kolonisten

source: Show only Duranium
de: Nur Duranium zeigen

source: Show only Molybdenum
de: Nur Molybdenum zeigen

source: Show only Money
de: Zeige nur Geld

source: Show only Neutronium
de: Nur Neutronium zeigen

source: Show only Supplies
de: Zeige nur Vorräte

source: Show only Tritanium
de: Nur Tritanium zeigen

source: Show only beams
de: Zeige nur Geschütze

source: Show only hull list
de: Zeige nur Rumpf-Liste

source: Show only rest
de: Zeige nur Rest

source: Show only ship list
de: Zeige nur Schiffsliste

source: Show only torpedoes
de: Zeige nur Torpedos

source: Show planet to an ally
de: Planet einem Verbündeten zeigen

source: Show planet to...
de: Zeige Planet...

source: Show ship to an ally
de: Schiff einem Verbündeten zeigen

source: Show ship to...
de: Zeige Schiff...

source: Show turn distances
de: Entfernungen anzeigen

source: Siliconoid
de: Silikonoide

source: Simulate!
de: Simulieren!

source: Simulation Results
de: Simulations-Ergebnisse

source: Simulation did not produce any battles.
de: Simulation ergab keine Kämpfe.

source: Simulator Options
de: Simulator-Optionen

source: Size
de: Größe

source: Small starchart
de: Kleine Sternenkarte

source: Sort
de: Sortieren

source: Sort by %s
de: Sortiere nach %s

source: Sort by %s » %s
de: Sortiere nach %s » %s

source: Sort by Age of scan
de: Nach Alter der Sichtung sortieren

source: Sort by Battle Order
de: Nach Kampfreihenfolge sortieren

source: Sort by Hull
de: Nach Rumpf-Typ sortieren

source: Sort by Id
de: Nach Id sortieren

source: Sort by Name
de: Nach Name sortieren

source: Sort by Owner
de: Nach Besitzer sortieren

source: Sort by mined amount
de: Nach abgebauter Menge sortieren

source: Sort by name
de: Nach Name sortieren

source: Sort by native race
de: Nach Volk sortieren

source: Sort by number of planets
de: Nach Anzahl Planeten sortieren

source: Sort by total amount
de: Nach Gesamtmenge sortieren

source: Sort by total population
de: Nach Population sortieren

source: Sort by...
de: Sortiere nach...

source: Sort order
de: Sortierreihenfolge

source: Sort ships by cargo room
de: Schiffe nach Frachtraumgröße sortieren

source: Sort ships by count
de: Schiffe nach Anzahl sortieren

source: Sort ships by hull Id
de: Schiffe nach Rumpf-Typ sortieren

source: Sort ships by hull mass
de: Schiffe nach Rumpf-Masse sortieren

source: Sort ships by maximum beams
de: Schiffe nach Maximalzahl Geschützen sortieren

source: Sort ships by maximum torpedo launchers
de: Schiffe nach Anzahl Torpedorohre sortieren

source: Sort ships by name
de: Schiffe nach Name sortieren

source: Sort ships by number of engines
de: Schiffe nach Anzahl Triebwerke sortieren

source: Sort ships by number of fighter bays
de: Schiffe nach Anzahl Jäger-Startrampen sortieren

source: Sort ships by tech level
de: Schiffe nach Tech sortieren

source: Space - Again
de: Leertaste - Noch einmal

source: Space - Auto Tax
de: Leertaste - Auto

source: Space - Edit
de: Leertaste - Ändern

source: Space - Tag
de: Leertaste - Markieren

source: Space - Un-tag
de: Leertaste - Markierung aufheben

source: Spc-Build
de: Spc-Bau

source: Spc-Select
de: Spc-Wählen

source: Speed
de: Geschwindigkeit

source: Speed: %s
de: Geschwindigkeit: %s

source: Speed: warp %d
de: Geschw.: Warp %d

source: Split Fleet
de: Flotte teilen

source: Squadron
de: Geschwader

source: Stability
de: Stabilität

source: Stalemate.
de: Beide sind kampfunfähig.

source: Standard alliance
de: Standard-Allianz

source: Starbase
de: Sternenbasis

source: Starbase #%d
de: Sternenbasis #%d

source: Starbase #%d does not have a planet, deleting it
de: Sternenbasis #%d hat keinen Planeten, wird gelöscht

source: Starbase #%d: %s
de: Sternenbasis #%d: %s

source: Starbase Commands
de: Sternenbasis-Befehle

source: Starbase Defense
de: Sternenbasis-Verteidigung

source: Starbase Fighters
de: Sternenbasis-Jäger

source: Starbase Message
de: Nachricht von Sternenbasis

source: Starbase Mission
de: Sternenbasis-Mission

source: Starbase Task #%d: %s
de: Sternenbasis-Anweisungen #%d: %s

source: Starbase Torpedoes
de: Sternenbasis-Torpedos

source: Starbase being built
de: Sternenbasis wird gebaut

source: Starbase being built...
de: Sternenbasis wird gebaut...

source: Starbase present
de: Sternenbasis im Orbit

source: Starbase screen
de: Sternenbasis-Bildschirm

source: Starbase shipyard order
de: Raumdock-Auftrag

source: Starbases
de: Sternenbasen

source: Starchart
de: Sternenkarte

source: Starchart (%d,%d)
de: Sternkarte (%d,%d)

source: Starchart Configuration
de: Sternkarten-Einstellungen

source: Starchart Drawing
de: Sternkarten-Zeichnungen

source: Starchart borders
de: Sternkarten-Grenzen

source: Starship Cost Calculator
de: Schiffskostenrechner

source: Starship Hulls
de: Schiffs-Rümpfe

source: Starships
de: Raumschiffe

source: Start new fleet
de: Beginne neue Flotte

source: Starting GUI...
de: Starte GUI...

source: Starting background thread...
de: Starte Hintergrund-Thread...

source: Starting network...
de: Starte Netzwerk...

source: Stopping...
de: Unterbrechen...

source: Stored in
de: Gespeichert in

source: Storm Status
de: Sturm-Status

source: Strikes
de: Schüsse

source: Structure
de: Struktur

source: Structures have been built on %d planet%!1{s%}.
de: Auf %d Planet%!1{en%} wurden Gebäude errichtet.

source: Successful passage
de: Erfolgreiche Querung

source: Sufficient resources available
de: Ausreichend Ressourcen verfügbar

source: Summary...
de: Zusammenfassung...

source: Supplies
de: Vorräte

source: Supplies aboard
de: Vorräte geladen

source: Supply repair
de: Reparatur mit Vorräten

source: Supports %s %ss
de: Erlaubt bis zu %s %s.

source: Survived
de: Überlebt

source: Suspend
de: Anhalten

source: Suspended
de: Angehalten

source: Suspended.
de: Angehalten.

source: Sweep regular mine fields with fighters
de: Reguläre Minenfelder mit Jägern räumen

source: Sweep web mine fields with fighters
de: Fangminenfelder mit Jägern räumen

source: Symmetric relations
de: Symmetrische Relationen

source: Syntax error
de: Syntax-Fehler

source: Syntax error, line has been ignored
de: Syntaxfehler, Zeile wurde ignoriert

source: System configuration file
de: System-Konfigurationsdatei

source: T - Content
de: T - Inhalt

source: T - Taxes
de: T - Steuern

source: T - Totals
de: T - Gesamt

source: Tab - Other Side
de: Tab - Andere Seite

source: Tab-separated values
de: Tab-getrennte Werte

source: Table
de: Tabelle

source: Tag
de: Markierung (Tag)

source: Tag: %s
de: Markierung (Tag): %s

source: Targeting
de: Zielauswahl

source: Tax Rate
de: Steuersatz

source: Tax Rate: %d%%
de: Steuersatz: %d%%

source: Taxes
de: Steuern

source: Taxes have been changed on %d planet%!1{s%}.
de: Steuern wurden auf %d Planet%!1{en%} geändert.

source: Taxes | Optimize
de: Steuern | Optimieren

source: Taxes | Optimize (colonists only)
de: Steuern | Optimieren (nur Kolonisten)

source: Taxes | Optimize (natives only)
de: Steuern | Optimieren (nur Eingeborene)

source: Team Minefields
de: Team-Minenfelder

source: Team colors
de: Team-Farben

source: Team ships
de: Team-Schiffe

source: Tech 10 Beams
de: Tech-10-Geschütze

source: Tech 10 Beams on starbase
de: Tech-10-Geschütze auf Sternenbasis

source: Tech 10 Engines
de: Tech-10-Triebwerke

source: Tech 10 Engines on starbase
de: Tech-10-Triebwerke auf Sternenbasis

source: Tech 10 Hulls
de: Tech-10-Rümpfe

source: Tech 10 Hulls on starbase
de: Tech-10-Rümpfe auf Sternenbasis

source: Tech 10 Torpedoes
de: Tech-10-Torpedos

source: Tech 10 Torpedoes on starbase
de: Tech-10-Torpedos auf Sternenbasis

source: Technology & Defense
de: Technologie & Verteidigung

source: Temperature
de: Temperatur

source: Temporary Storage #%d
de: Zwischenspeicher #%d

source: Terminate
de: Beenden

source: Terminated
de: Beendet

source: Terminated.
de: Beendet.

source: Text file
de: Textdatei

source: Text record appears at unexpected place
de: Ein Text-Datensatz steht an unerwarteter Position

source: Text table
de: Text-Tabelle

source: The <em>Clean Up (Sweep)</em> function will remove player data files. By default, it will delete only files that can be restored by re-unpacking a result file. With the <em>Database</em> option, this function will also delete the history database and configuration files.
de: Die <em>Aufräumen (Sweep)</em>-Funktion löscht Spieler-Dateien. Standardmäßig werden nur Dateien gelöscht, die durch Entpacken eines Results wiederhergestellt werden können. Mit der "Datenbank"-Option werden auch die Sternenkarten-Datenbank und Konfigurationsdateien entfernt.

source: The <em>Unpack</em> function will unpack result files into individual files. After unpacking, you can play your turn using all VGAP utilities of your choice. When done with the turn, use the <em>Maketurn</em> function to generate TRN files to send to the host. Note that PCC2 doesn't require you to unpack a result file prior to playing, but most other utilities do.
de: Die <em>Unpack-Funktion</em> entpackt Results in einzelne Dateien. Nach dem Entpacken kannst du deinen Zug mit jedem VGAP-Programm deiner Wahl spielen. Wenn du mit dem Zug fertig bist, musst du mit der <em>Maketurn-Funktion</em> eine TRN-Datei für den Host erstellen. Mit PCC2 ist es nicht nötig, den Zug vor dem Spielen zu entpacken, mit den meisten anderen Programmen jedoch.

source: The auto task has been stopped; it will continue when you confirm this message.
de: Die Aufgabe wurde angehalten; sie wird fortgesetzt, wenn du diese Meldung bestätigst.

source: The center coordinate specification is invalid. Please enter an expression of the form "2000,2000" (X,Y).
de: Die Mittelpunkt-Koordinaten sind ungültig. Bitte gib einen Ausdruck der Form "2000,2000" (X,Y) ein.

source: The center coordinates must be between 500 to 4000.
de: Die Mittelpunkt-Koordinaten müssen zwischen 500 und 4000 liegen.

source: The directory "%s" is not accessible and cannot be used.
de: Das Verzeichnis "%s" ist nicht zugreifbar und kann nicht verwendet werden.

source: The directory "%s" is not empty. Use anyway?
de: Das Verzeichnis "%s" ist nicht leer. Trotzdem verwenden?

source: The directory "%s" is not writable and cannot be used.
de: Das Verzeichnis "%s" ist nicht beschreibbar und kann nicht verwendet werden.

source: The file you have selected is not a plugin file.
de: Die gewählte Datei ist keine Plugin-Datei.

source: The map extent specification is invalid. Please enter an expression of the form "1100,1100" (sizeX,sizeY) or "1100" (size).
de: Die Größenangabe ist ungültig. Bitte gib einen Ausdruck der Form "1100,1100" (GrößeX,GrößeY) oder "1100" (Größe) ein.

source: The map size must be between 500 and 4000. The values must be smaller than the center coordinate value (the map must not contain negative coordinates).
de: Die Kartengröße muss zwischen 500 und 4000 liegen. Die Werte müssen kleiner als die Mittelpunkt-Koordinatenwerte sein (die Karte darf keine negativen Koordinaten enthalten).

source: The requested page "%s" could not be found.
de: Die angeforderte Hilfeseite "%s" konnte nicht gefunden werden.

source: The script has been stopped; it will continue when you confirm this message.
de: Das Script wurde angehalten; es wird fortgesetzt, wenn du diese Meldung bestätigst.

source: The server reported an error: %s
de: Der Server hat einen Fehler gemeldet: %s

source: The simulation already contains a ship with Id #%d. Replace it?
de: Diese Simulation enthält bereits ein Schiff mit Id #%d. Soll es ersetzt werden?

source: The statistics file in game directory was written by a newer version of PCC2; changes not written.
de: Die Statistik-Datei im Spielverzeichnis wurde von einer neueren Version von PCC2 geschrieben; Änderungen werden nicht gespeichert.

source: Their offer
de: ihr Angebot

source: There are new result files for this game. Do you want to unpack them now?
de: Es gibt neue Result-Dateien für dieses Spiel. Möchtest du diese jetzt entpacken?

source: There are no fights in this arrangement. Did you set all owners and aggression settings correctly?
de: In dieser Aufstellung gibt es keine Kämpfe. Überprüfe die Einstellungen für Besitzer und Agressivität der Schiffe.

source: There are no fights in this arrangement. You have disabled some ships, try re-enabling them using [.].
de: In dieser Aufstellung gibt es keine Kämpfe. Du hast einige Schiffe deaktiviert, aktiviere sie erneut mit der [.]-Taste.

source: There are no natives on this planet.
de: Auf diesem Planeten leben keine Eingeborenen.

source: There are no objects of the requested kind.
de: Es gibt keine Objekte der gesuchten Typen.

source: There are no potential chunnel mates at the current position.
de: An dieser Position befindet sich kein möglicher Chunnel-Partner.

source: There are none of your units in this simulation.
de: Die Simulation enthält keins unserer Schiffe.

source: There is no other fleet member at this place which could carry %s.
de: Kein anderes Flottenmitglied an dieser Stelle kann %s tragen.

source: There is no other fleet member at this position.
de: An dieser Position befindet sich kein weiteres Flottenmitglied.

source: There is no other fleet we could join.
de: Es gibt keine andere Flotte, der wir beitreten könnten.

source: There is no other ship of ours at that position.
de: An dieser Position befindet sich kein weiteres unserer Schiffe.

source: There is no other unit at this place which could carry %s.
de: Keine andere Einheit an dieser Stelle kann %s tragen.

source: There is no ship at this starbase which could be fixed or recycled.
de: An dieser Sternenbasis halten sich keine Schiffe auf, die repariert oder verschrottet werden können.

source: There is no ship of ours at that position.
de: An dieser Position befindet sich keins unserer Schiffe.

source: There is nothing that can be reset at this location.
de: An dieser Position befindet sich nichts, das zurückgesetzt werden könnte.

source: There is nothing you could transfer to or from %s.
de: Es gibt nichts, was du von oder zu %s transferieren könntest.

source: There was an error loading this turn.
de: Beim Laden dieses Zugs ist ein Fehler aufgetreten.

source: There's no other unit here we could transfer to or from.
de: An dieser Position befindet sich keine andere Einheit, zu der wir Fracht übertragen könnten.

source: There's none of our ships orbiting this planet.
de: An diesem Planeten befindet sich keins unserer Schiffe.

source: These settings have been taking from the host configuration. Changes will only last until PCC2 reads the configuration again. Instead of manually changing Geometry settings, it's usually better to work with a current copy of the host configuration.
de: Diese Einstellungen wurden der Host-Konfiguration entnommen. Änderungen werden nur solange wirken, biss PCC2 die Konfiguration erneut einliest. Anstatt manuell die Geometrie-Einstellungen zu verändern, solltest du besser mit der aktuellen Host-Konfiguration arbeiten.

source: They HATE you!
de: Sie HASSEN Euch!

source: They LOVE you.
de: Sie LIEBEN Euch.

source: They are angry about you!
de: Sie sind wütend über Euch!

source: They are undecided about you.
de: Sie sind unentschlossen über Euch.

source: They have captured our ship%s.
de: Unser Schiff wurde gekapert%s.

source: They like your leadership.
de: Sie sind mit der Regierung zufrieden.

source: They need to pay %d mc and %d kt supplies.
de: Sie müssen %d mc und %d kt Vorräte zahlen.

source: They need to pay %d mc.
de: Sie müssen %d mc zahlen.

source: This Auto Task performed a "Restart" loop without intervening delays. You should probably use "WaitOneTurn".
de: Diese Aufgabe führt eine "Restart"-Schleife aus, ohne zwischendurch zu warten. Wahrscheinlich solltest du "WaitOneTurn" nutzen.

source: This Id number is already in use in this simulation setup. Please choose another one.
de: Diese Id-Nummer wird in dieser Simulation bereits verwendet. Bitte wähle eine andere.

source: This Part
de: Teil
