Repository: stefanreuther/c2ng
Catalog: po/*.po
Languages: de

source: Actions: --compile, -c Compile to "*.qc" files (default) --disassemble, -S Disassemble to "*.qs" files --size Show size of "*.qc" files --strip Remove line number information from "*.qc" files Options: -g Enable debug info (default) -s Disable debug info -o FILE Output file -I DIR Include (load) directory --charset/-C CS Set game character set -O LVL Optimisation level -k Execute commands, not files --log CONFIG Configure log output -q Quiet; show only script output (predefined log config) Expert Options: -f preexec-load Pre-execute "Load" statements
de: Aktionen: --compile, -c In "*.qc"-Datei übersetzen (Standard) --disassemble, -S In "*.qs"-Datei disassemblieren --size Größe von "*.qc"-Dateien anzeigen --strip Zeilennummer-Informationen aus "*.qc"-Dateien entfernen Optionen: -g Debug-Informationen aktivieren (Standard) -s Debug-Informationen deaktivieren -o DATEI Ausgabedatei -I VERZ Include-Verzeichnis (für "Load") --charset/-C ZS Spiel-Zeichensatz setzen -O STUFE Optimierungsstufe -k Kommandos (keine Dateien) --log KONFIG Log-Ausgabe konfigurieren -q Stumm; nur Skript-Ausgabe anzeigen (vordefinierte Log-Konfiguration) Experten-Optionen: -f preexec-load "Load"-Anweisungen im Voraus ausführen

source: Add
de: Einf

source: Add Account
de: Konto hinzufügen

source: Add Planet
de: Planet hinzufügen

source: Add Ship
de: Schiff hinzufügen

source: Add all to fleet
de: Alle zu Flotte hinzufügen

source: Add field
de: Feld hinzufügen

source: Add to Simulation
de: Zu Simulation hinzufügen

source: Add...
de: Neu...

source: Add/drop ally (Host 3.22.007+ version)
de: Allianz anbieten/stornieren (Host-3.22.007+-Version)

source: Add/drop ally (PHost version)
de: Allianz anbieten/stornieren (PHost-Version)

source: Add/drop permanent enemy
de: Permanente Feind-Einstellungen

source: Added Duranium
de: Duranium hinzugefügt

source: Added Molybdenum
de: Molybdenum hinzugefügt

source: Added Neutronium
de: Neutronium gesamt

source: Added Tritanium
de: Tritanium hinzugefügt

source: Adding network account "%s"
de: Füge Netzwerk-Konto "%s" hinzu

source: Additional resources needed
de: Zusätzliche Ressourcen benötigt

source: Address (empty for default)
de: Addresse (leer für Standardwert)

source: Adjacent
de: Angrenzend

source: Adjective
de: Adjektiv

source: Affected units
de: Betroffene Einheiten

source: After decay
de: Nach Verfall

source: Aggressive
de: Agressiv

source: Alchemy Ships
de: Alchemie-Schiffe

source: Alchemy function
de: Alchemie-Funktion

source: All
de: Alle

source: All but...
de: Alles außer...

source: All cargo
de: Alle Fracht

source: All ships
de: Alle Schiffe

source: Alliance offer
de: Allianz-Angebot

source: Alliances
de: Allianzen

source: Alliances... [Ctrl-A]
de: Allianzen... [Strg-A]

source: Allow higher taxes
de: Akzeptieren höhere Steuern

source: Allow remote control for all affected ships?
de: Fernsteuerung für alle betroffenen Schiffe erlauben?

source: Allow remote control of this ship?
de: Fernsteuerung dieses Schiffs erlauben?

source: Almanac
de: Almanach

source: Almanac of the Universe
de: Almanach des Universums

source: Alt-N - No password
de: Alt-N - Kein Password

source: Alt-R - Random
de: Alt-R - Zufall

source: Ammo
de: Munition

source: Amorphous
de: Amorphe

source: Amorphous worms don't pay taxes. They eat %d colonist clan%!1{s%}.
de: Amorphe zahlen keine Steuern. Sie fressen aber %d Kolonisten-Clan%!1{s%}.

source: Amount
de: Menge

source: Amphibian
de: Amphibische

source: An account with these parameters already exists.
de: Es gibt bereits ein Konto mit diesen Parametern.

source: Anarchy
de: Anarchie

source: Anonymous Message
de: Anonyme Nachricht

source: Apply changes?
de: Änderungen übernehmen?

source: Apply turn files?
de: Turn-Dateien anwenden?

source: Applying %d turn file command%!1{s%}...
de: Führe %d Befehl%!1{e%} aus Turn-Datei aus...

source: Armed
de: Bewaffnet

source: Assertion failed: %s
de: Assertion fehlgeschlagen: %s

source: Assertion failed: %s, at %s
de: Assertion fehlgeschlagen: %s, an %s

source: Assigned to ship
de: Dem Schiff zugeordnet

source: Assigned to ship class
de: Der Schiffsklasse zugeordnet

source: Assimilate natives
de: Eingeborene assimilieren

source: Assimilated in %d turn%!1{s%}
de: Assimiliert in %d %1{Zug%|Zügen%}

source: Assimilated in %d turn%!1{s%} by %d clan%!1{s%}
de: Assimiliert in %d %1{Zug%|Zügen%} durch %d Clan%!1{s%}

source: Assimilated in >%d turn%!1{s%}
de: Assimiliert in >%d %1{Zug%|Zügen%}

source: Assimilated in >%d turn%!1{s%} by %d clan%!1{s%}
de: Assimiliert in >%d %1{Zug%|Zügen%} durch %d Clan%!1{s%}

source: Assimilation rate
de: Assimilations-Rate

source: Assuming, we'd beam down %d clan%!1{s%}.
de: Angenommen, wir laden %d Clan%!1{s%} ab.

source: Attachment "%s" ignored because of invalid file name.
de: Anhang "%s" wurde aufgrund seines ungültigen Dateinamens ignoriert.

source: Attachment "%s" ignored.
de: Anhang "%s" wurde ignoriert.

source: Attachment "%s" is missing parts.
de: Teile von Anhang "%s" fehlen.

source: Attachment record is truncated
de: Dateianhang ist abgeschnitten

source: Attachments
de: Anhänge

source: Attacker
de: Angreifer

source: Auto Task
de: Aufgabe

source: Auto Task Planet %d
de: Aufgabe Planet %d

source: Auto Task Ship %d
de: Aufgabe Schiff %d

source: Auto Task Starbase %d
de: Aufgabe Sternenbasis %d

source: Auto-B. Goal
de: Bau-Ziel

source: Auto-Build Goals
de: Bau-Ziele

source: Auto-build
de: Automatisch bauen

source: Auto-build goals have been changed on %d planet%!1{s%}.
de: Bau-Ziele wurden auf %d Planet%!1{en%} geändert.

source: Autobuild record has unexpected size
de: Ein Autobuild-Datensatz hat eine unerwartete Größe

source: Automatic
de: Automatisch

source: Auxiliary Commands
de: Zusätzliche Befehle

source: Auxiliary commands are not supported for this host.
de: Zusatz-Kommandos werden mit diesem Host nicht unterstützt.

source: Available
de: Verfügbar

source: Available at %s
de: Verfügbar auf %s

source: Available to %s
de: Verfügbar für %s

source: Average temperature: %d°F
de: Durchschnitts-Temperator: %d°F

source: B - Starbases
de: B - Sternenbasen

source: Back
de: Zurück

source: Backup Setting
de: Backup-Einstellung

source: Backups | Result file backups...
de: Backups | Result-Datei-Backups...

source: Backups | Scripts/Auto Task backups...
de: Backups | Script/Auto-Task-Backup...

source: Backups | Starchart database backups...
de: Backups | Sternkarten-Datenbank-Backups...

source: Backups | Turn file backups...
de: Backups | Turn-Datei-Backups...

source: Backups | UTIL.DAT file backups...
de: Backups | UTIL.DAT-Backup...

source: Bad object size
de: Falsche Objekt-Größe

source: Base Tax Rate
de: Basissteuersatz

source: Base fights with extra torpedo tubes
de: Basis kämpft mit zusätzlichen Torpedorohren

source: Bases
de: Basen

source: Battle %d
de: Kampf %d

source: Battle %d of %d
de: Kampf %d von %d

source: Battle Order
de: Kampfreihenfolge

source: Battle Simulator
de: Kampf-Simulator

source: Battle cannot be played!
de: Kampf kann nicht wiedergegeben werden!

source: Battle timed out (too long).
de: Zeitlimit überschritten.

source: Battles per simulation
de: Kämpfe pro Simulation

source: Beam Tech
de: Geschütz-Tech

source: Beam Type
de: Geschütz-Typ

source: Beam Weapon #%d
de: Geschütz #%d

source: Beam Weapons
de: Geschütze

source: Beam tech upgrade
de: Geschütz-Tech-Upgrade

source: Beam up from %s
de: Heraufbeamen von %s

source: Beam up multiple
de: Heraufbeamen (Beam up multiple)

source: Beams
de: Geschütze

source: Beams on ship: %d (max %d)
de: Geschütze auf Schiff: %d (max %d)

source: Before
de: Davor

source: Bidirectional
de: Bidirektional

source: Both are disabled.
de: Beide sind kampfunfähig.

source: Both were destroyed.
de: Beide wurden zerstört.

source: Bound in keymap %s.
de: In Keymap %s belegt.

source: Bovinoid
de: Bovinoide

source: Browse folders on this computer
de: Ordner auf diesem Computer durchsuchen

source: Browse list (Tab)
de: Liste blättern (Tab)

source: Build
de: Bauen

source: Build %s
de: Baue ein %s

source: Build Components
de: Komponenten bauen

source: Build Fighters mission
de: Jägerbau-Mission

source: Build Fighters on ships
de: Jäger auf Raumschiffen bauen

source: Build Fighters/Torpedoes...
de: Raumjäger/Torpedos bauen

source: Build Order
de: Bauauftrag

source: Build Order Rejected
de: Bau-Auftrag abgewiesen

source: Build Order Summary
de: Zusammenfassung der Bauaufträge

source: Build Points
de: Baupunkte

source: Build Priority
de: Schiffsbau-Priorität

source: Build Queue Position
de: Position in Bauliste

source: Build Ship
de: Schiffsbau

source: Build Starbase
de: Sternenbasis bauen

source: Build Torpedoes
de: Torpedos bauen

source: Build Torpedoes/Fighters
de: Raumjäger/Torpedos bauen

source: Build a new ship...
de: Ein neues Schiff bauen...

source: Build defense posts
de: Verteidigungsposten bauen

source: Build earlier
de: Früher bauen

source: Build factories
de: Fabriken bauen

source: Build fighters
de: Raumjäger bauen

source: Build later
de: Später bauen

source: Build mines
de: Minen bauen

source: Build order rejected
de: Bauauftrag abgelehnt

source: Build starbase
de: Sternenbasis bauen

source: Build this ship?
de: Dieses Schiff bauen?

source: Build this starbase?
de: Diese Sternenbasis bauen?

source: Build torpedoes
de: Torpedos bauen

source: Building a %s
de: Baue ein %s

source: Building a ship
de: Baut ein Schiff

source: Building | Autobuild
de: Bauen | Automatisch bauen

source: Building | Set Build Goals...
de: Bauen | Setze Bauziele...

source: Built fighters
de: Raumjäger gebaut

source: C - Cancel Build
de: C - Bau abbrechen

source: C - Capital
de: C - Kampfschiffe

source: C - Copy
de: C - Kopieren

source: C - Gnd Combat
de: C - Bodenkampf

source: Camera
de: Kamera

source: Can detect cloaked ships
de: Können getarnte Schiffe erkennen

source: Cancel
de: Abbruch

source: Cancel "fix" order
de: Reparatur-Auftrag stornieren

source: Cancel "recycle" order
de: `Recycle'-Auftrag stornieren

source: Cancel "repair" order
de: Reparatur-Auftrag stornieren

source: Cancel dropping remote control of this ship?
de: Rückgabe der Fernsteuerung für dieses Schiff zurücknehmen?

source: Cancel request for remote control of this ship?
de: Anforderung der Fernsteuerung für dieses Schiff zurücknehmen?

source: Cancel tow
de: Abschleppen stornieren

source: Cannot access directories
de: Kann nicht auf Verzeichnisse zugreifen

source: Cannot access files here
de: Kann hier nicht auf Dateien zugreifen

source: Cannot import file
de: Datei kann nicht importiert werden

source: Cannot load game; you are not logged in
de: Spiel kann nicht geladen werden; du bist nicht eingeloggt

source: Cannot load plugins
de: Kann Plugins nicht laden

source: Cannot modify archive file
de: Archivdatei kann nicht geändert werden

source: Cannot write
de: Kann nicht schreiben

source: Capital Ships
de: Kampfschiffe

source: Capital ships
de: Kampfschiffe

source: Captured
de: Erobert

source: Cargo
de: Fracht

source: Cargo Summary
de: Fracht-Zusammenfassung

source: Cargo Summary (Prediction)
de: Fracht-Zusammenfassung (Vorhersage)

source: Cargo Transfer
de: Fracht-Transfer

source: Cargo Unload
de: Fracht entladen

source: Cargo Upload
de: Fracht aufladen

source: Cargo+Fuel
de: Fracht+Sprit

source: Cargo+Fuel+Weapons
de: Fracht+Sprit+Waffen

source: Cargo, structures, builds
de: Fracht, Strukturen, Bauten

source: Cargo: %d free
de: Frachtraum: %d frei

source: Cargo: %d/%d kt
de: Fracht: %d/%d kt

source: Carriers
de: Trägerschiffe

source: Cash
de: Geld

source: Category
de: Kategorie

source: Center
de: Mittelpunkt

source: Centered at
de: Zentrum bei

source: Chance to win ground combat: %d%%
de: Siegchange im Bodenkampf: %d%%

source: Change Character Set
de: Zeichensatz ändern

source: Change File Type
de: Dateityp ändern

source: Change Friendly Code
de: Kommandocode ändern

source: Change Primary Enemy
de: Primärziel ändern

source: Change Race Name
de: Namen unseres Volkes ändern

source: Change ally privileges
de: Allianzprivilegien ändern

source: Change field
de: Feld ändern

source: Change into this folder
de: In diesen Ordner wechseln

source: Change message detail (host-side filter)
de: Detailgrad für Nachrichten ändern (hostseitiger Filter)

source: Change message language
de: Sprache für Nachrichten ändern

source: Change our race name
de: Namen unseres Volkes ändern

source: Change password
de: Passwort ändern

source: Change race name...
de: Namen unseres Volkes ändern...

source: Changes will get effective next turn.
de: Änderungen werden nächsten Zug wirksam.

source: Character Set
de: Zeichensatz

source: Character set
de: Zeichensatz

source: Checksum error
de: Prüfsummenfehler

source: Checksum mismatch in base section
de: Prüfsummenfehler in Sternenbasen-Bereich

source: Checksum mismatch in planet section
de: Prüfsummenfehler in Planeten-Bereich

source: Checksum mismatch in ship section
de: Prüfsummenfehler in Schiffs-Bereich

source: Choose an action
de: Wähle eine Aktion

source: Choose color
de: Farbe wählen

source: Choose directory
de: Verzeichnis wählen

source: Choose files to unpack
de: Wähle zu entpackende Dateien

source: Choose marker type
de: Marker-Typ wählen

source: Choose player slots to clean
de: Wähle aufzuräumende Spieler:

source: Chunnel is impossible
de: Chunnel nicht möglich

source: Circle centered here
de: Kreis um diesen Punkt

source: Clans needed to win
de: Clans benötigt für Sieg

source: Clans to attack with
de: Mit wievielen Clans angreifen?

source: Class %d (%s)
de: Klasse %d (%s)

source: Class Results -------------
de: Ergebnisklassen ---------------

source: Classic
de: Klassisch

source: Clean Up (Sweep)
de: Aufräumen (Sweep)

source: Clear this configuration?
de: Diese Konfiguration löschen?

source: Clear this simulation arrangement?
de: Diese Simulationsaufstellung löschen?

source: Climate
de: Klima

source: Climate type: %s
de: Klima-Typ: %s

source: Climate: %s
de: Klima: %s

source: Cloakable Ships
de: Tarnbare Schiffe

source: Cloaked Fighter Bays
de: Getarnte Jäger-Startrampen

source: Cloaking
de: Tarnung

source: Clone
de: Klonen

source: Clone %s
de: Klone %s

source: Clone Ship
de: Schiff klonen

source: Clone this ship
de: Dieses Schiff klonen

source: Cloning %s
de: Klone %s

source: Cloning, and building a %s
de: Klone, und baue ein %s

source: Close
de: Schließen

source: Col
de: Kol

source: Colonies
de: Kolonien

source: Colonist Clans
de: Kolonisten

source: Colonist Happiness
de: Kolonisten-Status

source: Colonist Tax
de: Kolonisten-Steuern

source: Colonists
de: Kolonisten

source: Colonists aboard
de: Kolonisten an Bord

source: Colonists are
de: Kolonisten sind

source: Colonists pay %d mc.
de: Kolonisten zahlen %d mc.

source: Colonists pay %d of %d mc.
de: Kolonisten zahlen %d von %d mc.

source: Colonists: %s
de: Kolonisten: %s

source: Colony
de: Kolonie

source: Color
de: Farbe

source: Combat
de: Kampf

source: Combat Information
de: Kampf-Informationen

source: Combat Mass
de: Kampfmasse

source: Combat Overview
de: Schlacht-Übersicht

source: Combat Score Overview
de: Schlacht-Punktestände-Übersicht

source: Combat alliance
de: Kampf-Allianz

source: Comma-separated values
de: Komma-getrennte Werte

source: Command
de: Befehl

source: Command executed successfully on %d unit%!1{s%}.
de: Der Befehl wurde auf %d Einheit%!1{en%} erfolgreich ausgeführt.

source: Command provided by %s
de: Befehl bereitgestellt von %s

source: Command: %s
de: Befehl: %s

source: Commands: convert INFILE OUTFILE create FILE.res ID=INFILE... gallery FILE.res... File specification: bmp:PATH.bmp Bitmap file plain8:PATH.cd, custom:PATH.cd Plain 8-bit custom codec plain4:PATH.cc Plain 4-bit custom codec packed8:PATH.cd Packed 8-bit custom codec packed4:PATH.cc Packed 4-bit custom codec
de: Befehle: convert EINGABE AUSGABE create DATEI.res ID=EINGABE... gallery DATEI.res... Datei-Angaben bmp:PFAD.bmp Bitmap-Datei plain8:PFAD.cd, custom:PFAD.cd Normale Datei, 8-bit-Codec plain4:PFAD.cc Normale Datei, 4-bit-Codec packed8:PFAD.cd Gepackte Datei, 8-bit-Codec packed4:PFAD.cc Gepackte Datei, 4-bit-Codec

source: Comment
de: Kommentar

source: Common options: -w WIDTH Set width -h HEIGHT Set height -S SEED Set seed -o FILE.bmp Set output file (mandatory) Command "space": space view/starfield/nebula -s SUNS Set number of suns -p PROB Set star probability Command "planet": single planet -x NN, -y NN Set planet position (percentage) -r NN Set planet radius (percentage) -t NN Set planet temperature -X NN, -Y NN, -Z NN Set (invisible) sun position (percentage) Command "orbit": space view with planet in foreground -x NN, -y NN Set planet position (percentage) -r NN Set planet radius (percentage) -n NN Set number of stars Command "explosion": generic explosion -n NN Set size (number of hotspots) -v NN Set speed Command "shield": shield effect -n NN Set size (number of hotspots) -a NN Angle (0-7) Command "texture": textures fill(COLOR) Fill with solid color noise(RANGE) Fill with noise brush(RANGE[,angle=N,n=N]) Add brushed metal effect circ(RANGE,X,Y,R[,NOISE]) Add circular gradient effect
de: Allgemeine Optionen: -w BREITE Setze Breite -h HÖHE Setze Höhe -S START Setze Startwert -o DATEI.bmp Setze Ausgabedatei (Pflichtangabe) Befehl "space": Weltraumbild/Sternnenebel -s SONNEN Setze Anzahl Sonnen -p WKT Setze Wahrscheinlichkeit für Sterne Befehl "planet": einzelner Planet -x NN, -y NN Setze Planetenposition (Prozent) -r NN Setze Planetenradius (Prozent) -t NN Setze Planeten-Temperatur -X NN, -Y NN, -Z NN Setze Position der (unsichtbaren) Sonne (Prozent) Befehl "orbit": Weltraumbild mit Planet im Vordergrund -x NN, -y NN Setze Planetenposition (Prozent) -r NN Setze Planetenradius (Prozent) -n NN Setze Anzahl Sterne Befehl "explosion": generische Explosion -n NN Setze Größe (Anzahl Hotspots) -v NN Setze Geschwindigkeit Befehl "shield": Schild-Effekt -n NN Setze Größe (Anzahl Hotspots) -a NN Winkel Befehl "texture": Texturen fill(COLOR) Fülle mit einer Farbe noise(RANGE) Fülle mit Rauschen brush(RANGE[,angle=N,n=N]) Effekt "Gebürstetes Metall" circ(RANGE,X,Y,R[,NOISE]) Effekt "kreisförmiger Gradient"

source: Compensation
de: Kompensation

source: Compiled %d command%!1{s%}.
de: %d Befehl%!1{e%} übersetzt.

source: Compiled %d file%!1{s%}.
de: %d Datei%!1{en%} übersetzt.

source: Compiling starchart...
de: Erstelle Sternkarte...

source: Completions
de: Vervollständigungen

source: Computing...
de: Arbeite...

source: Configuration File
de: Konfigurationsdatei

source: Configuration Tool v%s - (c) 2018-2025 Stefan Reuther
de: Konfigurationswerkzeug v%s - (c) 2018-2025 Stefan Reuther

source: Configure
de: Konfigurieren

source: Configure or request remote control over a ship
de: Fernsteuerung für ein Schiff anfordern oder einrichten

source: Configure parts for Super-Refit mission
de: Teile für Super-Refit-Mission wählen

source: Configure remote control setting for newly-built ships
de: Fernsteuerung für neugebaute Schiffe einrichten

source: Confirm
de: Bestätigen

source: Console
de: Konsole

source: Console: %s
de: Konsole: %s

source: Content of %s
de: Inhalt von %s

source: Control file (checksums) can't be created
de: Control-Datei (Prüfsummen) kann nicht angelegt werden

source: Control file (checksums) will not be created
de: Control-Datei (Prüfsummen) wird nicht angelegt

source: Control screen scanner
de: Scanner in Kontrollbildschirmen

source: Controlled by
de: Gesteuert von

source: Cost
de: Kosten

source: Cost for building that starship
de: Kosten für den Bau dieses Raumschiffs

source: Cost includes %d mc for tech upgrades.
de: Kosten enthalten %d mc für Tech-Verbesserung.

source: Count
de: Anzahl

source: Course
de: Kurs

source: Created %d turn file%!1{s%}.
de: %d Turn-Datei%!1{en%} erstellt.

source: Creation of directory "%s" failed: %s
de: Verzeichnis "%s" kann nicht erstellt werden: %s

source: Crew Left
de: Crew überlebt

source: Ctrl-R
de: Strg-R

source: Ctrl-S
de: Strg-S

source: Ctrl-S - Save
de: Strg-S - Speichern

source: Cumulative chart
de: Kumulative Ansicht

source: Current
de: Aktuell

source: Current information (message)
de: Aktuelle Informationen (Nachricht)

source: Current mass: %d kt
de: Aktuelle Masse: %d kt

source: Custom Ship
de: Selbstdefiniertes Schiff

source: Cycle units (PgUp/PgDn)
de: Einheiten blättern (Bild\u2193/\u2191)

source: Cyrillic (KOI8-R)
de: Kyrillisch (KOI8-R)

source: D - Clear
de: D - Löschen

source: D - Detailed Bill
de: D - Details

source: D - Don't change
de: D - Nicht ändern

source: Damage
de: Schaden

source: Damage power
de: Schaden

source: Damage speed limit
de: Geschwindigkeitslimit wegen Schaden

source: Damage taken
de: Schaden

source: Damage: %d%%
de: Schaden: %d%%

source: Damaged Ships
de: Beschädigte Schiffe

source: Dangerous File
de: Gefährliche Datei

source: Data Transfer
de: Datenübertragung

source: Data can be received
de: Daten können empfangen werden

source: Data error
de: Datenfehler

source: Data has been received
de: Daten wurden empfangen

source: Data is expired
de: Daten sind abgelaufen

source: Death Rays
de: Todesstrahlen

source: Deep Space %s
de: Weltraum %s

source: Deep Space (%d,%d)
de: Weltraum (%d,%d)

source: Default marker
de: Standard-Marker

source: Default value
de: Standardwert

source: Defense
de: Verteidigung

source: Defense Lost
de: Verteid. verloren

source: Defense Posts
de: Verteidigungsposten

source: Del
de: Entf

source: Delete
de: Löschen

source: Delete Minefield
de: Minenfeld löschen

source: Delete database files?
de: Datenbankdateien löschen?

source: Delete these players' files?
de: Die Dateien dieser Spieler löschen?

source: Delete this auto task?
de: Diese Aufgabe löschen?

source: Delete this command?
de: Diesen Befehl löschen?

source: Delete this drawing (y/n)?
de: Diese Zeichnung löschen (y/n)?

source: Delete this message?
de: Diese Nachricht löschen?

source: Deleted Mine Field #%d
de: Gelöschtes Minenfeld #%d

source: Derived Information
de: Abgeleitete Informationen

source: Destroy
de: Zerstören

source: Differences to previous turn
de: Differenzen zu vorigem Zug

source: Differences to turn %d
de: Differenzen zu Zug %d

source: Diplomacy
de: Diplomatie

source: Directory name
de: Verzeichnisname

source: Disabling update callback "%s" due to error
de: Update-Callback "%s" wird aufgrund Fehler deaktiviert

source: Discard all changes
de: Alle Änderungen verwerfen

source: Discard changes?
de: Änderungen verwerfen?

source: Display
de: Anzeige

source: Display by
de: Anzeige nach

source: Display mode
de: Anzeigemodus

source: Dissolve this fleet?
de: Diese Flotte auflösen?

source: Distance
de: Entfernung

source: Distance from first point: %.1f ly
de: Entfernung vom ersten Punkt: %.1f ly

source: Distance too short
de: Entfernung zu gering

source: Distance: %5d m
de: Abstand: %5d m

source: Divine
de: Göttlich

source: Do you really want to exit without saving?
de: Möchtest du wirklich beenden ohne zu speichern?

source: Do you really want to sell all supplies?
de: Möchtest du wirklich alle Vorräte verkaufen?

source: Do you want newly-built ships to be available for remote control by allies by default?<br/><small>You can give this permission for each ship individually using <kbd>R</kbd> on the ship screen. The recommended setting is <b>No</b>.</small>
de: Sollen neu gebaute Schiffe für die Fernsteuerung durch Verbündete (Remote Control) zur Verfügung stehen? <small>Du kannst diese Genehmigung auch mit der Taste <kbd>R</kbd> im Schiffsmenü für jedes Schiff individuell erteilen. Die empfohlene Einstellung ist <b>Nein</b>.</small>
