Repository: stefanreuther/c2ng
Catalog: po/*.po
Languages: de

source: Do you want the host to filter out most bulk messages?<br/><small>When the filter is enabled, messages like Sensor Sweep are removed from the result file, reducing its size. PCC2 can still display the information because it is also received in the <tt>util.dat</tt> file.</small><br/><small>The recommended setting is <b>No</b> to keep the messages. You can then use PCC2's built-in filter to determine with finer granularity what you want to see.</small>
de: Soll der Host Routine-Nachrichten ausfiltern? <small>Wenn der Filter aktiv ist, werden Nachrichten wie Sensor-Ergebnisse aus der Result-Datei entfernt, was deren Größe verringert. PCC2 zeigt die entsprechenden Informationen weiterhin an, da sie auch in der Datei <tt>util.dat</tt> übertragen werden.</small> <small>Die empfohlene Einstellung ist <b>Nein</b>, um die Nachrichten zu behalten. Mit PCC2s eingebautem Filter kannst du genauer einstellen, was du sehen willst.</small>

source: Do you want to clear all selection layers?
de: Möchtest du wirklich alle Auswahlen löschen?

source: Do you want to clear this selection layer?
de: Soll diese Ebene gelöscht werden?

source: Do you want to exit PCC2?
de: Möchtest du PCC2 verlassen?

source: Do you want to install plugin "%s" (%s)?)
de: Möchtest du das Plugin "%s" (%s) installieren?

source: Do you want to optimize all colonist tax rates?
de: Möchtest du alle Kolonisten-Steuersätze optimieren?

source: Do you want to optimize all native tax rates?
de: Möchtest du alle Eingeborenen-Steuersätze optimieren?

source: Do you want to optimize all tax rates?
de: Möchtest du alle Steuersätze optimieren?

source: Do you want to proceed anyway?
de: Möchtest du dennoch fortsetzen?

source: Do you want to proceed with the original file, or use the *.c2p file?
de: Möchtest du mit der Originaldatei fortsetzen, oder die *.c2p-Datei benutzen?

source: Do you want to remove plugin '%s'?
de: Möchtest du das Plugin '%s' entfernen?

source: Do you want to remove this minefield from the starchart? Note that this will not sweep the field, you just won't see it any longer.
de: Möchtest du dieses Minenfeld aus der Sternenkarte löschen? Beachte, dass dies das Feld nicht räumen wird, du wirst es nur nicht mehr sehen.

source: Do you want to stop (terminate) that script?
de: Soll dieses Script abgebrochen werden?

source: Do you want to update plugin "%s" (%s)?)
de: Möchtest du das Plugin "%s" (%s) aktualisieren?

source: Do you want to upgrade for %d mc?
de: Möchtest du die Verbesserung für %d mc kaufen?

source: Don't pay taxes; eat colonists
de: Zahlen keine Steuern; fressen Kolonisten

source: Don't pay taxes; extend sensor range
de: Zahlen keine Steuern; erweitern Sensorreichweite

source: Don't show turn distances
de: Keine Entfernungen anzeigen

source: Double mining rates
de: Doppelter Minen-Ertrag

source: Double tax collection
de: Doppelter Steuer-Ertrag

source: Drain fuel from orbiting ships
de: Ziehen Schiffen im Orbit Treibstoff ab

source: Drawing Color
de: Zeichnungs-Farbe

source: Drawing Tag
de: Zeichnungs-Markierung (Tag)

source: Drawing filter: showing only %s
de: Zeichnungsfilter: zeige nur %s

source: Drop remote control for all affected ships?
de: Fernsteuerung für alle betroffenen Schiffe zurückgeben?

source: Drop remote control of this ship?
de: Fernsteuerung dieses Schiffs zurückgeben?

source: Duplicate definition for hull function #%d
de: Schiffsfunktion #%d doppelt definiert

source: Duplicate definition for hull function with name "%s"
de: Schiffsfunktion "%s" ist doppelt definiert

source: Duranium Density
de: Duranium-Dichte

source: Duranium aboard
de: Duranium geladen

source: Duranium cost
de: Duranium-Kosten

source: E - Add Equal
de: E - Gleichmäßig verteilen

source: E - Edit this unit
de: E - Einheit bearbeiten

source: E.T.A.
de: Reisezeit

source: ENTER - Watch sample
de: Enter - Beispiel ansehen

source: ESC - Close
de: ESC - Schließen

source: ESC - Exit
de: ESC - Ende

source: East-West
de: Ost-West

source: Economy
de: Wirtschaft

source: Edit
de: Bearbeiten

source: Edit Alliances
de: Allianzen bearbeiten

source: Edit Command
de: Befehl bearbeiten

source: Edit Comment
de: Notiz bearbeiten

source: Edit Marker
de: Marker bearbeiten

source: Edit Message
de: Nachricht bearbeiten

source: Edit Option
de: Einstellung ändern

source: Edit Population
de: Bevölkerung

source: Edit command
de: Befehl bearbeiten

source: Edit...
de: Bearbeiten...

source: Effects
de: Effekte

source: Effects on %d kt %s ship
de: Wirkung auf ein %d-kt-%s-Schiff

source: Elusive
de: Ausweichend

source: Email address
de: Email-Adresse

source: End
de: Ende

source: End X
de: Ende-X

source: End Y
de: Ende-Y

source: Ended
de: Beendet

source: Enemies
de: Feinde

source: Enemy
de: Feind

source: Enemy Minefields
de: Gegnerische Minenfelder

source: Enemy ships
de: Feindschiffe

source: Engine
de: Triebwerke

source: Engine #%d
de: Triebwerk #%d

source: Engine Load
de: Last

source: Engine Type
de: Triebwerkstyp

source: Engine tech upgrade
de: Triebwerk-Tech-Upgrade

source: Engine-Shield Bonus
de: Triebwerk-Schild-Bonus

source: Engine/Shield bonus rate
de: Triebwerk-Schild-Bonus-Rate

source: Engines
de: Triebwerke

source: Enqueue Ship Build Order
de: Schiffs-Bauauftrag erstellen

source: Enter - Build
de: Enter - Bauen

source: Enter - Change
de: Enter - Ändern

source: Enter - Select
de: Enter - Auswahl

source: Enter Password
de: Passwort eingeben

source: Enter X,Y coordinates or sector number
de: Bitte X,Y-Koordinaten oder Sektornummer eingeben

source: Enter command or expression
de: Bitte Ausdruck oder Befehl eingeben

source: Enter layer/expression to copy from
de: Kopiere von Ebene/Ausdruck

source: Enter message
de: Nachricht eingeben

source: Enter new comment
de: Neue Notiz

source: Enter new comment for %s
de: Neue Notiz für %s

source: Enter new comment for this marker
de: Neue Notiz für diesen Marker

source: Enter new comment for this planet
de: Neue Notiz für diesen Planeten

source: Enter new comment for this ship
de: Neue Notiz für dieses Schiff

source: Enter new name
de: Neuer Name

source: Enter new process priority
de: Neue Priorität

source: Enter new warp factor and confirm with ENTER
de: Bitte neuen Warpfaktor eingeben und mit ENTER bestätigen

source: Enter page name
de: Seitenname:

source: Enter password for %s
de: Passwort eingeben für %s

source: Enter population of the planet. PCC2 will then compute the maximum possible number of defense posts supported by that population. For example, %d clans support up to %d defense posts.
de: Gib die Bevölkerung des Planeten ein. PCC2 berechnet dann daraus die maximal mögliche Anzahl Verteidigungsanlagen. Beispielsweise können %d Clans bis zu %d Verteidigungsanlagen unterhalten.

source: Enter ship name or Id#
de: Schiffs-Name oder Id eingeben

source: Enter zoom level in format "3" (zoom in) or "1/4" resp. "1:4" (zoom out).
de: Gib die Zoom-Stufe im Format "3" (Vergrößern) oder "1/4" bzw. "1:4" (Verkleinern) ein.

source: Equipment & Crew
de: Ausrüstung & Mannschaft

source: Erased file %s.
de: Datei %s gelöscht.

source: Error
de: Fehler

source: Error compiling this statement: %s
de: Fehler beim Compilieren der Anweisung: %s

source: Error during execution of auto task
de: Fehler beim Ausführen der Aufgabe

source: Error during export: %s
de: Fehler beim Export: %s

source: Error during save: %s
de: Fehler beim Speichern: %s

source: Error executing this statement: %s
de: Fehler beim Ausführen der Anweisung: %s

source: Error in user-interface thread
de: Fehler im User-Interface-Thread

source: Error initializing SDL: %s
de: Fehler beim Initialisieren der SDL: %s

source: Error loading FLAK combat
de: Fehler beim Laden eines FLAK-Kampfes

source: Error loading plugin %s
de: Fehler beim Laden des Plugins %s

source: Error message
de: Fehlermeldung

source: Error reading file
de: Fehler beim Lesen einer Datei

source: Error reading starchart database
de: Fehler beim Lesen der Sternenkarten-Datenbank

source: Error saving configuration
de: Fehler beim Speichern der Konfiguration

source: Error scanning help file
de: Fehler beim Einlesen der Hilfedatei

source: Error setting video mode (%s): %s
de: Fehler beim Einstellen des Grafikmodus (%s): %s

source: Error setting video mode: %s
de: Fehler beim Einstellen des Grafikmodus: %s

source: Error updating network accounts file
de: Fehler beim Aktualisieren der Netzwerk-Konten-Datei

source: Error while closing files; written data may have been lost.
de: Fehler beim Schließen von Dateien; möglicherweise sind Daten verlorengegangen.

source: Error: unknown layout "%s"
de: Fehler: unbekanntes Layout "%s"

source: Error: unknown tile "%s"
de: Fehler: unbekannte Kachel "%s"

source: Event Callback
de: Ereignis-Callback

source: Exception in background thread
de: Ausnahme in Hintergrund-Thread

source: Excess parameter "%s"
de: Überzähliger Parameter "%s"

source: Exclude numerical FCodes
de: Außer numerische FCodes

source: Exclude special FCodes
de: Außer Spezial-FCodes

source: Execute
de: Ausführen

source: Execution of file "%s" failed: %s
de: Ausführen der Datei "%s" fehlgeschlagen: %s

source: Exit
de: Ende

source: Exit Game
de: Spiel verlassen

source: Exit without Saving
de: Beenden, ohne zu speichern

source: Expected ")"
de: Erwarte ")"

source: Expected command index after "#"
de: Erwarte Befehls-Index nach "#"

source: Expected function definition
de: Funktions-Definition erwartet

source: Experience
de: Erfahrung

source: Expiration turn
de: Verfallsdatum

source: Exploded Ship Id
de: Id des explodierten Schiffs

source: Explosion of %s%!d%!0{ (#%1$d)%}
de: Explosion von %s%!d%!0{ (#%1$d)%}

source: Explosion of ship #%d
de: Explosion von Schiff #%d

source: Export all battles
de: Alle Kämpfe exportieren

source: Export succeeded.
de: Export erfolgreich.

source: Export units in this battle
de: Einheiten in diesem Kampf exportieren

source: Expression false
de: Ausdruck falsch

source: Expression incorrectly terminated
de: Ausdruck nicht korrekt abgeschlossen

source: Expression true
de: Ausdruck wahr

source: Extended Mission
de: Erweiterte Mission

source: Extended Ufo database exists but is empty.
de: Erweiterte Ufo-Datei existiert, ist aber leer.

source: F - Equal Free Space
de: F - Gleicher Freiraum

source: F - Forecast
de: F - Vorhersage

source: F1 - Starships
de: F1 - Raumschiffe

source: F2 - Planets
de: F2 - Planeten

source: F3 - Starbases
de: F3 - Sternenbasen

source: F4 - Starchart
de: F4 - Sternenkarte

source: F7 - Search
de: F7 - Suche

source: FCode
de: Kommandocode

source: FCode: "%s"
de: K.Code: "%s"

source: FCode: "%s", Damage: %d%%
de: Kommandocode: "%s", Schaden: %d%%

source: FCode: %s
de: K.Code: %s

source: FROM: %s
de: VON: %s

source: Factories
de: Fabriken

source: Failed
de: Fehlgeschlagen

source: Failed to access game data
de: Fehler beim Zugriff auf Spieldaten

source: Failed to revert location
de: Fehler beim Zurücksetzen einer Position

source: Failed to set up VCR algorithm
de: Fehler beim Erzeugen eines VCR-Algorithmus

source: Fails at %d%% damage
de: Ausfall ab %d%% Schaden

source: Fed Crew Bonus
de: Föderation Crew-Bonus

source: Fighter
de: Raumjäger

source: Fighter Bay
de: Raumjäger-Startrampe

source: Fighter Bays
de: Startrampen

source: Fighter Cost
de: Jäger-Kosten

source: Fighter bays: %d
de: Startrampen: %d

source: Fighter cost
de: Raumjäger-Kosten

source: Fighter sweep range
de: Jäger Räum-Reichweite

source: Fighter sweep rate
de: Jäger Räum-Rate

source: Fighters
de: Raumjäger

source: Fighters Left
de: Raumjäger übrig

source: Fighters Lost
de: Raumjäger verl.

source: Fighters: %d
de: Raumjäger: %d

source: File
de: Datei

source: File "%s" is empty and will be ignored.
de: Datei "%s" ist leer und wird ignoriert.

source: File "%s" is stale and will be ignored.
de: Datei "%s" ist veraltet und wird ignoriert.

source: File "%s" is unchanged.
de: Datei "%s" ist unverändert.

source: File "fizz.bin" not found. Game data may not be usable with other programs.
de: Datei "fizz.bin" nicht gefunden. Das Spiel ist mit anderen Programmen möglicherweise nicht nutzbar.

source: File '%s' cannot be installed as a plugin. A plugin is normally specified with a *.c2p or *.c2z file.
de: Die Datei '%s' kann nicht als Plugin installiert werden. Ein Plugin wird typischerweise mit einer *.c2p- oder *.c2z-Datei definiert.

source: File '%s' does not match current turn; skipping
de: Datei '%s' gehört nicht zum aktuellen Zug; übersprungen

source: File cannot be installed. <small>The file you have chosen cannot be installed as a plugin. A plugin normally comes as a <tt>*.c2p</tt> or <tt>*.c2z</tt> file.</small>
de: Die Datei kann nicht installiert werden. <small>Die gewählte Datei kann nicht als Plugin installiert werden. Ein Plugin wird typischerweise mit einer <tt>*.c2p</tt> oder <tt>*.c2z</tt>-Datei definiert.

source: File cannot be installed. <small>There was trouble processing the alternative file.</small>
de: Die Datei kann nicht installiert werden. <small>Es gab Probleme bei der Verarbeitung der alternativen Datei.</small>

source: File contains all selections
de: Datei enthält alle Auswahlen

source: File contains all selections from a different turn; timestamp is %s
de: Datei enthält alle Auswahlen aus einem anderen Zug; der Zeitstempel ist %s

source: File contains all selections from current turn
de: Datei enthält alle Auswahlen aus dem aktuellen Zug

source: File contains invalid data
de: Datei enthält ungültige Daten

source: File contains one selection
de: Datei enthält eine Auswahl

source: File contains one selection from a different turn; timestamp is %s
de: Datei enthält eine Auswahl aus einem anderen Zug; der Zeitstempel ist %s

source: File contains one selection from current turn
de: Datei enthält eine Auswahl aus dem aktuellen Zug

source: File does not contain required font
de: Datei enthält nicht die erforderliche Schrift

source: File exists
de: Datei existiert

source: File exists but is invalid and has been ignored
de: Datei existiert, aber ist ungültig und wurde ignoriert

source: File format error
de: Dateiformat-Fehler

source: File has been ignored
de: Datei wurde ignoriert

source: File has invalid size
de: Datei hat eine ungültige Größe

source: File is invalid
de: Datei ist ungültig

source: File is missing required section
de: In Datei fehlt ein erforderlicher Bereich

source: File is missing required signature
de: Datei hat nicht die erforderliche Kennung

source: File is owned by player %d, should be %d
de: Datei gehört Spieler %d, erwartet wurde %d

source: File not found
de: Datei nicht gefunden

source: File system folder
de: Ordner im Dateisystem

source: File too large
de: Datei zu groß

source: File too short
de: Datei zu kurz

source: File type
de: Dateityp

source: File...
de: Datei...

source: Files
de: Dateien

source: Files (in '%s')
de: Dateien (in '%s')

source: Filter Drawings
de: Zeichnungen filtern

source: Filtered
de: Gefiltert

source: Fix (repair) a ship
de: Schiff reparieren

source: Fix (repair) this ship
de: Schiff reparieren

source: Fix Ship
de: Raumschiff reparieren

source: Fleet
de: Flotte

source: Fleet #%d
de: Flotte #%d

source: Fleet %d
de: Flotte %d

source: Fleet %d: %s
de: Flotte %d: %s

source: Fleet %d: led by %s
de: Flotte %d: geführt von %s

source: Fleet Cost Comparison
de: Flottenkosten-Vergleich

source: Fleet Cost Comparison... [Ctrl-C]
de: Flottenkosten-Vergleich... [Strg-C]

source: Fleet screen
de: Flotten-Bildschirm

source: Fleets
de: Flotten

source: Folder Configuration
de: Ordner-Konfiguration

source: Follow fleet
de: Flotte verfolgen

source: Forbid remote control for all affected ships?
de: Fernsteuerung für alle betroffenen Schiffe verbieten?

source: Forbid remote control of this ship?
de: Fernsteuerung dieses Schiffs verbieten?

source: Force surrender
de: Kapitulation erzwingen

source: Foreign Units
de: Fremde Einheiten

source: Foreign ships
de: Fremde Schiffe

source: Form a new fleet with %d ship%!1{s%}, leader is %s?
de: Soll eine neue Flotte mit %d Schiff%!1{en%} und Führer %s gebildet werden?

source: Forward Message
de: Nachricht weiterleiten

source: Forward...
de: Weiterleiten...

source: Fought
de: Gekämpft

source: Found %d plugin%!1{s%}
de: %d Plugin%!1{s%} gefunden

source: Free
de: Frei

source: Freighters
de: Frachter

source: Friendly Code
de: Kommandocode

source: Friendly Code: %s
de: Kommandocode: %s

source: Friendly Codes | Randomize
de: Kommandocode | Verwürfeln

source: Friendly Codes | Set to...
de: Kommandocode | Setze auf...

source: Friendly code "%s" lacking description
de: Kommandocode "%s" hat keine Beschreibung

source: Friendly code: %s
de: Kommandocode: %s

source: Friendly unload: %d clan%!1{s%}
de: Frachttransfer: %d Clan%!1{s%}

source: From
de: Von

source: From storage: %s
de: Lagerbestand: %s

source: Frozen
de: Eingefroren

source: Frozen.
de: Eingefroren.

source: Ftr
de: Jäg

source: Fuel
de: Treibstoff

source: Fuel Usage
de: Sprit-Verbrauch

source: Fuel aboard
de: Treibstoff

source: Fuel burn
de: Spritverbrauch

source: Fuel used per ly
de: Verbrauch pro Lichtjahr

source: Fuel: %d free
de: Sprit: %d frei

source: Fuel: %d/%d kt
de: Sprit: %d/%d kt

source: Full Weaponry
de: Volle Bewaffnung

source: Full name
de: Voller Name

source: Functions
de: Funktionen

source: Funds
de: Geld

source: G - Go To
de: G - Anzeigen

source: G - Goals
de: G - Bauziele

source: Game Directory Setup
de: Spielverzeichnis-Setup

source: Game Settings
de: Spiel-Einstellungen

source: Game configuration file
de: Spiel-Konfigurationsdatei

source: Game directory lost
de: Spielverzeichnis verloren

source: Game is finished
de: Spiel ist beendet

source: Gaseous
de: Gaswesen

source: Gather debris
de: Trümmer aufsammeln

source: Gather resources from a planet
de: Ressourcen von einem Planeten aufladen

source: General: --help show help -w whitespace is significant in values Load/Modify: FILE load text file --empty load empty file --load-hconfig=FILE load binary HConfig file -DKEY=VALUE set value -AKEY=VALUE add value -UKEY unset value Actions: -o FILE save result to file --stdout send result to stdout --get=OPTION get option value --save-hconfig=FILE save binary HConfig file
de: Allgemein: --help Hilfe anzeigen -w Leerzeichen in Werten sind signifikant Laden/Ändern: DATEI Textdatei laden --empty Leere Datei laden --load-hconfig=DATEI Binäre HConfig-Datei laden -DNAME=WERT Wert setzen -ANAME=WERT Wert hinzufügen -UNAME Wert löschen Aktionen: -o DATEI Ergebnis in Datei speichern --stdout Ergebnis nach stdout ausgeben --get=OPTION Wert einer Option abfragen --save-hconfig=DATEI Binäre HConfig-Datei speichern

source: Generating turn commands...
de: Erzeuge Turn-Kommandos...

source: Geometry
de: Geometrie

source: Give Planet To...
de: Planet geben an...

source: Give Ship To...
de: Schiff geben an...

source: Give away a planet
de: Planet an anderes Volk übergeben

source: Give away a ship
de: Raumschiff an anderes Volk übergeben

source: Global Actions
de: Global-Aktionen

source: Global Options: --dir=DIR Set repository, directory mode --single=DIR Set repository, single-file mode --log=CONFIG Set logger configuration Commands: add-group [OPTIONS...] Add a group get URL... Get page content import-downloads [OPTIONS...] FILE... Import downloads import-help [OPTIONS...] FILE... Import PCC2 Help files (*.xml) import-text [OPTIONS...] FILE Import plain-text file ls [-l|-t|-f|-r|-d...] [URL...] List content, recursively render [OPTIONS...] URL... Render page content as HTML verify [OPTIONS...] Verify repository content Command options: --below=ID (import, add) Set parent group (default=root) --id=ID[,ID...] (import, add) Set Id for new element --tag=ID[,ID...] (import, add) Set tag for new element --name=NAME (import, add) Set name for new element --page (import, add) Create a page --document (import, add) Create a document --charset=CS (import-text) Set character set --remove-source (import-help) Remove source notes --image-path=DIR (import-help) Path to resolve <img src> links --all (verify) Report all individual messages (default=summarize) -v (verify) Do not abbreviate messages --warn-only (verify) Show only warnings --info-only (verify) Show only information messages -l, --long (ls) Long format -t, --title (ls) Show titles -f, --forest, --tree (ls) Indent to show tree structure -r, --recursive (ls) Recursive -d, --self, --directory (ls) Show element itself, not content --site=PFX (render) Set URL prefix for "site:" links --assets=PFX (render) Set URL prefix for "asset:" links --doc=PFX (render) Set URL prefix for document links
de: Globale Optionen: --dir=VERZ Ablage, Verzeichnismodus --single=VERZ Ablage, Einzeldatei-Modus --log=KONFIG Setze Logger-Konfiguration Befehle: add-group [OPTIONEN...] Gruppe hinzufügen get URL... Inhalt einer Seite abfragen import-downloads [OPTIONS...] FILE... Download-Bereich importieren import-help [OPTIONEN...] DATEI... PCC2-Hilfedateien (*.xml) importieren import-text [OPTIONEN...] DATEI Textdatei importieren ls [-l|-t|-f|-r|-d...] [URL...] Inhalt rekursiv auflisten render [OPTIONEN...] URL... Seite als HTML rendern verify [OPTIONEN...] Inhalte überprüfen Befehlsoptionen: --below=ID (import, add) Übergeordnete Gruppe (Standard=root) --id=ID[,ID...] (import, add) Id für neues Element setzen --tag=ID[,ID...] (import, add) Tag für neues Element setzen --name=NAME (import, add) Name für neues Element setzen --page (import, add) Seite anlegen --document (import, add) Dokument anlegen --charset=CS (import-text) Zeichensatz setzen --remove-source (import-help) Notizen mit Quellen entfernen --image-path=VERZ (import-help) Verzeichnis für <img src>-Links --all (verify) Alle Meldungen einzeln zeigen (Standard=zusammenfassen) -v (verify) Meldungen nicht abkürzen --warn-only (verify) Nur Warnungen anzeigen --info-only (verify) Nur Informationen anzeigen -l, --long (ls) Langes Format -t, --title (ls) Seitentitel anzeigen -f, --forest, --tree (ls) Baumstruktur mittels Einrückung darstellen -r, --recursive (ls) Rekursiv -d, --self, --directory (ls) Element anzeigen, nicht dessen Inhalt --site=PFX (render) URL-Präfix für "site:"-Links --assets=PFX (render) URL-Präfix für "asset:"-Links --doc=PFX (render) URL-Präfix für Dokument-Links

source: Global cc-res.cfg
de: Globale cc-res.cfg

source: Go To X/Y
de: Gehe zu X/Y

source: Go to
de: Gehe zu

source: Go to fleet leader
de: Zum Flotten-Führer wechseln

source: Go to planet
de: Zum Planeten wechseln

source: Go to starbase
de: Zur Sternenbasis wechseln

source: Goal
de: Ziel

source: Government: %s (%d%%)
de: Regierung: %s (%d%%)

source: Graph
de: Grafik

source: Gravitonic accel
de: Gravitonenbeschleuniger

source: Grid
de: Raster

source: Ground
de: Boden

source: Ground Combat
de: Bodenkampf

source: Ground attack strength
de: Boden-Angriffsstärke

source: Ground defense strength
de: Boden-Verteidigungsstärke

source: HTML table
de: HTML-Tabelle

source: Has
de: Hat

source: Has Base
de: Hat Basis

source: Have
de: Vorh.

source: Have parts in storage
de: Teile auf Lager

source: Heading
de: Kurs

source: Help
de: Hilfe

source: Help file "%s" could not be opened.
de: Die Hilfedatei "%s" konnte nicht geöffnet werden.

source: Hiss effect
de: Hiss-Effekt

source: Hit
de: Trefferquote

source: Hit odds
de: Trefferquote

source: Hold space
de: Zwischenspeicher

source: Home Directory
de: Home-Verzeichnis

source: Honor alliances/teams
de: Allianzen/Teams berücksichtigen

source: Host configuration
de: Host-Konfiguration

source: Host version not known, assuming %s
de: Unbekannte Host-Version, Annahme: %s

source: Hull
de: Rumpf

source: Hull #%d
de: Rumpf #%d

source: Hull (max)
de: Rumpf (max)

source: Hull Function #%d
de: Schiffsfunktion #%d

source: Hull Id
de: Rumpf-Id

source: Hull Mass
de: Rumpf-Masse
