Repository: stefanreuther/c2ng
Catalog: po/*.po
Languages: de

source: No information on minerals available.
de: Keine Informationen über Mineralien verfügbar.

source: No information on natives available.
de: Keine Informationen über Eingeborene.

source: No locks active in system.
de: Keine Locks im System aktiv.

source: No matching ship found.
de: Kein passendes Schiff gefunden.

source: No messages
de: Keine Nachrichten

source: No messages for this ship
de: Keine Nachrichten für dieses Schiff

source: No messages sent so far
de: Keine Nachrichten gesendet bisher

source: No native population.
de: Keine Eingeborenen.

source: No natives.
de: Keine Eingeborenen.

source: No notifications
de: Keine Meldungen

source: No player data remains.
de: Keine Spielerdaten übrig.

source: No player number specified. Use "%s -h" for help
de: Keine Spielernummer angegeben. Mit "%s -h" erhalten Sie Hilfe

source: No plugins installed.
de: Keine Plugins installiert.

source: No registration in this directory!
de: Verzeichnis enthält keine Registrierung!

source: No ship effects considered
de: Keine Schiffs-Effekte berücksichtigt

source: No starbase
de: Keine Sternenbasis

source: No torps
de: Keine Torpedorohre

source: No torps/fighters
de: Keine Torpedos/Startrampen

source: No units selected for export.
de: Keine Einheit für den Export gewählt.

source: No usable registration key found, assuming unregistered player
de: Keine verwendbare Registrierung gefunden, es wird unregistriert gespielt

source: Nobody
de: Niemand

source: Nobody has %s at this place.
de: An dieser Stelle hat niemand %s.

source: Normal (plane)
de: Normal (Ebene)

source: Normal Weapons
de: Normale Waffen

source: Normal scoreboard
de: Normale Punktetabelle

source: North-South
de: Nord-Süd

source: Not building a ship
de: Kein Schiff in Bau

source: Not logged in
de: Nicht angemeldet

source: Not moving
de: bewegt sich nicht

source: Not working on a starship
de: Kein Raumschiff im Dock

source: Note: this ship can be cloned only once; it will be unclonable after the clone.
de: Hinweis: dieses Schiff kann nur einmal geklont werden, danach wird es unklonbar sein.

source: Nothing is known about this ship's cargo.
de: Über die Fracht dieses Raumschiffs ist nichts bekannt.

source: Notification
de: Meldung

source: Notifications
de: Meldungen

source: Notify
de: Meldung

source: Notify message
de: Meldung

source: Number
de: Anzahl

source: Number of Beams
de: Anzahl Geschütze

source: Number of Fighter Bays
de: Anzahl Startrampen

source: Number of Torpedo Launchers
de: Anzahl Torpedorohre

source: Number of crewmen that defect when the ship is boarded
de: Anzahl überlaufender Crewmitglieder, wenn das Schiff geentert wird

source: O - Colony
de: O - Kolonie

source: O - Options
de: O - Optionen

source: Object Id mismatch
de: Objekt-Id passt nicht

source: Object count mismatch
de: Objekt-Anzahl passt nicht

source: Object labels
de: Objekt-Beschriftungen

source: Objects
de: Objekte

source: Objects from search result only
de: Nur Objekte aus Suchergebnis

source: On hold: %d %s
de: Zwischenspeicher: %d %s

source: Only %d more supported!
de: Nur noch %d weitere möglich!

source: Open game read-only
de: Nur zum Ansehen öffnen

source: Operation cancelled
de: Operation abgebrochen

source: Option "%s" is missing its parameter
de: Fehlender Parameter für Option "%s"

source: Options
de: Optionen

source: Options... [Ctrl-O]
de: Optionen... [Strg-O]

source: Options: --game/-G DIR Game directory --root/-R DIR Root direcory --player/-P NUM Player number --readonly Open game data read-only --nostdlib Do not load standard library (core.q) -I DIR Include (load) directory --charset/-C CS Set game character set --coverage FILE.info Produce coverage report --coverage-test-name NAME Test name to write to coverage report -O LVL Optimisation level -k Execute commands, not files --log CONFIG Configure log output -q Quiet; show only script output (predefined log config)
de: Optionen: --game/-G VERZ Spielverzeichnis --root/-R VERZ Stammverzeichnis --player/-P NUM Spielernummer --readonly Spiel nur zum Ansehen öffnen --nostdlib Standardbibliothek (core.q) nicht laden -I VERZ Include-Verzeichnis (für "Load") --charset/-C ZS Spiel-Zeichensatz setzen --coverage DATEI.info Codeabdeckungs-Bericht erzeugen --coverage-test-name NAME In den Codeabdeckungs-Bericht zu schreibender Test-Name -O STUFE Optimierungsstufe -k Kommandos (keine Dateien) --log KONFIG Log-Ausgabe konfigurieren -q Stumm; nur Skript-Ausgabe anzeigen (vordefinierte Log-Konfiguration)

source: Options: -C CHARSET Set game character set -f FIELD@WIDTH Add field to report -S Export ships (same as '-A SHIP') -P Export planets (same as '-A PLANET') -A OBJECT Export specified object type (CCScript array name) -t TYPE Set output file format/type -o FILE Set output file name (default: stdout) -O CHARSET Set output file character set (default: UTF-8) -F Export list of fields instead of game data -c FILE Read configuration from file -v Show log messages (verbose mode) Types: dbf dBASE file (needs '-o') text simple text table, default table boxy text table csv, tsv, ssv comma/tab/semicolon-separated values json JSON (JavaScript) html HTML
de: Optionen: -C ZEICHENSATZ Spiel-Zeichensatz setzen -f FELD@BREITE Feld hinzufügen -S Schiffe exportieren (identisch zu '-A SHIP') -P Planeten exportieren (identisch zu '-A PLANET') -A OBJEKT Angegebenen Objekttyp exportieren (CCScript-Array-Name) -t TYP Ausgabedateiformat setzen -o DATEI Ausgabedateiname setzen (Standard: stdout) -O ZEICHENSATZ Ausgabe-Zeichensatz setzen (Standard: UTF-8) -F Exportiere Liste der Felder, nicth Spieldaten -c DATEI Konfiguration aus Datei lesen -v Log-Meldungen anzeigen Typen: dbf dBASE-Datei (erfordert '-o') text einfache Text-Tabelle, Standard table Text-Tabelle mit Rahmen csv, tsv, ssv mit Komma/Tab/Semikolon getrennte Werte json JSON (JavaScript) html HTML

source: Options: -Ccs Set game character set -Rkey, -Wkey Ignored; used for session conflict resolution -Dkey=value Define a property --language=CODE Language to use for game
de: Optionen: -Czs Spiel-Zeichensatz setzen -Rkey, -Wkey Ignoriert; für Auflösung von Sitzungskonflikten -Dkey=value Eigenschaft setzen --language=CODE Sprache für Spiel

source: Options: -f Force operation even on file conflicts --log=CONFIG Set logger configuration
de: Optionen: -f Ausführung auch bei Konflikten erzwingen --log=KONFIG Setze Logger-Konfiguration

source: Options: -n Dry run, list files that would be deleted -l Also erase database/log files usually kept several turns -a Erase all players' files -x Increase verbosity
de: Optionen: -n Probelauf, zeige Dateien, die gelöscht würden -l Auch Datenbanken/Logdateien löschen, die normalerweise länger bleiben -a Lösche Dateien aller Spieler -x Mehr Konsolenausgaben

source: Options: -w Create Windows (3.5) format [default] -d Create DOS (3.0) format -a Ignore version 3.5 part of RST -t Create TARGETx.EXT files -n Do not attempt to fix host-side errors -f Force unpack of files with failing checksums -x Increase verbosity -R Refuse race name updates -K Refuse configuration file updates -A Do not receive any attachments -u Unpack turn files as well --log=CONFIG Set logger configuration
de: Optionen: -w Windows-Format (3.5) erstellen [Standard] -d DOS-Format (3.0) erstellen -a Windows-Teil des RST ignorieren -t TARGETx.EXT-Dateien erstellen -n Keine Korrektur von Host-Fehlern -f Erzwinge Entpacken von Dateien mit Prüfsummenfehlern -x Detailliertere Ausgaben -R Keine Aktualisierung der Völkernamen -K Keine Aktualisierung von Konfigurationsdateien -A Keine Anhänge empfangen -u Auch die Turn-Dateien auspacken --log=KONFIG Setze Logger-Konfiguration

source: Orbit of %s (#%d)
de: Orbit von %s (#%d)

source: Orbit of %s (Planet #%d)
de: Orbit von %s (Planet #%d)

source: Orders
de: Aufträge

source: Origin
de: Quelle

source: Other
de: Andere

source: Other end
de: Anderes Ende

source: Others
de: Andere

source: Our offer
de: unser Angebot

source: Out of fuel in turn %d
de: Treibstoff alle in Zug %d

source: Overload mode
de: Überlast-Modus

source: Overpopulation will eat supplies
de: Überbevölkerung isst Vorräte

source: Override locks
de: Locks übergehen

source: Overview
de: Übersicht

source: Overview %d
de: Übersicht %d

source: Own Minefields
de: Eigene Minenfelder

source: Own drawings
de: Eigene Zeichnungen

source: Own ships
de: Eigene Schiffe

source: Owner
de: Besitzer

source: P - Planets
de: P - Planeten

source: PCC 1.x (almost Codepage 437)
de: PCC 1.x (fast Codeseite 437)

source: PCC2 Battle Simulation Utility v%s - (c) 2020-2025 Stefan Reuther
de: PCC2 Schlachtsimulator v%s - (c) 2020-2025 Stefan Reuther

source: PCC2 Console v%s - (c) 2017-2025 Stefan Reuther
de: PCC2 Konsole v%s - (c) 2017-2025 Stefan Reuther

source: PCC2 Database Export v%s - (c) 2017-2025 Stefan Reuther
de: PCC2 Datenbank-Export v%s - (c) 2017-2025 Stefan Reuther

source: PCC2 Documentation Manager v%s - (c) 2021-2025 Stefan Reuther
de: PCC2 Dokumentations-Manager v%s - (c) 2021-2025 Stefan Reuther

source: PCC2 File Client v%s - (c) 2017-2025 Stefan Reuther
de: PCC2 Datei-Client v%s - (c) 2017-2025 Stefan Reuther

source: PCC2 Game Difficulty Rater v%s - (c) 2012-2025 Stefan Reuther
de: PCC2 Schwierigkeits-Bewertung v%s - (c) 2012-2025 Stefan Reuther

source: PCC2 Game Directory Cleaner v%s - (c) 2010-2025 Stefan Reuther
de: PCC2 Spielverzeichnis-Bereiniger v%s - (c) 2010-2025 Stefan Reuther

source: PCC2 Graphics Codec Application v%s - (c) 2024-2025 Stefan Reuther
de: PCC2 Grafik-Codecs v%s - (c) 2024-2025 Stefan Reuther

source: PCC2 Message Search v%s - (c) 2011-2025 Stefan Reuther
de: PCC2 Nachrichten-Suche v%s - (c) 2011-2025 Stefan Reuther

source: PCC2 Play Server v%s - (c) 2019-2025 Stefan Reuther
de: PCC2 Spiel-Server v%s - (c) 2019-2025 Stefan Reuther

source: PCC2 Procedural Graphics Generator v%s - (c) 2017-2025 Stefan Reuther
de: PCC2 Prozeduraler Grafik-Generator v%s - (c) 2017-2025 Stefan Reuther

source: PCC2 Resource File Utility v%s - (c) 2023-2025 Stefan Reuther
de: PCC2 Ressourcendatei-Werkzeug v%s - (c) 2023-2025 Stefan Reuther

source: PCC2 Result File Unpacker v%s - (c) 2010-2025 Stefan Reuther
de: PCC2 Result-Entpacker v%s - (c) 2010-2025 Stefan Reuther

source: PCC2 is currently executing a script.
de: PCC2 führt geraden ein Script aus.

source: PCC2 will now create a temporary cargo storage which you can use to shuffle cargo around. It must be empty before you can finish this cargo transfer. Proceed?
de: PCC2 wird einen Zwischenspeicher erzeugen, den du nutzen kannst, um Fracht hin- und herzuschieben. Der Speicher muss wieder leer sein, bevor du diesen Frachttransfer bestätigen kannst. Fortsetzen?

source: Parameter to "-bpp" must be 8, 16 or 32
de: Parameter zu "-bpp" muss 8, 16 oder 32 sein

source: Parameter to "-size" is out of range
de: Parameter zu "-size" außerhalb des gültigen Bereichs

source: Parse error
de: Parse-Fehler

source: Passive Ship
de: Passives Schiff

source: Pay additional supplies
de: Zahlen zusätzliche Vorräte

source: Percentages
de: Prozentwerte

source: Perform auto-build on all planets?
de: Automatisch Gebäude auf allen Planeten bauen?

source: Pillage max. %d turn%!1{s%}
de: Pillage max. %d %1{Zug%|Züge%}

source: Pillage mission
de: Plündern-Mission

source: Plan
de: Geplant

source: Plan %s
de: Plane ein %s

source: Planet #%d exists for Host, but is outside valid range
de: Planet #%d existiert für den Host, liegt aber außerhalb der Karte

source: Planet #%d has data although it is reported as non-existant, host confused?
de: Daten zu Planet #%d erhalten, obwohl Planet angeblich nicht existiert, Host verwirrt?

source: Planet Immunity
de: Planeten-Immunität

source: Planet Properties
de: Planeten-Eigenschaften

source: Planet Task #%d: %s
de: Planeten-Anweisungen #%d: %s

source: Planet alliance
de: Planeten-Allianz

source: Planet has natives.
de: Planet hat Eingeborene.

source: Planet overview
de: Planeten-Überblick

source: Planetary Defense
de: Planeten-Verteidigung

source: Planetary FCode: %s
de: Planeten-Kommandocode: %s

source: Planets
de: Planeten

source: Planets by Experience Level
de: Planeten nach Erfahrungsstufe

source: Play
de: Wiedergabe

source: Play VCRs from File
de: Spiele VCR aus Datei

source: Played objects only
de: Nur gespielte Objekte

source: Player
de: Spieler

source: Player #%d
de: Spieler #%d

source: Player %d
de: Spieler %d

source: Player %d has no ship; alliance changes not transmitted
de: Spieler %d hat kein Schiff; Allianz-Befehle nicht übertragen

source: Players
de: Spieler

source: Players...
de: Spieler...

source: Please fix the following problems to make the chunnel work
de: Bitte behebe die folgenden Probleme, damit der Chunnel funktioniert

source: Please select some fields to export.
de: Bitte wähle ein paar Felder für den Export aus.

source: Please select the "Ships" and/or "Planets" option before executing a global action.
de: Bitte wähle die Option "Schiffe" und/oder "Planeten", bevor du eine Global-Aktion ausführst.

source: Plugin "%s" conflicts with the following plugins
de: Plugin "%s" kollidiert mit folgenden Plugins

source: Plugin "%s" is required by the following plugins
de: Plugin "%s" wird von folgenden Plugins benötigt

source: Plugin "%s" requires the following features
de: Plugin "%s" erfordert folgende Features

source: Plugin %s cannot be loaded because of missing preconditions
de: Plugin %s kann nicht geladen werden, da nötige Voraussetzungen fehlen

source: Plugin '%s' has been installed.
de: Plugin '%s' wurde installiert.

source: Plugin '%s' has been updated.
de: Plugin '%s' wurde aktualisiert.

source: Plugin '%s' is not known.
de: Plugin '%s' ist nicht bekannt.

source: Plugin could not be completely uninstalled.
de: Plugin konnte nicht vollständig entfernt werden.

source: Plugin not installed.
de: Das Plugin wurde nicht installiert.

source: Polygon: set of lines, starting here
de: Polygon: Linien, hier beginnend

source: Population
de: Bevölkerung

source: Population: %s
de: Bevölkerung: %s

source: Predefined expressions
de: Vordefinierte Ausdrücke

source: Predefined queries
de: Vordefinierte Abfragen

source: Predict to cursor
de: Vorhersage bis Cursor

source: Predict to end
de: Vorhersage bis Ende

source: Prediction Details
de: Vorhersage-Details

source: Prediction Effects
de: Vorhersage-Effekte

source: Prediction ends turn %d
de: Berechnung endet Zug %d

source: Preferences | Automatic optimum warp
de: Vorlieben | Automatisch optimaler Warpfaktor

source: Preferences | Automatically lock at warp
de: Vorlieben | Automatisch auf Gravitation einrasten

source: Preferences | Starchart | General settings...
de: Vorlieben | Sternenkarte | Allgemeine Einstellungen...

source: Preferences | Starchart | Object labels...
de: Vorlieben | Sternenkarte | Objekt-Beschriftungen...

source: Preferences | Taxation predicts relative growth
de: Vorlieben | Relative Bevölkerungsvorhersage in Besteuerung

source: Preferences | User Interface | Ship ability icons
de: Vorlieben | Benutzerschnittstelle | Symbole für Schiffs-Fähigkeiten

source: Preferences | User Interface | Thousands-separator
de: Vorlieben | Benutzerschnittstelle | Tausender-Trennzeichen

source: Preferences | User Interface | Use clans everywhere
de: Vorlieben | Benutzerschnittstelle | Überall Clans anzeigen

source: Preferences | User Interface | VCR...
de: Vorlieben | Benutzerschnittstelle | VCR...

source: Prefers hot planets
de: Bevorzugt heiße Planeten

source: Prefix
de: Präfix

source: Press Shift-ESC to close this window.
de: Drücke Umschalt-ESC, um dieses Fenster zu schließen

source: Press [A] to delete adjacent lines, too.
de: Drücke [A], um angrenzende Linien ebenfalls zu löschen

source: Press [W] to change this ship's waypoint.
de: Drücke [W], um den Kurs des Schiffs zu ändern.

source: Press space on a field to change it.
de: Drücke die Leertaste, um ein Feld zu ändern.

source: Press the key for which you want information.
de: Drücke die Taste, für die du Information wünschst.

source: Primary
de: Primär

source: Primary Enemy
de: Primärziel

source: Primary Enemy %s
de: Primärziel %s

source: Primary Enemy changed on %d ship%!1{s%}.
de: Primärziel wurde auf %d Raumschiff%!1{en%} geändert.

source: Primary Enemy: %s
de: Primärziel: %s

source: Priority
de: Priorität

source: Proceed
de: Fortsetzen

source: Process %d "%s" interrupted unexpectedly
de: Prozess %d "%s" wurde unerwartet unterbrochen

source: Process Manager
de: Prozess-Manager

source: Production
de: Produktion

source: Program Interoperation | Rewrap incoming messages
de: Programm-Interoperation | Eingehende Nachrichten neu umbrechen

source: Program exits abnormally (crash)
de: Programm unerwartet beendet (Absturz)

source: Properties cannot be saved and have been discarded
de: Eigenschaften können nicht gespeichert werden und wurden verworfen

source: Property record has invalid Id (%d) and has been ignored
de: Ein Eigenschafts-Datensatz hat eine ungültige Id (%d) und wird ignoriert

source: Property record has invalid content and has been ignored
de: Ein Eigenschafts-Datensatz hat ungültigen Inhalt und wird ignoriert

source: Property record has unexpected size and has been ignored
de: Ein Eigenschafts-Datensatz hat eine unerwartete Größe und wird ignoriert

source: Provides
de: Bietet

source: R - Repeat
de: R - Wiederholung

source: RGA max. %d turn%!1{s%}
de: RGA max. %d %1{Zug%|Züge%}

source: Race
de: Rasse

source: Race Names
de: Völkernamen

source: Races
de: Rassen

source: Racial Abilities
de: Rassen-Eigenschaften

source: Racial Advantages
de: Rassen-Vorteile

source: Racial ability
de: Rassen-Eigenschaft

source: Random Left/Right
de: Zufällige Seiten

source: Randomize FCodes
de: Kommandocodes verwürfeln

source: Randomize friendly codes?
de: Kommandocodes auf zufällige Werte setzen?

source: Range [ly]
de: Reichweite [ly]

source: Range error
de: Bereichs-Fehler

source: Ranges
de: Sichtweiten

source: Ranges around
de: Bereich um

source: Rating
de: Bewertung

source: Ratio of total
de: Anteil

source: Read-only
de: Nur Ansicht

source: Reading FLAK configuration from %s...
de: Lese FLAK-Konfiguration aus %s...

source: Reading configuration from %s...
de: Lese Konfiguration aus %s...

source: Real ID
de: Reale ID

source: Rebel Ground Attack mission
de: Bodenangriffs-Mission

source: Receive attachments
de: Anhänge empfangen

source: Received attachment "%s".
de: Anhang "%s" empfangen.

source: Recharge time
de: Aufladezeit

source: Record type %d, %d byte%!1{s%}
de: Datensatz %d, %d Byte%!1{s%}

source: Record type %d, part %d
de: Datensatz %d, Teil %d

source: Rectangle
de: Rechteck

source: Recycle Ship
de: Raumschiff verschrotten

source: Recycle a ship
de: Raumschiff verschrotten

source: Recycle this ship
de: Raumschiff verschrotten

source: Recycling %s
de: Verschrotte %s

source: Recycling a ship
de: Verschrottet ein Raumschiff

source: Reduced %s
de: Verringerte %s

source: Reduced %s (%s)
de: Verringerte %s (%s)

source: Refuel ships
de: Schiffe auftanken

source: Registered
de: Registriert

source: Regular starchart
de: Normale Sternenkarte

source: Remaining
de: Verbleibend

source: Remote Control
de: Fernsteuerung

source: Remote Control | Allow
de: Fernsteuerung | Erlauben

source: Remote Control | Drop
de: Fernsteuerung | Zurückgeben

source: Remote Control | Forbid
de: Fernsteuerung | Verbieten

source: Remote Control | Request
de: Fernsteuerung | Anfordern

source: Remote control has been allowed for %d ship%!1{s%}.
de: Fernsteuerung wurde für %d Schiff%!1{e%} erlaubt.

source: Remote control has been dropped for %d ship%!1{s%}.
de: Fernsteuerung wurde für %d Schiff%!1{e%} zurückgegeben.

source: Remote control has been forbidden for %d ship%!1{s%}.
de: Fernsteuerung wurde für %d Schiff%!1{e%} verboten.

source: Remote control has been requested for %d ship%!1{s%}.
de: Fernsteuerung wurde für %d Schiff%!1{e%} angefordert.

source: Remote-control flag
de: Fernsteuerungsstatus

source: Remove
de: Löschen

source: Remove leader from fleet?
de: Führer aus der Flotte entfernen?

source: Removing plugin '%s'...
de: Entferne Plugin '%s'...

source: Rename Fleet #%d
de: Flotte #%d umbenennen

source: Rename Starship #%d
de: Raumschiff #%d umbenennen

source: Repair base
de: Basis reparieren

source: Repair/recycle a starship...
de: Raumschiff reparieren/verschrotten

source: Repairing %s
de: Repariere %s

source: Repairing a ship
de: Repariert ein Schiff

source: Replicate Ship
de: Raumschiff vervielfachen

source: Reply to
de: Antwort an

source: Reptilian
de: Reptilien

source: Request configuration
de: Konfiguration anfordern

source: Request file from host | Configuration (pconfig.src)
de: Datei vom Host anfordern | Konfiguration (pconfig.src)

source: Request file from host | Friendly code list (xtrafcode.txt)
de: Datei vom Host anfordern | Kommandocode-Liste (xtrafcode.txt)

source: Request file from host | Race names (race.nm)
de: Datei vom Host anfordern | Völker-Namen (race.nm)

source: Request friendly code list
de: Liste der Kommandocodes anfordern

source: Request race names file
de: Rassennamen-Datei anfordern

source: Request remote control for all affected ships?
de: Fernsteuerung für alle betroffenen Schiffe anfordern?

source: Request remote control of this ship?
de: Fernsteuerung für dieses Schiff anfordern?

source: Requires
de: Erfordert

source: Research
de: Recherche

source: Reset Location
de: Position zurücksetzen

source: Resource configuration file
de: Ressourcen-Konfigurationsdatei

source: Resource file (artwork)
de: Ressourcen-Datei (Grafik)

source: Resources Needed
de: Benötigte Ressourcen

source: Restart task from beginning
de: Beginne Aufgabe erneut

source: Result file available
de: Result-Datei verfügbar

source: Result file is not a regular file
de: Result-Datei ist keine reguläre Datei

source: Results after %d simulation%!1{s%}
de: Ergebnisse nach %d Simulation%!1{en%}

source: Return to race selection
de: Zurück zur Spielauswahl

source: Revise Messages
de: Nachrichten überarbeiten

source: Revise...
de: Überarbeiten...

source: Right mouse button / Enter locks on...
de: Rechte Maustaste / Enter fixiert auf...

source: Riots — Colonists do not pay %d mc.
de: Aufstand — Kolonisten zahlen %d mc nicht.

source: Riots — Natives do not pay taxes.
de: Aufstand — Eingeborene zahlen keine Steuern.

source: Rob failure odds
de: Rob-Fehlschlagsrate

source: Root
de: Stammverzeichnis

source: Root Directory
de: Stammverzeichnis

source: Round wrap (circular, PWrap)
de: Rund (kreisförmig, PWrap)

source: Run
de: Ausführen

source: Runnable
de: Auszuführen

source: Running
de: Läuft

source: S - Save
de: S - Speichern

source: S - Sell Supplies
de: S - Vorräte verk.

source: S - Series
de: S - Serie

source: S - Starships
de: S - Raumschiffe

source: SB Defense: %d; Fighters: %d; Damage: %d%%
de: SB-Verteidigung: %d; Raumjäger: %d; Schaden: %d%%

source: SB Ftrs Lost
de: SB-Jäger verl.

source: Sample hull
de: Beispiel-Typ

source: Save
de: Speichern

source: Save & Exit
de: Speichern & Beenden

source: Save All Messages
de: Alle Nachrichten speichern

source: Save All Selections
de: Alle Auswahlen speichern

source: Save Page
de: Seite speichern

source: Save Selection
de: Auswahl speichern

source: Save Settings
de: Einstellungen speichern

source: Save Simulation
de: Simulation speichern

source: Save Task
de: Aufgabe speichern

source: Save all battles
de: Alle Kämpfe speichern

source: Save and keep playing
de: Speichern und weiterspielen

source: Save only
de: Nur speichern

source: Save this Message
de: Diese Nachricht speichern

source: Save this battle
de: Diesen Kampf speichern

source: Saved %s (%d unit%!1{s%})
de: %s gespeichert (%d Einheit%!1{en%})

source: Scanned help file %s.
de: Hilfedatei %s indexiert.

source: Score
de: Punkte
