Repository: stefanreuther/c2ng
Catalog: po/*.po
Languages: de

source: This ability defines the meaning of ships' mission 9.
de: Diese Fähigkeit definiert die Bedeutung der Schiffsmission 9.

source: This base is already building a %s. Proceed anyway and delay this order?
de: Diese Sternenbasis baut bereits ein %s. Klonen wird diesen Auftrag verzögern. Fortsetzen?

source: This base is already building a %s. Proceed anyway and replace this order?
de: Diese Sternenbasis baut bereits ein %s. Soll dieser Auftrag ersetzt werden?

source: This base is already cloning %s (#%d). Do you want to cancel that order? If you say "No", this ship will be built after the clone completed.
de: Diese Sternenbasis klont gerade %s (#%d). Soll dieser Auftrag storniert werden? Wenn du mit "Nein" antwortest, wird dieser Bauauftrag ausgeführt, nachdem das Klonen beendet ist.

source: This base is already cloning %s. Proceed anyway and replace this order?
de: Diese Sternenbasis klont gerade %s. Wenn du fortsetzt, wird dieser Auftrag ersetzt. Fortsetzen?

source: This battle cannot be played.
de: Dieser Kampf kann nicht wiedergegeben werden.

source: This command does not take positional parameters
de: Dieser Befehl akzeptiert keine Positionsparameter

source: This command was not recognized.
de: Dieser Befehl wurde nicht erkannt.

source: This configuration file contains %d change%!1{s%} to the current game configuration. Note that loading wrong configuration can cause PCC2 to show wrong predictions and, in worst case, produce invalid turns. Do you want to apply the new configuration?
de: Diese Konfigurationsdatei enthält %d Änderung%!1{en%} zur aktuellen Spielkonfiguration. Beachte, dass Laden einer falschen Konfiguration dafür sorgen kann, dass PCC2 falsche Vorhersagen anzeigt und im schlimmsten Fall ungültige Züge erstellt. Soll die neue Konfiguration angewendet werden?

source: This configuration file contains no changes to the current game configuration.
de: Diese Konfigurationsdatei enthält keine Änderungen zur aktuellen Spielkonfiguration.

source: This directory contains a data conflict. <small>The files in this directory belong to different games or turns. This situation is not supported and may cause problems with some software. PCC2 provides a <b>Sweep</b> to resolve this situation by deleting conflicting files.</small> Do you want to use the Sweep function?
de: Dieses Verzeichnis enthält einen Datenkonflikt. <small>Die Dateien in diesem Verzeichnis gehören zu verschiedenen Partien oder Zügen. Dies wird nicht unterstützt und kann zu Problemen mit manchen Programmen führen. PCC2 bietet eine Funktion <b>Sweep</b>, um diese Situation durch Löschen der störenden Dateien zu bereinigen.</small> Möchtest du die Sweep-Funktion benutzen?

source: This directory contains no files to unpack.
de: Dieses Verzeichnis enthält keine Dateien, die entpackt werden könnten.

source: This fight could not be played. You can use [Shift+Ins] to use this unit's status before the fight for simulation.
de: Dieser Kampf kann nicht wiedergegeben werden. Mit [Umschalt+Einfg] kannst du den Status dieser Einheit vor dem Kampf für die Simulation verwenden.

source: This file contained %d line%1{ which is%|s which are%} not permitted in Auto Tasks. %1{It has%|They have%} been skipped.
de: Diese Datei enthielt %d Zeile%1{, die in einer Aufgabe nicht zulässig ist. Sie wurde ignoriert%|n, die in einer Aufgabe nicht zulässig sind. Sie wurden ignoriert%}.

source: This file does not contain any battles.
de: Diese Datei enthält keine Kämpfe.

source: This function is under control of "%s". Proceed anyway?
de: Diese Funktion wird derzeit von "%s" gesteuert. Dennoch fortsetzen?

source: This game seems to use PHost, but you do not have PCONFIG.SRC. PCC2 has requested this file for you using a command message.
de: Dieses Spiel scheint PHost zu benutzen, aber du hast keine PCONFIG.SRC. PCC2 hat diese Datei für dich mit einer Kommandonachricht angefordert.

source: This is not a valid auto task command.
de: Dies ist kein gültiger Befehl für eine Aufgabe.

source: This is the maximum amount.
de: Dies ist die maximale Anzahl.

source: This key is handled internally.
de: Diese Taste wird intern verarbeitet.

source: This key is not bound.
de: Diese Taste ist nicht belegt.

source: This key is unbound by %s.
de: Diese Tastenbelegung wird von %s aufgehoben.

source: This list does not include any of your ships.
de: Diese Liste enthält keines deiner Schiffe.

source: This message has been confirmed.
de: Diese Meldung wurde bestätigt.

source: This overview covers all %d fights.
de: Diese Übersicht berücksichtigt alle %d Kämpfe.

source: This process does not own any locks.
de: Dieser Prozess hält keine Locks.

source: This ship
de: Dieses Schiff

source: This ship cannot be cloned here, because its real owner cannot clone it. You have to own it yourself to be able to clone it.
de: Dieses Schiff kann hier nicht geklont werden, da sein Besitzer es nicht klonen kann. Das Schiff muss dir gehören, damit du es klonen kannst.

source: This ship cannot tow.
de: Dieses Schiff kann nicht abschleppen.

source: This ship has an active "Beam Up Multiple" order. Its mission will be overridden by PHost. Continue anyway?
de: Dieses Schiff hat einen aktiven "Heraufbeamen (Beam Up Multiple)"-Auftrag. PHost wird seine Mission überschreiben. Dennoch fortsetzen?

source: This ship is already being towed. Tow chains will not work. Continue anyway?
de: Dieses Schiff wird bereits abgeschleppt. Abschleppen in Ketten funktioniert nicht. Dennoch fortfahren?

source: This ship is member of a fleet which is on a intercept course. Changing the mission will lose the intercept lock. Leave the fleet and continue?
de: Dieses Schiff ist Mitglied einer Flotte, die auf einem Abfangkurs ist. Ändern der Mission wird den Abfangkurs verlassen. Flotte verlassen?

source: This ship is member of a fleet which is on a intercept course. You cannot tow and intercept at the same time.
de: Dieses Schiff ist Mitglied einer Flotte, die auf einem Abfangkurs ist. Abfangen und Abschleppen gleichzeitig ist nicht möglich.

source: This ship is member of a fleet. Do you want to set the waypoint of the whole fleet, or do you want to leave the fleet?
de: Dieses Schiff ist Mitglied einer Flotte. Möchtest du den Kurs für die gesamte Flotte setzen, oder die Flotte verlassen?

source: This ship is member of a fleet. To clone, it must leave the fleet and stay here. Leave the fleet?
de: Dieses Schiff ist Mitglied einer Flotte. Zum Klonen muss es die Flotte verlassen und hier bleiben. Flotte verlassen?

source: This ship is unclonable.
de: Dieses schiff ist unklonbar.

source: This simulation already contains the maximum possible number of ships.
de: Diese Simulation enthält bereits die maximal mögliche Anzahl Schiffe.

source: This simulation seems to have been set up with a different ship list. To regenerate the intended results, restart the Simulator from the correct game directory.
de: Diese Simulation wurde mit einer anderen Schiffsliste gespeichert. Um die ursprünglichen Ergebnisse zu erhalten, starte den Simulator aus dem korrekten Spielverzeichnis.

source: This starbase already has a build order. Do you want to change that order? <small>To exit the ship build screen without changing the build order, use "Exit" (ESC). To replace the existing order with your new choice, use <kbd>Y</kbd>.</small>
de: Diese Sternenbasis hat bereits einen Bauauftrag. Möchtest du diesen Auftrag ändern? <small>Um den Baubildschirm ohne Änderung zu verlassen, nutze "Ende" (ESC). Um den existierenden Bauauftrag mit deiner neuen Auswahl zu ersetzen, nutze <kbd>J</kbd>.</small>

source: This starbase is already recycling %s. If you continue, this order will be replaced. Continue?
de: Diese Sternenbasis verschrottet bereits %s. Wenn du fortsetzt, wird dieser Auftrag ersetzt. Fortsetzen?

source: This starbase is already repairing %s. If you continue, this order will be replaced. Continue?
de: Diese Sternenbasis repariert bereits %s. Wenn du fortsetzt, wird dieser Auftrag ersetzt. Fortsetzen?

source: This turn is not available. <small>Enable the backup functionality in <b>Options</b> to make PCC2 save copies of old result files.</small>
de: Dieser Zug ist nicht verfügbar. <small>Aktiviere die Backup-Funktionalität in den <b>Optionen</b>, damit PCC2 Kopien alter Results speichert.</small>

source: This unit cannot be added to simulation because PCC2 cannot interpret its data correctly.
de: Diese Einheit kann nicht in die Simulation eingefügt werden, da PCC2 ihre Daten nicht korrekt interpretieren kann.

source: This unit did not survive the fight. You can use [Shift+Ins] to use this unit's status before the fight for simulation.
de: Diese Einheit hat den Kampf nicht überlebt. Mit [Umschalt+Einfg] kannst du den Status dieser Einheit vor dem Kampf für die Simulation verwenden.

source: This unit is already executing the command "%s". Do you want to execute the new order before that, or do you want it at the end of its current task?
de: Diese Einheit führt bereits den Befehl "%s" aus. Möchtest du den neuen Befehl davor oder am Ende der Aufgabenliste ausführen?

source: This unit's status could not be written back.
de: Der Status dieser Einheit konnte nicht zurück übertragen werden.

source: This version of PCC2 does not support this account of type "%s".
de: Diese Version von PCC unterstützt keine Konten vom Typ "%s".

source: This will reset all units at this place to their state at the beginning of the turn. Please choose which areas you want to reset. <b>Cargo</b> will reset everything that interacts with cargo (buildings, transfers, etc.), <b>Missions</b> will reset everything else.
de: Hiermit werden alle Einheiten an dieser Position auf ihren Zustand am Anfang des Zuges zurückgesetzt. Bitte wähle, welche Bereiche du rücksetzen möchtest. <b>Fracht</b> setzt alles zurück, was mit Fracht zusammenhängt (Bauten, Transfers, usw.), <b>Missionen</b> den Rest.

source: Time: %3d:%02d
de: Zeit: %3d:%02d

source: Tip of the Day
de: Tip des Tages

source: To
de: Bis

source: To build this beam, you need tech %d.
de: Um dieses Geschütz zu bauen, benötigst du Tech %d.

source: To build this engine, you need tech %d.
de: Um dieses Triebwerk zu bauen, benötigst du Tech %d.

source: To build this hull, you need tech %d.
de: Um diesen Rumpf zu bauen, benötigst du Tech %d.

source: To build this torpedo launcher, you need tech %d.
de: Um dieses Torpedorohr zu bauen, benötigst du Tech %d.

source: To build this torpedo, you need tech %d.
de: Um diesen Torpedo zu bauen, benötigst du Tech %d.

source: To build: %d
de: Zu bauen: %d

source: To build: %d/%d
de: Zu bauen: %d/%d

source: To clone this ship, you need to upgrade your technology over Tech 6. As a shareware player, you can't do this.
de: Um dieses Schiff zu klonen, müsstest du den Tech Level über Tech 6 anheben. Als unregistrierter Spieler kannst du das nicht tun.

source: To split a fleet, please select the ships which should go into one fleet using <kbd>.</kbd>, and unselect those which should go into the other.
de: Um eine Flotte zu teilen, wähle die Schiffe, die in die eine Flotte sollen, mit <kbd>.</kbd>, und deselektiere die, die in die andere sollen.

source: To sweep %d mines, use...
de: Um %d Minen zu räumen, nutze...

source: To sweep %d web mines, use...
de: Um %d Fangminen zu räumen, nutze...

source: To...
de: An...

source: To: %s
de: An: %s

source: Tons sunk
de: Versenkte Masse

source: Too many different marker tags. Some were ignored.
de: Zu viele verschiedene Marker-Tags. Einige wurden ignoriert.

source: Too many entries in file
de: Zu viele Einträge in der Datei

source: Too many label updates; ignoring some. Check your "Label.Planet" and/or "Label.Ship" expression.
de: Zu viele Aktualisierungen der Beschriftungen; einige wurden ignoriert. Prüfe die Einstellungen "Label.Planet" und/oder "Label.Ship".

source: Too many objects in file
de: Zu viele Objekte in Datei

source: Top %d %s Planets
de: Top %d %s-Planeten

source: Torp Cost
de: Torpedo-Kosten

source: Torpedo Launchers
de: Torpedorohre

source: Torpedo Ships
de: Torpedoschiffe

source: Torpedo Type
de: Torpedo-Typ

source: Torpedo Type #%d
de: Torpedo-Typ #%d

source: Torpedo cost
de: Torpedo-Kosten

source: Torpedoes
de: Torpedos

source: Torpedoes: %d
de: Torpedos: %d

source: Torps Fired
de: Gefeuerte Torpedos

source: Torps Hit
de: Torpedotreffer

source: Torps Launched
de: Gefeuerte Torpedos

source: Torps Left
de: Verbleibende Torpedos

source: Total
de: Gesamt

source: Total Cost
de: Gesamtkosten

source: Total Duranium
de: Duranium gesamt

source: Total Mass
de: Gesamtmasse

source: Total Molybdenum
de: Molybdenum gesamt

source: Total Neutronium
de: Neutronium gesamt

source: Total Planets
de: Planeten insgesamt

source: Total Ships
de: Schiffe gesamt

source: Total Tritanium
de: Tritanium gesamt

source: Total ships in game
de: Schiffe im Spiel

source: Totals
de: Gesamt

source: Tow
de: Abschleppen

source: Tow Group
de: Abschlepp-Auftrag

source: Tow number
de: Tow-Nummer

source: Towed ship's prediction
de: Berechnung für abgeschlepptes Schiff

source: Transfer %s
de: %s-Transfer

source: Transfer cargo to...
de: Frachttransfer zu...

source: Transfer cash/ammo to foreign ship
de: Geld/Munition auf fremdes Schiff laden

source: Transfer which cargo?
de: Welches Frachtgut übertragen?

source: Transferring to %s
de: Transferiere an %s

source: Travelled this turn
de: Bewegung diesen Zug

source: Triple Beam Kill
de: Geschütze Dreifach-Kill

source: Tritanium Density
de: Tritanium-Dichte

source: Tritanium aboard
de: Tritanium geladen

source: Tritanium cost
de: Tritanium-Kosten

source: Turn %d
de: Zug %d

source: Turn History
de: Vergangene Züge

source: Turn checker output
de: Ausgabe des Turn-Checkers

source: Turn file belongs to player %d
de: Turn-Datei gehört zu Spieler %d

source: Turn file contains %d attachment%!1{s%}
de: Turn-Datei enthält %d Datei-An%!1{änge%|ang%}

source: Turn file contains invalid command code %d
de: Turn-Datei enthält ungültigen Befehl %d

source: Turn file has wrong timestamp (%s != %s)
de: Turn-Datei hat falschen Zeitstempel (%s != %s)

source: Turn file refers to non-existant planet %d
de: Turn-Datei verweist auf nicht-existierenden Planeten %d

source: Turn file refers to non-existant ship %d
de: Turn-Datei verweist auf nicht-existierendes Schiff %d

source: Turn file refers to non-existant starbase %d
de: Turn-Datei verweist auf nicht existierende Sternenbasis %d

source: Turn file refers to planet %d which is not ours
de: Turn-Datei verweist auf Planet %d, welcher nicht uns gehört

source: Turn file refers to ship %d which is not ours
de: Turn-Datei verweist auf Schiff %d, welches nicht uns gehört

source: Turn file refers to starbase %d which is not ours
de: Turn-Datei verweist auf Sternenbasis %d, welche nicht uns gehört

source: Turn marked temporary.
de: Turn als vorläufig markiert.

source: Turn submitted
de: Turn eingereicht

source: Turn viewed
de: Turn angesehen

source: Turn was accepted
de: Turn wurde akzeptiert

source: Turn was accepted with warnings (yellow)
de: Turn wurde mit Warnungen akzeptiert (gelb)

source: Turn was rejected (invalid)
de: Turn wurde abgewiesen (ungültig)

source: Turn was rejected (red)
de: Turn wurde abgewiesen (rot)

source: Turn was stale
de: Turn war veraltet

source: Turn: Location
de: Zug: Position

source: Type
de: Typ

source: U - Unload
de: U - Entladen

source: Ufo #%d and wormhole #%d do not match.
de: Ufo #%d und Wurmloch #%d passen nicht zueinander.

source: Ufo Information
de: Ufo-Informationen

source: Unable to create backup file
de: Backup-Datei kann nicht erzeugt werden

source: Unable to create file
de: Datei kann nicht angelegt werden

source: Unable to create file %s: %s
de: Datei %s kann nicht erzeugt werden: %s

source: Unable to determine derived information.
de: Abgeleitete Informationen nicht ermittelbar.

source: Unable to download result file
de: Result kann nicht heruntergeladen werden

source: Unable to find a free file name for screenshot
de: Kann keinen Namen für Bildschirmfoto generieren

source: Unable to install plugin.
de: Plugin kann nicht installiert werden.

source: Unable to load %s: %s
de: %s kann nicht geladen werden: %s

source: Unable to load scripts and auto-tasks
de: Skripte und Auto-Tasks können nicht geladen werden

source: Unable to load simulation. %s
de: Simulation kann nicht geladen werden. %s

source: Unable to load: %s
de: Kann nicht geladen werden: %s

source: Unable to modify Auto Task at this point. It might be in use by another part of the program.
de: Die Aufgabe kann derzeit nicht modifiziert werden. Möglicherweise wird sie gerade in einem anderen Programmteil benutzt.

source: Unable to open file %s: %s
de: %s kann nicht geöffnet werden: %s

source: Unable to open profile directory
de: Profil-Verzeichnis kann nicht geöffnet werden

source: Unable to save %s: %s
de: %s kann nicht gespeichert werden: %s

source: Unable to save game
de: Spiel kann nicht gespeichert werden

source: Unable to save message: %s
de: Nachricht kann nicht gespeichert werden: %s

source: Unable to save simulation. %s
de: Simulation kann nicht gespeichert werden. %s

source: Unable to save: %s
de: Kann nicht gespeichert werden: %s

source: Unable to uninstall plugin.
de: Plugin kann nicht entfernt werden.

source: Unable to view utility data file
de: util.dat kann nicht angezeigt werden

source: Unable to write attachment
de: Anhang kann nicht geschrieben werden

source: Unable to write to file %s: %s
de: Datei %s kann nicht geschrieben werden: %s

source: Unarmed
de: Unbewaffnet

source: Unarmed ships
de: Unbewaffnete Schiffe

source: Unbelievable number of visual contacts
de: Unglaubliche Anzahl gesichteter Schiffe

source: Uncaught exception
de: Unbehandelte Ausnahme

source: Unclassified
de: Unklassifiziert

source: Undo Supply Sale
de: Vorräte Verkaufen - Rückgängig

source: Unexpected error
de: Unerwarteter Fehler

source: Unexpected object
de: Unerwartetes Objekt

source: Unhandled exception while loading "%s"
de: Unbehandelte Ausnahme beim Laden von "%s"

source: Uninstall Plugin
de: Plugin entfernen

source: Uninstallation of "%s" might be incomplete.
de: Entfernen von "%s" ist möglicherweise unvollständig.

source: Unit
de: Einheit

source: Unit Results ------------
de: Einheiten-Ergebnisse --------------------

source: Unit cannot be added to simulation.
de: Einheit kann nicht zu Simulation hinzugefügt werden.

source: Unit could not be added to simulation.
de: Einheit kann nicht zu Simulation hinzugefügt werden.

source: Unit score record is invalid
de: Unit-Score-Datensatz ist ungültig

source: Universal Minefield FCode
de: Universal-Minenfeld-Code

source: Universal ability
de: Allgemeine Fähigkeit

source: Unknown
de: Unbekannt

source: Unknown PHost
de: Unbekannter PHost

source: Unknown command line parameter "-%s"
de: Unbekannter Kommandozeilenparameter "-%s"

source: Unknown error
de: Unbekannter Fehler

source: Unknown government.
de: Unbekannte Regierungsform

source: Unknown hull function "%s"
de: Unbekannte Schiffsfunktion "%s"

source: Unknown native race.
de: Unbekannte Eingeborene.

source: Unknown option "-%s"
de: Unbekannte Option "-%s"

source: Unknown record type.
de: Unbekannter Datensatz.

source: Unknown reference target in record definition.
de: Unbekanntes Verweisziel in Datensatzdefinition.

source: Unknown ship type
de: Unbekannter Schiffstype

source: Unknown turn status (%d)
de: Unbekannter Turn-Status (%d)

source: Unknown type
de: Unbekannter Typ

source: Unload All Ships
de: Alle Schiffe entladen

source: Unload cash/ammo onto foreign planet
de: Geld/Munition auf fremden Planeten ausladen

source: Unload incoming ships
de: Ankommende Schiffe entladen

source: Unload ship...
de: Schiff entladen...

source: Unload →
de: Entladen →

source: Unloading to %s
de: Entlade nach %s

source: Unmark found objects
de: Markierung gefundener Objekte aufheben

source: Unmark these starbases
de: Markierung dieser Sternenbasen aufheben

source: Unowned Planets
de: Unbesetzte Planeten

source: Unpack | Create TARGETx.EXT files
de: Unpack | Erzeuge TARGETx.EXT-Dateien

source: Unpack | Data file format
de: Unpack | Dateiformat

source: Unpack | Error correction
de: Unpack | Fehlerkorrektur

source: Unpack | Race name changes
de: Unpack | Änderungen der Völkernamen

source: Unpacked %d additional Ufo%!1{s%}.
de: %d %1{weiteres Ufo%|weitere Ufos%} entpackt.

source: Unpacked %d combat recording%!1{s%}.
de: %d Kampf-Bericht%!1{e%} entpackt.

source: Unpacked %d message%!1{s%}.
de: %d Nachricht%!1{en%} entpackt.

source: Unpacked %d new attachment%!1{s%}.
de: %d Anh%1{ang%|änge%} entpackt.

source: Unpacked %d planet%!1{s%}.
de: %d Planet%!1{en%} entpackt.

source: Unpacked %d result file%!1{s%}.
de: %d Result-Datei%!1{en%} entpackt.

source: Unpacked %d ship%!1{s%}.
de: %d Schiff%!1{e%} entpackt.

source: Unpacked %d starbase%!1{s%}.
de: %d Sternenbas%1{is%|en%} entpackt.

source: Unpacked %d visual contact%!1{s%} to "target%d.dat".
de: %d Schiffssichtung%!1{en%} nach "target%d.dat" entpackt.

source: Unpacked %d visual contact%!1{s%} to "target%d.ext".
de: %d Schiffssichtung%!1{en%} nach "target%d.ext" entpackt.

source: Unpacked %d visual contact%!1{s%}.
de: %d Schiffssichtung%!1{en%} entpackt.

source: Unpacked ship location file with %d entries.
de: Schiffs-Positionsdatei mit %d Einträgen entpackt.

source: Unpacked version 3.5 object file (kore).
de: Version-3.5-Objekt-Datei (kore) entpackt.

source: Unpacking player %d: %s
de: Entpacke Spieler %d: %s

source: Unrecognized proxy URL: "%s"
de: Nicht erkannte Proxy-URL: "%s"

source: Unregistered
de: Unregistriert

source: Unsorted
de: Unsortiert

source: Unsupported compression mode
de: Nicht unterstütztes Kompressionsverfahren

source: Unsupported feature
de: Nicht unterstützte Funktion

source: Unsupported file format
de: Datei-Format wird nicht unterstützt

source: Unsupported file format version
de: Nicht unterstützte Datei-Format-Version

source: Unterminated string constant
de: Nicht abgeschlossene Zeichenkette

source: Up to %d of our clans survive%1{s%}.
de: Bis zu %d unserer Clans überleb%1{t%|en%}.

source: Up to %d of their clans survive%1{s%}.
de: Bis zu %d ihrer Clans überleb%1{t%|en%}.

source: Update/write back
de: Aktual./Zurückschr.

source: Updating plugin '%s'...
de: Aktualisiere Plugin '%s'...

source: Uploading data...
de: Daten hochladen...

source: Usage
de: Verbrauch
