Repository: stefanreuther/c2ng
Catalog: po/*.po
Languages: de

source: Hull Type
de: Rumpftyp

source: Hull mass: %d kt
de: Rumpfmasse: %d kt

source: Hull tech upgrade
de: Rumpf-Tech-Upgrade

source: Hulls
de: Rümpfe

source: Hulls...
de: Schiffstypen...

source: Humanoid
de: Humanoide

source: I - Invert
de: I - Invertieren

source: ID# Pl Type Name Eng Beams T/F Ammo Dam% Lvl
de: ID# Pl Typ Name Trw. Gesch. T/J Muni Sch% Lvl

source: If a player (row) declares another one (column) their enemy, ships with Primary Enemy set will behave as if the enemy were an additional Primary Enemy.
de: Wenn ein Spieler (Zeile) einen anderen (Spalte) zum Feind erklärt, werden Schiffe mit Primärziel den Feind als zusätzliches Primärziel betrachten.

source: If a player (row) offers an alliance to another one (column), their units will not attack the ally's units.
de: Wenn ein Spieler (Zeile) einem anderen (Spalte) eine Allianz bietet, werden seine Einheiten die des Alliierten nicht angreifen.

source: Image "%s" not found
de: Bild "%s" nicht gefunden

source: Immune to planet attacks if out of fuel
de: Immun gegen Angriff von Planeten, wenn kein Treibstoff

source: Imperial Statistics
de: Imperiums-Statistik

source: Imperial Stats
de: Imperiums-Statistik

source: In free space
de: Im freien Raum

source: In storage: %d
de: Auf Lager: %d

source: Inbox
de: Posteingang

source: Include engines
de: Triebwerke berechnen

source: Include planet defense
de: Planetenverteidigung berechnen

source: Include planets
de: Planeten

source: Include ship tech levels
de: Raumschiff-Tech-Levels berechnen

source: Include ships
de: Raumschiffe

source: Include starbase
de: Sternenbasis berechnen

source: Include starbase tech levels
de: Sternenbasis-Tech-Levels berechnen

source: Include team units
de: Teammitglieder berücksichtigen

source: Include tech upgrades
de: Tech-Upgrades einbeziehen

source: Include torpedoes
de: Torpedos berechnen

source: Incomplete network account "%s" has been ignored
de: Unvollständiges Netzwerk-Konto "%s" wurde ignoriert

source: Increased %s
de: Verbesserte %s

source: Increased %s (%s)
de: Verbesserte %s (%s)

source: Industrial activity
de: Industrie-Aktivität

source: Info: external links
de: Info: externe Links

source: Info: used CSS classes
de: Info: verwendete CSS-Klassen

source: Info: used tags
de: Info: verwendete Tags

source: Initialisation complete
de: Initialisierung vollständig

source: Initiator damaged
de: Initiator ist beschädigt

source: Initiator is training
de: Initiator trainiert

source: Initiator moving
de: Initiator bewegt sich

source: Initiator needs fuel
de: Initiator benötigt Treibstoff

source: Initiator under tow
de: Initiator wird abgeschleppt

source: Ins
de: Einfg

source: Ins - Add Account
de: Einfg - Konto hinzufügen

source: Ins - New directory...
de: Einfg - Neues Verzeichnis...

source: Ins - Sim
de: Einfg - Sim

source: Insectoid
de: Insektoide

source: Insert Command
de: Befehl einfügen

source: Install Plugin
de: Plugin installieren

source: Installing plugin '%s'...
de: Installiere Plugin '%s'...

source: Intercept number
de: Intercept-Nummer

source: Internal error: query stopped in wrong state
de: Interner Fehler: Abfrage endet in falschem Zustand

source: Internal error: search failed unexpectedly: %s
de: Interner Fehler: Abfrage unerwartet fehlgeschlagen: %s

source: Internal error: search query produced unexpected result
de: Interner Fehler: Anfrage produzierte unerwartetes Ergebnis

source: Invalid URL
de: Ungültige URL

source: Invalid argument to `Initialize'
de: Ungültiges Argument zu `Initialize'

source: Invalid argument to command line parameter "-%s"
de: Ungültiges Argument zu Kommandozeilenparameter "-%s"

source: Invalid array
de: Ungültiges Array

source: Invalid beam number %d, component has been ignored
de: Ungültige Geschütz-Nummer %d, Komponente wurde ignoriert

source: Invalid boolean setting
de: Ungültiger boolescher Wert

source: Invalid command specified. Use 'c2plugin -h' for help.
de: ungültiges Kommando angegeben. Mit 'c2plugin -h' erhalten Sie Hilfe

source: Invalid compressed data
de: Ungültige komprimierte Daten

source: Invalid device number for "%s"
de: Ungültige Funktions-Nummer für "%s"

source: Invalid directory name
de: Ungültiger Verzeichnisname

source: Invalid engine number %d, component has been ignored
de: Ungültige Triebwerks-Nummer %d, Komponente wurde ignoriert<

source: Invalid expression
de: Ungültiger Ausdruck

source: Invalid file block
de: Ungültiger Block in Datei

source: Invalid file format
de: Ungültiges Dateiformat

source: Invalid file format (bad pointer)
de: Ungültiges Dateiformat (bad pointer)

source: Invalid file format (inconsistent ship numbering)
de: Ungültiges Dateiformat (inkonsistente Nummerierung)

source: Invalid file format (invalid attack list pointer)
de: Ungültiges Dateiformat (invalid attack list pointer)

source: Invalid file format (invalid command count)
de: Ungültiges Dateiformat (invalid command count)

source: Invalid file format (invalid owner information)
de: Ungültiges Dateiformat (invalid owner information)

source: Invalid file format (object count is zero)
de: Ungültiges Dateiformat (Objekt-Zahl ist 0)

source: Invalid file header
de: Ungültiger Dateikopf

source: Invalid file name
de: Ungültiger Dateiname

source: Invalid flags for friendly code "%s"
de: Ungültige Attribute für Kommandocode "%s"

source: Invalid frame
de: Ungültiger Rahmen

source: Invalid frame type
de: Ungültiger Rahmentyp

source: Invalid hull function
de: Ungültige Schiffs-Funktion

source: Invalid hull number "%s"
de: Ungültige Schiffsrumpf-Nummer "%s"

source: Invalid hull number %d, component has been ignored
de: Ungültige Schiffsrumpf-Nummer %d, Komponente wurde ignoriert

source: Invalid input.
de: Ungültige Eingabe.

source: Invalid ion storm Id #%d
de: Ungültige Ionensturm-Id #%d

source: Invalid ion storm Id #%d. Storm will be ignored
de: Ungültige Ionensturm-Id #%d. Sturm wird ignoriert.

source: Invalid keyword
de: Ungültiges Schlüsselwort

source: Invalid layer count
de: Ungültige Ebenen-Anzahl

source: Invalid level number
de: Ungültige Stufennummer

source: Invalid level range
de: Ungültiger Stufen-Bereich

source: Invalid log level in message match expression
de: Ungültiger Log-Level in Nachrichten-Filterausdruck

source: Invalid message directory
de: Inhaltsverzeichnis ungültig

source: Invalid message receiver
de: Ungültiger Nachrichtenempfänger

source: Invalid minefield Id #%d, minefield has been ignored
de: Ungültige Minenfeld-Id #%d, Minenfeld wird ignoriert

source: Invalid number
de: Ungültige Zahl

source: Invalid number of bases
de: Ungültige Anzahl Sternbasen

source: Invalid number of planets
de: Ungültige Anzahl Planeten

source: Invalid number of ships
de: Ungültige Anzahl Schiffe

source: Invalid number of targets
de: Ungültige Anzahl Sichtungen

source: Invalid operation
de: Ungültige Operation

source: Invalid or unsupported URL
de: Ungültige oder nicht unterstützte URL

source: Invalid parameter to "-bpp"
de: Ungültiger Parameter zu "-bpp"

source: Invalid parameter to "-size"
de: Ungültiger Parameter zu "-size"

source: Invalid planet Id #%d
de: Ungültige Planeten-Id #%d

source: Invalid player number
de: Ungültige Spielernummer

source: Invalid player number %d, entry has been ignored
de: Ungültige Spielernummer %d, Eintrag wurde ignoriert

source: Invalid search query: %s
de: Ungültige Suchanfrage: %s

source: Invalid selection expression: %s
de: Ungültiger Auswahl-Ausdruck: %s

source: Invalid ship Id #%d
de: Ungültige Schiffs-Id #%d

source: Invalid ship Id #%d for visual contact. Target will be ignored
de: Ungültige Schiffs-Id #%d für visuellen Kontakt. Sichtung wird ignoriert

source: Invalid size
de: Ungültige Größe

source: Invalid starbase Id #%d
de: Ungültige Sternenbasis-Id #%d

source: Invalid torpedo number %d, component has been ignored
de: Ungültige Torpedo-Nummer %d, Komponente wurde ignoriert

source: Invalid upper bound after "-"
de: Ungültige Obergrenze nach "-"

source: Invalid value in context list; file probably written by newer version of PCC
de: Ungültiger Wert in Kontextliste; die Datei wurde möglicherweies von einer neueren PCC-Version geschrieben

source: Invalid value in data segment; file probably written by newer version of PCC
de: Ungültiger Wert in Datensegment; die Datei wurde möglicherweies von einer neueren PCC-Version geschrieben

source: Ion Storm
de: Ionensturm

source: Ion Storm #%d
de: Ionensturm #%d

source: Ion Storm Forecast
de: Ionensturm-Vorhersage

source: Ion Storm Information
de: Ionensturm-Informationen

source: Ion Storms
de: Ionenstürme

source: Ion storm #%d
de: Ionensturm #%d

source: Ion storms
de: Ionenstürme

source: It can be converted into a plugin. However, there are multiple plugin definition files (*.c2p) next to it. If %s is part of one of these, it is strongly recommended to install the *.c2p file instead.
de: Sie kann in ein Plugin umgewandelt werden. Es befindet sich jedoch bereits mehrere Plugin-Definitionen (*.c2p) daneben. Wenn %s bereits Teil eines dieser Plugins ist, solltest du die entsprechende *.c2p-Datei stattdessen installieren.

source: It can be converted into a plugin. However, there is a plugin definition file (%s) next to it. If %s is part of that, it is strongly recommended to install the *.c2p file instead.
de: Sie kann in ein Plugin umgewandelt werden. Es befindet sich jedoch bereits eine Plugin-Definition (%s) daneben. Wenn %s bereits Teil dieses Plugins ist, solltest du die *.c2p-Datei stattdessen installieren.

source: It cannot be installed.
de: Das Plugin kann nicht installiert werden.

source: It cannot be uninstalled.
de: Das Plugin kann nicht deinstalliert werden.

source: Item
de: Position

source: Jettison
de: Über Bord werfen

source: Jettison into space
de: Fracht über Bord werfen

source: Join Fleet
de: Einer Flotte beitreten

source: Join a fleet
de: Einer Flotte beitreten

source: Keep
de: Aufheben

source: Key %s
de: Taste %s

source: Key '%s' in '%s'
de: Taste '%s' in '%s'

source: Key not mapped: 0x%x
de: Taste nicht erkannt: 0x%x

source: Keyboard Mode
de: Tastatur-Modus

source: Keymap Debugger
de: Tastatur-Debugger

source: Kill Mission
de: Mission Kill

source: Kill power
de: Töten

source: L - Load
de: L - Laden

source: Label update failed: %s
de: Aktualisierung der Beschriftung fehlgeschlagen: %s

source: Labels not available
de: Beschriftungen nicht verfügbar

source: Last expressions
de: Frühere Ausdrücke

source: Last info
de: Letzte Informationen

source: Last known cargo
de: Letzte bekannte Fracht

source: Last known friendly code: %s
de: Letzter bekannter Kommandocode: %s

source: Last queries
de: Letzte Abfragen

source: Launcher Cost
de: Rohr-Kosten

source: Launcher Mass
de: Rohr-Masse

source: Launchers on ship: %d (max %d)
de: Rohre auf Schiff: %d (max %d)

source: Lay Web Mines mission
de: Fangminen legen

source: Leader of fleet #%d
de: Führer von Flotte #%d

source: Leave fleet
de: Flotte verlassen

source: Left mouse button / space bar locks on...
de: Linke Maustaste / Leertaste fixiert auf...

source: Left/Right Balance
de: Links/Rechts-Ausgleich

source: Level %d
de: Stufe %d

source: List Fleets
de: Flotten-Liste

source: List Ships
de: Schiffe

source: List units...
de: Einheiten...

source: Load
de: Laden

source: Load Configuration from File
de: Konfiguration aus Datei laden

source: Load Message
de: Nachricht laden

source: Load Selection
de: Auswahl laden

source: Load Settings
de: Einstellungen laden

source: Load Simulation
de: Simulation laden

source: Load Task
de: Aufgabe laden

source: Load of file "%s" failed: %s
de: Laden der Datei "%s" fehlgeschlagen: %s

source: Load of plugin "%s" failed: %s
de: Laden von Plugin "%s" fehlgeschlagen: %s

source: Load torpedoes onto ships
de: Schiffe mit Torpedos beladen

source: Loaded "%s"
de: "%s" geladen

source: Loaded %d combat recording%!1{s%} (FLAK)...
de: %d Kampf-Aufzeichnung%!1{en%} (FLAK) geladen...

source: Loaded %d combat recording%!1{s%}...
de: %d Kampf-Aufzeichnung%!1{en%} geladen...

source: Loaded %s (%d unit%!1{s%})
de: %s geladen (%d Einheit%!1{en%})

source: Loading %d incoming message%!1{s%}...
de: Lade %d eingehende Nachricht%!1{en%}...

source: Loading %d ion storm name%!1{s%}...
de: Lade %d Ionensturm-Namen...

source: Loading %d ion storm%!1{s%}...
de: Lade %d Ionenst%1{urm%|ürme%}...

source: Loading %d minefield%!1{s%}...
de: Lade %d Minenfeld%!1{er%}...

source: Loading %d planet name%!1{s%}...
de: Lade %d Planetennamen...

source: Loading %d planet%!1{s%}...
de: Lade %d Planet%!1{en%}...

source: Loading %d ship%!1{s%}...
de: Lade %d Schiff%!1{e%}...

source: Loading %d starbase%!1{s%}...
de: Lade %d Sternbas%1{is%|en%}...

source: Loading %d visual contact%!1{s%}...
de: Lade %d visuelle%1{n Kontakt%| Kontakte%}...

source: Loading %s RST file...
de: Lade %s RST-Datei...

source: Loading %s TRN file...
de: Lade %s TRN-Datei...

source: Loading %s backup file...
de: Lade %s Backup-Datei...

source: Loading %s data...
de: Lade %s Daten...

source: Loading starchart database...
de: Lade Sternkartendatei...

source: Loading up to %d explosion%!1{s%}...
de: Lade bis zu %d Explosion%!1{en%}...

source: Loading up to %d ion storm%!1{s%}...
de: Lade bis zu %d Ionen%1{sturm%|stürme%}...

source: Loading up to %d minefield%!1{s%}...
de: Lade bis zu %d Minenfeld%!1{er%}...

source: Loading up to %d planet position%!1{s%}...
de: Lade bis zu %d Planetenposition%!1{en%}...

source: Loading up to %d ship position%!1{s%}...
de: Lade bis zu %d Schiffsposition%!1{en%}...

source: Loading...
de: Lade...

source: Location
de: Position

source: Location: (%d,%d)
de: Position: (%d,%d)

source: Location: (%d,%d) - Sector %d
de: Position: (%d,%d) - Sektor %d

source: Login canceled
de: Anmeldung abgebrochen

source: Login did not succeed; wrong password?
de: Anmeldung fehlgeschlagen; falsches Passwort?

source: Login failed
de: Anmeldung fehlgeschlagen

source: M - Confirm
de: M - Bestätigen

source: M - Merge
de: M - Hinzufügen

source: M - Minerals
de: M - Mineralien

source: MF all.
de: MF erl.

source: MS-DOS Codepage 437
de: MS-DOS-Codeseite 437

source: MS-DOS Codepage 850
de: MS-DOS-Codeseite 850

source: MS-DOS Codepage 852
de: MS-DOS-Codeseite 852

source: MS-DOS Codepage 866 ("Alternative" cyrillic)
de: MS-DOS-Codeseite 866 ("alternativ" kyrillisch)

source: Make Chunnel
de: Chunnel starten

source: Make this ship the leader of the fleet?
de: Soll dieses Schiff der Führer der Flotte werden?

source: Maketurn | Upload target...
de: Maketurn | Upload-Ziel...

source: Malformed URL "%s"
de: Fehlerhafte URL "%s"

source: Manage Build Queue
de: Bauliste verwalten

source: Map type
de: Karten-Typ

source: Mark 2nd point, end with [ESC] or [+].
de: Zweiten Punkt festlegen, Ende mit [ESC] oder [+].

source: Mark found objects
de: Markiere gefundene Objekte

source: Mark only found objects
de: Markiere nur gefundene Objekte

source: Mark only these starbases
de: Markiere nur diese Sternenbasen

source: Mark range, end with [ESC], cancel with [Backspace].
de: Markiere einen Bereich, Ende mit [ESC], Abbruch mit [Backspace].

source: Mark these starbases
de: Markiere diese Sternenbasen

source: Mark...
de: Auswahl...

source: Marked objects only
de: Nur markierte Objekte

source: Marker Comment
de: Marker-Notiz

source: Markers
de: Marker

source: Mass
de: Masse

source: Mass: %d kt
de: Masse: %d kt

source: Mass: unknown
de: Masse: unbekannt

source: Mate damaged
de: Partner ist beschädigt

source: Mate moving
de: Partner bewegt sich

source: Mate needs fuel
de: Partner benötigt Treibstoff

source: Mate under tow
de: Partner wird abgeschleppt

source: Max Beams: %d
de: Max. Geschütze: %d

source: Max Cargo: %d kt
de: Frachtraum: %d kt

source: Max Efficient Warp
de: Max effiziente Geschw.

source: Max Fuel: %d kt
de: Max. Sprit: %d kt

source: Max Tax Rate
de: Maximalsteuersatz

source: Max torps: %d
de: Max. Torpedos: %d

source: Maximize defense
de: Verteidigung maximieren

source: Member of fleet #%d
de: Teil von Flotte #%d

source: Merge Selection
de: Auswahl hinzufügen

source: Message
de: Nachricht

source: Message Summary
de: Nachrichten-Übersicht

source: Message file is invalid
de: Nachrichtendatei ist ungültig

source: Message flag
de: Nachrichten-Marker

source: Message receivers
de: Nachrichten-Empfänger

source: Message template "%s" did not produce Id number
de: Nachrichten-Vorlage "%s" ergab keine Id-Nummer

source: Message template "%s" did not produce name, ignoring
de: Nachrichten-Vorlage "%s" ergab keinen Namen und wird ignoriert

source: Message template "%s" generates unknown value "%s"
de: Nachrichten-Vorlage "%s" ergibt einen unbekannten Wert "%s"

source: Message template "%s" modifies value "%s" which does not exist
de: Nachrichten-Vorlage "%s" verändert einen Wert "%s", der nicht existiert

source: Message template "%s" produced out-of-range Id %d, ignoring
de: Nachrichten-Vorlage "%s" ergab Id-Nummer %d außerhalb des gültigen Bereichs, ignoriert

source: Message too big
de: Nachricht zu groß

source: Messages
de: Nachrichten

source: Min Ftr Aboard
de: Unbenutzte Jäger

source: Min Ftr aboard
de: Unbenutzte Jäger

source: Mine Field #%d
de: Minenfeld #%d

source: Mine Hit
de: Minentreffer

source: Mine Scan
de: Minen gescannt

source: Mine Scan Reason
de: Grund für Minenscan

source: Mine Sweep
de: Minen geräumt

source: Mine Units
de: Mineneinheiten

source: Mine Units Removed
de: Entfernte Mineneinheiten

source: Mine hit damage
de: Minen-Schaden

source: Mine sweep information not available.
de: Keine Informationen über gefundene Minen verfügbar.

source: Mined
de: abgebaut

source: Mined Duranium
de: Duranium abgebaut

source: Mined Molybdenum
de: Molybdenum abgebaut

source: Mined Neutronium
de: Neutronium abgebaut

source: Mined Tritanium
de: Tritanium abgebaut

source: Minefield #%d
de: Minenfeld #%d

source: Minefield Information
de: Minenfeld-Informationen

source: Minefield Laid
de: Minenfeld gelegt

source: Minefield alliance
de: Minenfeld-Allianz

source: Minefields
de: Minenfelder

source: Minefields Allowed
de: Minenfelder erlaubt

source: Minefields Laid
de: Minenfelder gelegt

source: Minefields after decay
de: Minenfelder nach Verfall

source: Minefields visible
de: Minenfeld-Sichtbarkeit

source: Mineral Mines
de: Bergwerke

source: Minerals
de: Mineralien

source: Minerals & Funds
de: Mineralien & Geld

source: Mines
de: Minen

source: Mines swept
de: Minen geräumt

source: Mines: %d; Factories: %d; Defense Posts: %d
de: Minen: %d; Fabriken: %d; Verteidigung: %d

source: Missing ':' in message match expression
de: Fehlender ':' in Nachrichten-Filterausdruck

source: Missing '=' in message match expression
de: Fehlender '=' in Nachrichten-Filterausdruck

source: Missing name of plugin to uninstall. '%s -h' for help.
de: Kein Name für ein zu deinstallierendes Plugin angegeben. Nutze '%s -h' für Hilfe.

source: Missing name plugin or file to install. '%s -h' for help.
de: Kein Name für ein zu installierendes Plugin angegeben. Nutze '%s -h' für Hilfe.

source: Missing name plugin or file to test. '%s -h' for help.
de: Kein Name für ein zu testendes Plugin angegeben. Nutze '%s -h' für Hilfe.

source: Missing plugin file on command line. You must invoke this program with one or more *.c2p/*.c2z files on the command line. You can also use the plugin installer in the PCC2 GUI, or the c2plugin command line tool.
de: Keine Plugin-Datei auf der Kommandozeile übergeben. Dieses Programm muss mit einer oder mehreren *.c2p/*.c2z-Dateien auf der Kommandozeile aufgerufen werden. Alternativ kannst du auch den Plugin-Installer in der grafischen Oberfläche von PCC2 oder das Kommandozeilentool c2plugin benutzen.

source: Mission changed on %d ship%!1{s%}.
de: Mission wurde auf %d Raumschiff%!1{en%} geändert.

source: Mission changed on %d starbase%!1{s%}.
de: Mission wurde auf %d Sternenbas%!1{en%|is%} geändert.

source: Mission number
de: Missions-Nummer

source: Missions | Set ship mission...
de: Missionen | Setze Schiffs-Mission...

source: Missions | Set ship primary enemy...
de: Missionen | Setze Schiffs-Primärziel...

source: Missions | Set starbase mission...
de: Missionen | Setze Sternenbasis-Mission...

source: Missions, orders, names
de: Missionen, Aufträge, Namen

source: Mode
de: Modus

source: Modified %s
de: Geänderte %s

source: Molybdenum Density
de: Molybdenum-Dichte

source: Molybdenum aboard
de: Molybdenum geladen

source: Molybdenum cost
de: Molybdenum-Kosten

source: Monarchy
de: Monarchie

source: Money
de: Geld

source: Money aboard
de: Geld geladen

source: Money cost
de: Geld-Kosten

source: More...
de: Mehr...

source: Most likely, your local configuration does not match the host's, or your host software is incompatible with PCC2. Error message provided by playback engine: %s
de: Wahrscheinlich passt deine lokale Konfiguration nicht zu der des Hosts, oder deine Host-Software ist inkompatibel mit PCC2. Von der Wiedergabesoftware gemeldeter Fehler: %s

source: Mouse
de: Maus

source: Mouse wheel does...
de: Mausrad-Aktion...

source: Move To
de: Bewege zu

source: Move Towards
de: Bewege in Richtung

source: Move down
de: Nach unten

source: Move marker, end with [ESC].
de: Bewege den Marker, Ende mit [ESC].

source: Move up
de: Nach oben

source: Movement
de: Bewegung

source: Movement (%d turn%!1{s%})
de: Bewegung (%d %1{Zug%|Züge%})

source: Msg
de: Meld

source: Multiple races
de: Mehrere Völker

source: My Computer
de: Mein Computer

source: My Files
de: Meine Dateien

source: Name/Id/Comment
de: Name/Id/Notiz

source: Nat
de: Eing

source: Native Government
de: Eingeborene Regierung

source: Native Happiness
de: Eingeborenen-Status

source: Native Population
de: Eingeborene

source: Native Race
de: Eingeborenes Volk

source: Native Tax
de: Eingeborenen-Steuern

source: Native race: %s
de: Eingeborenes Volk: %s

source: Natives
de: Eingeborene

source: Natives are
de: Eingeborene sind

source: Natives present
de: Eingeborene vorhanden

source: Nearly undefended
de: Fast unverteidigt

source: Network connection lost
de: Netzwerkverbindung verloren

source: Network error
de: Netzwerkfehler

source: Network name not found
de: Netzwerkname nicht gefunden

source: Neutronium Density
de: Neutronium-Dichte

source: New
de: Neu

source: New Value
de: Neuer Wert

source: New directory
de: Neues Verzeichnis

source: New happiness: %s (%d)
de: Neuer Status: %s (%d)

source: New marker
de: Neuer Marker

source: Next Position
de: Nächste Position

source: Next at
de: Nächster bei

source: Next-turn information ("show")
de: Information des nächsten Zugs ("show")

source: No
de: Nein

source: No Fuel
de: Kein Treibstoff

source: No Ion Storms
de: Keine Ionenstürme

source: No Minefields
de: Keine Minenfelder

source: No Ufos
de: Keine Ufos

source: No backup file configured
de: Keine Backup-Datei konfiguriert

source: No base
de: Keine Basis

source: No beams
de: Keine Geschütze

source: No colonists.
de: Keine Kolonisten.

source: No command matched the filter.
de: Kein Kommando passte auf den Filter-Ausdruck.

source: No command specified. Use 'c2plugin -h' for help.
de: kein Kommando angegeben. Mit 'c2plugin -h' erhalten Sie Hilfe

source: No control file (checksums) loaded
de: Keine Control-Datei (Prüfsummen) geladen

source: No data to export
de: Keine Daten zu exportieren

source: No fighter bays
de: Keine Startrampen

source: No function selected for assignment
de: Keine zuzuweisende Funktion gewählt

source: No host configuration file found, using defaults
de: Keine Host-Konfiguration gefunden, verwende Standardwerte

source: No hull selected for assignment
de: Kein Schiffstyp für Zuweisung gewählt

source: No information on climate available.
de: Keine Information über Klima verfügbar.

source: No information on colonists available.
de: Keine Informationen über Kolonisten.
