Repository: stefanreuther/c2ng
Catalog: po/*.po
Languages: de

source: Your query didn't match any object.
de: Es wurde kein passendes Objekt gefunden.

source: Your selection does not contain any objects.
de: Deine Auswahl ist leer.

source: Your selection includes ships and planets. PCC cannot export ships and planets at the same time. Please use the "1" and "2" buttons to select only one type.
de: Deine Auswahl enthält sowohl Schiffe, als auch Planeten. PCC kann nicht Schiffe und Planeten gleichzeitig exportieren. Bitte nutze die Knöpfe "1" und "2", um nur einen Typ zu wählen.

source: Your ship expression was not accepted.
de: Dein Schiffs-Ausdruck wurde nicht akzeptiert.

source: Zoom level
de: Zoom-Stufe

source: [Choose this directory]
de: [Dieses Verzeichnis wählen]

source: [Directory content]
de: [Verzeichnis anzeigen]

source: [Go up one level]
de: [Eine Ebene aufwärts]

source: [Places]
de: [Orte]

source: [keep]
de: [n.ä.]

source: a %s
de: ein %s

source: a planet with unknown owner
de: ein Planet mit unbekanntem Besitzer

source: abundant
de: reichlich

source: accept
de: annehmen

source: all
de: alle

source: all but player %d
de: alle außer Spieler %d

source: all players
de: alle Spieler

source: all ship types
de: Alle Schiffstypen

source: and/or supplies more.
de: und/oder Vorräte benötigt.

source: arctic
de: arktisch

source: ask
de: fragen

source: at %d
de: bei %d

source: at %s
de: bei %s

source: at waypoint
de: am Ziel

source: available
de: verfügbar

source: available?
de: verfügbar?

source: average
de: Mittel

source: built by "lfm"
de: mit "lfm" gebaut

source: built on starbase
de: auf Sternenbasis gebaut

source: by name
de: nach Name

source: by player
de: nach Spieler

source: by team
de: nach Team

source: called by %s
de: aufgerufen von %s

source: called by %s, file '%s', line %d
de: aufgerufen von %s, Datei '%s', Zeile %d

source: called by file '%s'
de: aufgerufen aus Datei '%s'

source: called by file '%s', line %d
de: aufgerufen aus Datei '%s', Zeile %d

source: calm
de: ruhig

source: cancel hyperjump
de: Hypersprung deaktivieren

source: chunnel to %s
de: Chunnel zu %s

source: cloaked
de: getarnt

source: command requires 1 or 2 parameters
de: Befehl erfordert 1 oder 2 Parameter

source: command requires 3 parameters
de: Befehl erfordert 3 Parameter

source: command requires at least 2 parameters
de: Befehl erfordert mindestens 2 Parameter

source: common
de: viel

source: complete
de: vollständig

source: completely unstable
de: ein Schwarzes Loch

source: concentrated
de: konzentriert

source: cool
de: kühl

source: current turn
de: aktueller Zug

source: custom
de: selbstdefiniert

source: custom file name
de: selbstdefinierter Dateiname

source: custom: %s
de: selbstdefiniert: %s

source: dBASE file (*.dbf)
de: dBASE-Datei (*.dbf)

source: damaged
de: beschädigt

source: dangerous
de: gefährlich

source: death ray
de: Todesstrahl

source: default
de: Standard

source: default (=no)
de: Standard (=nein)

source: default (=yes)
de: Standard (=ja)

source: density
de: Dichte

source: desert
de: Wüste

source: directory '%s' contains data from different games. NOTE: use '-f' to force compilation of turn files anyway
de: Verzeichnis '%s' enthält Daten verschiedener Spiele. HINWEIS: nutze '-f', um das Erzeugen der Turndateien zu erzwingen

source: directory '%s' does not contain unpacked game data
de: Verzeichnis `%s' enthält keine entpackten Spieldaten

source: disabled
de: deaktiviert

source: disabled (no backup)
de: deaktiviert (kein Backup)

source: dispersed
de: verteilt

source: enabled (standard file name)
de: aktiviert (Standard-Dateiname)

source: enemy
de: Feind

source: error
de: Fehler

source: established
de: etabliert

source: every time
de: jedes Mal

source: expecting "KEY=VALUE" for option "-A"
de: Erwarte "NAME=WERT" für Option "-A"

source: expecting "KEY=VALUE" for option "-D"
de: Erwarte "NAME=WERT" für Option "-D"

source: fastest
de: schnellste

source: fighter
de: Raumjäger

source: fighting
de: kämpfend

source: flat
de: flach

source: friendly code too long; truncated
de: Kommandocode war zu lang und wurde gekürzt

source: from %s
de: aus %s

source: gone (%d torp%!1{s%})
de: geräumt (%d Torpedo%!1{s%})

source: ground
de: Boden

source: growing
de: wachsend

source: happy
de: zufrieden

source: harmless
de: harmlos

source: has
de: hat

source: heavy
de: stark

source: host, all players
de: Host, alle Spieler

source: hyperjump
de: Hypersprung

source: in %s, file '%s', line %d
de: in %s, Datei '%s', Zeile %d

source: in file '%s'
de: in Datei '%s'

source: in file '%s', line %d
de: in Datei '%s', Zeile %d

source: interleaved
de: überlappend

source: invalid argument to "-value="
de: Ungültiges Argument zu "-value="

source: invalid command "%s" specified. Use "%s -h" for help
de: Ungültiger Befehl "%s" angegeben. Mit "%s -h" erhalten Sie Hilfe

source: invalid command '%s'. Use '%s -h' for help.
de: Ungültiger Befehl '%s'. Mit '%s -h' erhalten Sie Hilfe.

source: invalid edit command "%s"
de: Ungültiger Bearbeitungs-Befehl "%s"

source: invalid engine/shield bonus, '%s'
de: Ungültiger Triebwerk-Schild-Bonus, '%s'

source: invalid language code
de: Ungültiger Sprachcode

source: invalid mission number
de: Ungültige Missions-Nummer

source: invalid number
de: Ungültige Zahl

source: invalid number of simulations, '%s'
de: Ungültige Anzahl Simulationen, '%s'

source: invalid number of threads, '%s'
de: Ungültige Anzahl Threads, '%s'

source: invalid option '%s' specified. Use '%s -h' for help.
de: Ungültige Option '%s' angegeben. Mit '%s -h' erhalten Sie Hilfe.

source: invalid option specified
de: Ungültige Option angegeben.

source: invalid option specified. Use "%s -h" for help
de: Ungültige Option angegeben. Mit '%s -h' erhalten Sie Hilfe.

source: invalid option specified. Use '%s -h' for help.
de: Ungültige Option angegeben. Mit '%s -h' erhalten Sie Hilfe.

source: invalid output format specified
de: ungültiges Ausgabeformat angegeben

source: invalid seed, '%s'
de: Ungültiger Startwert, '%s'

source: invalid version number "%s"
de: Ungültige Versionsnummer "%s"

source: keep
de: behalten

source: kt supplies
de: kt Vorräte

source: large masses
de: größere Vorkommen

source: level %d
de: Stufe %d

source: level %d+
de: Stufe %d+

source: levels
de: Stufen

source: light
de: leicht

source: line %d: %s
de: Zeile %d: %s

source: loaded
de: geladen

source: manual
de: manuell

source: marked units
de: markierte Einheiten

source: mined
de: abgebaut

source: missing delimiter
de: fehlendes Trennzeichen

source: missing directory name
de: fehlender Verzeichnisname

source: missing directory name to clear. Use '%s -h' for help.
de: Name des zu löschenden Verzeichnisses fehlt. Mit '%s -h' erhalten Sie Hilfe.

source: missing directory name to list. Use '%s -h' for help.
de: Name des aufzulistenden Verzeichnisses fehlt. Mit '%s -h' erhalten Sie Hilfe.

source: missing input file name
de: fehlender Eingabedateiname

source: missing node Id
de: fehlende Knoten-Id

source: missing output file name
de: fehlender Ausgabedatei-Name

source: missing player number
de: fehlende Spielernummer

source: moderate
de: mäßig

source: mostly stable (<30%)
de: fast stabil (<30%)

source: must specify an output file ('-o FILE') if input is commands
de: wenn die Eingabe Befehle sind, muss eine Ausgabedatei angegeben werden ('-o DATEI')

source: near %s (#%d)
de: nahe %s (#%d)

source: near %s (Planet #%d)
de: nahe %s (Planet #%d)

source: need two directory names (source, destination). Use '%s -h' for help.
de: benötige zwei Verzeichnisnamen (Quelle, Ziel). Mit '%s -h' erhalten Sie Hilfe.

source: new RST
de: neues RST

source: no
de: nein

source: no (shown by default)
de: nein (standardmäßig sichtbar)

source: no action specified
de: keine Aktion angegeben

source: no beam weapons
de: Keine Geschütze

source: no command specified
de: kein Befehl angegeben

source: no command specified. Use "%s -h" for help
de: kein Befehl angegeben. Mit "%s -h" erhalten Sie Hilfe

source: no command specified. Use '%s -h' for help.
de: kein Befehl angegeben. Mit "%s -h" erhalten Sie Hilfe

source: no commands specified. Use '%s -h' for help.
de: keine Befehle angegeben. Mit "%s -h" erhalten Sie Hilfe

source: no fighters aboard
de: keine Raumjäger geladen

source: no file name specified. Use "%s -h" for help
de: kein Dateiname angegeben. Mit "%s -h" erhalten Sie Hilfe

source: no file name specified. Use '%s -h' for help
de: kein Dateiname angegeben. Mit "%s -h" erhalten Sie Hilfe

source: no filter specified. Deleting ("-d") needs a filter
de: kein Filter angegeben. Zum Löschen ("-d") wird ein Filter benötigt

source: no game data available for player %d
de: keine Spieldaten für Spieler %d verfügbar

source: no game data found
de: keine Spieldaten gefunden

source: no game data found in directory "%s"
de: keine Spieldaten gefunden in Verzeichnis "%s"

source: no input files specified
de: keine Eingabedateien angegeben

source: no input files specified. Use '%s -h' for help.
de: keine Eingabedateien angegeben. Mit '%s -h' erhalten Sie Hilfe.

source: no level
de: keine Stufen

source: no node name specified. Use "%s -h" for help
de: kein Knotenname angegeben. Mit "%s -h" erhalten Sie Hilfe

source: no result files found. Use "%s -h" for help
de: keine Result-Dateien gefunden. Mit "%s -h" erhalten Sie Hilfe

source: no search string specified. Use '%s -h' for help
de: kein Suchbegriff angegeben. Mit "%s -h" erhalten Sie Hilfe

source: no secondary weapons
de: keine Sekundärwaffe

source: no torpedoes aboard
de: keine Torpedos geladen

source: nobody
de: niemand

source: non-option unexpected. Use "%s -h" for help
de: unerwartete Nicht-Option. Mit "%s -h" erhalten Sie Hilfe

source: none
de: kein

source: none/not known
de: kein/unbekannt

source: not available
de: nicht verfügbar

source: not in a fleet
de: nicht in einer Flotte

source: not in a tow group
de: nicht abgeschleppt

source: not included
de: nicht berechnen

source: not loaded
de: nicht geladen

source: not moved
de: nicht bewegt

source: not moving
de: bewegt sich nicht

source: not on map
de: nicht auf der Karte

source: number of variables (%d) does not match number of produced values (%d)
de: Anzahl Variablen (%d) entspricht nicht der Anzahl produzierter Werte (%d)

source: object of type '%s' has no fields
de: Objekt vom Typ '%s' hat keine Felder

source: once
de: einmal

source: once per player
de: einmal pro Spieler

source: once per ship
de: einmal pro Schiff

source: one
de: einer

source: only one input file allowed if output file ('-o FILE') is given
de: nur eine Eingabedatei erlaubt, wenn eine Ausgabedatei ('-o DATEI') angegeben ist

source: only one player number allowed
de: nur eine Spielernummer zulässig

source: option '-C' needs an argument (the character set)
de: Option '-C' benötigt ein Argument (den Zeichensatz)

source: option '-O' needs a number between %d and %d as parameter
de: Option '-O' benötigt eine Zahl zwischen %d und %d als Parameter

source: option '-P' needs a player number as parameter
de: Option '-P' benötigt eine Spielernummer als Parameter

source: others
de: andere

source: our
de: unser

source: our freighter
de: unser Frachter

source: our planet
de: unser Planet

source: our ship
de: unser Schiff

source: our starship
de: unser Raumschiff

source: output file name ("-o") not specified
de: keine Ausgabedatei ("-o") angegeben

source: own planets
de: eigene Planeten

source: own ships
de: eigene Schiffe

source: own units
de: eigene Einheiten

source: parameter '%s' to '--%s' is not valid
de: Parameter '%s' zu '--%s' ist nicht gültig

source: parameter for "-%s" is invalid
de: Parameter für "-%s" ist ungültig

source: parameter to '--%s' must be 'yes' or 'no'
de: Parameter zu '--%s' muss 'yes' oder 'no' sein

source: parameter to '--log' is not valid
de: Parameter zu '--log' ist nicht gültig

source: planets
de: Planeten

source: planets.nu account
de: planets.nu-Konto

source: planetscentral.com account
de: planetscentral.com-Konto

source: player %d
de: Spieler %d

source: player %d's turn
de: Turn von Spieler %d

source: players
de: Spieler

source: please specify the object type to export ('-P', '-S', '-A'). Use '-h' for help.
de: bitte wähle einen Objekttyp für den Export ('-P', '-S', '-A'). Mit '-h' erhalten Sie Hilfe.

source: please specify the player number
de: bitte gib eine Spielernummer an

source: previous turn
de: voriger Zug

source: rare
de: wenig

source: reject
de: abweisen

source: repository location not specified. Use "%s -h" for help
de: Ablageort nicht angegeben. Mit "%s -h" erhalten Sie Hilfe

source: reset
de: zurücksetzen

source: resource Id must be a number
de: Ressourcen-Id muss eine Zahl sein

source: resource Id not found in file
de: Ressourcen-Id in Datei nicht gefunden

source: rioting
de: aufrührerisch

source: scattered
de: verstreut

source: ship
de: Schiff

source: ships
de: Schiffe

source: simple
de: einfach

source: simulation does not match ship list
de: Simulation und Schiffsliste passen nicht zusammen

source: slowest
de: langsamste

source: space left
de: frei

source: stable (<15%)
de: stabil (<15%)

source: starbases
de: Sternenbasen

source: starship
de: Raumschiff

source: strong
de: stark

source: substantial
de: bedeutend

source: syntax error in filter expression
de: Syntaxfehler in Filterausdruck

source: template will match every message
de: Vorlage wird auf alle Nachrichten passen

source: the selected format needs an output file name ('-o')
de: für das gewählte Format muss eine Ausgabedatei angegeben werden ('-o')

source: the specified character set is not known
de: der angegebene Zeichensatz ist nicht bekannt

source: then by...
de: dann nach...

source: they offered
de: sie bieten an

source: this game does not contain any objects of type '%s'
de: Dieses Spiel enthält keine Objekte des Typs '%s'

source: timestamp must be 18 characters in length
de: Zeitstempel muss 18 Zeichen haben

source: too few parameters. Use '%s -h' for help.
de: zu wenig Parameter. Nutze '%s -h' für Hilfe.

source: too long
de: zu lange

source: too many arguments
de: zu viele Parameter

source: too many directory names specified. Use '%s -h' for help.
de: zu viele Verzeichnisnamen angegeben. Nutze '%s -h' für Hilfe.

source: too many parameters. Use '%s -h' for help.
de: zu viele Parameter. Nutze '%s -h' für Hilfe.

source: towing %s
de: schleppe %s

source: traditional
de: traditionell

source: training, won't move
de: Training, keine Bewegung

source: tropical
de: tropisch

source: turn %d
de: Zug %d

source: unable to load ship list
de: Kann Schiffsliste nicht laden

source: unable to load turn
de: Kann Zug nicht laden

source: unable to resolve node: "%s"
de: Knoten kann nicht gefunden werden: "%s"

source: unable to resolve snapshot Id '%s'
de: Snapshot kann nicht gefunden werden: "%s"

source: unhappy
de: unzufrieden

source: unknown
de: unbekannt

source: unknown command specified. Use "%s -h" for help
de: Unbekannter Befehl angegeben. Nutze "%s -h" für Hilfe

source: unknown command: "%s"
de: Unbekannter Befehl: "%s"

source: unknown edit command "%s"
de: Unbekannte Bearbeitungs-Anweisung "%s"

source: unknown keyword
de: unbekanntes Schlüsselwort

source: unknown object kind
de: unbekannte Objekt-Art

source: unknown object type '%s'
de: Unbekannter Objekttyp '%s'

source: unknown. Wait while computing...
de: unbekannt. Ergebnis wird berechnet...

source: unowned
de: unbesetzt

source: unowned planet
de: unbesetzter Planet

source: unpacked
de: entpackt

source: unrecognized input file name: %s
de: Eingabedateiname nicht erkannt: %s

source: unrecognized output file name: %s
de: Ausgabedateiname nicht erkannt: %s

source: unstable (<50%)
de: instabil (<50%)

source: up to %d
de: bis zu %d

source: up to %d %s
de: bis zu %d %s

source: up to %d beam%!1{s%}
de: bis zu %d Geschütz%!1{e%}

source: up to %d crew
de: bis zu %d Crew

source: up to %d torpedo launcher%!1{s%}
de: bis zu %d Torpedorohr%!1{e%}

source: util.dat belongs to a different player. File will be ignored.
de: util.dat gehört einem anderen Spieler. Die Datei wird ignoriert.

source: util.dat control record too short. File is possibly damaged and will be ignored.
de: Steuerdatensatz in util.dat ist zu kurz. Die Datei ist möglicherweise beschädigt und wird ignoriert.

source: util.dat is from a different turn. File will be ignored.
de: util.dat stammt aus einem anderen Zug. Die Datei wird ignoriert.

source: very angry
de: wütend

source: very common
de: sehr viel

source: very rare
de: sehr wenig

source: very scattered
de: stark verstreut

source: very stable (<5%)
de: sehr stabil (<5%)

source: very unstable (<80%)
de: sehr instabil (<80%)

source: warning: no action specified
de: Warnung: keine Aktion angegeben

source: we offered
de: wir bieten an

source: weakening
de: abklingend

source: with %d fighter%!1{s%}
de: mit %d Jäger%!1{n%}

source: with %d torp%!1{s%}
de: mit %d Torp%!1{s%}

source: won't die if less than %s
de: sterben nicht wenn weniger als %s

source: wraps to %4d,%4d
de: abgebildet auf %4d,%4d

source: yes
de: ja

source: yes (skipped by default)
de: ja (standardmäßig übersprungen)

source: {lang}en
de: de

source: ← Unload
de: ← Entladen

source: ≈%d turn%!1{s%}
de: ≈%d %1{Zug%|Züge%}

source: ▶ Max. Cargo
de: ▶ Max. Fracht

source: ▶ Max. Cargo+Weapons
de: ▶ Max. Fracht+Waffen

source: ▶ Max. Fuel
de: ▶ Max. Sprit

source: ▶ Min. Cargo
de: ▶ Min. Fracht

source: ▶ Min. Fuel
de: ▶ Min. Sprit

source: ▶ Total
de: ▶ Gesamt

source: ▶▶ Totals
de: ▶▶ Gesamt
