Repository: stefanreuther/c2ng
Catalog: po/*.po
Languages: de

source: Usage: %s [-h] %$0s COMMAND... Commands: %$0s create [--crlf] [--list=FILE] [-L DIR] FILE.RES FILE.RC... Create resource file from scripts %$0s ls FILE.RES... List content of the FILEs (also: list) %$0s extract FILE.RES INDEX FILE.OUT Extract single entry (also: rx) %$0s extract-all FILE.RES [FILE.RC] Extract all files and create a script (also: rxall) Command Options: --crlf (create) Use CR/LF linefeeds for embedded text --list=FILE (create) Create list file of aliases --dep=FILE (create) Create dependency file --list-format=FMT (create) Define format of list file (e.g. "#define %%s %%d") -L DIR (create) Search path Resource scripts: NUM[=ALIAS] SOURCE Create an entry NUM can be number or 'next' SOURCE can be file name or '.text' or 'eq NUM' Report bugs to <Streu@gmx.de>
de: Aufruf: %s [-h] %$0s BEFEHL... Befehle: %$0s create [--crlf] [--list=DATEI] [-L VERZ] DATEI.RES DATEI.RC... Erzeuge Ressourcen-Datei aus Skripten %$0s ls DATEI.RES... Inhalt der DATEIen auflisten (auch: list) %$0s extract DATEI.RES INDEX DATEI.OUT Ein einzelnes Element extrahieren (auch: rx) %$0s extract-all DATEI.RES [DATEI.RC] Alle Elemente extrahieren und ein Skript erstellen (auch: rxall) Befehls-Optionen: --crlf (create) Nutze CR/LF-Zeilenumbrücke für eingebetteten Text --list=DATEI (create) Erzeuge eine Listen-Datei mit den Aliasen --dep=DATEI (create) Erzeuge eine Abhängigkeits-Datei --list-format=FMT (create) Definiere Format der Listen-Datei (z.B. "#define %%s %%d") -L VERZ (create) Suchpfad Ressourcen-Skipte: NUM[=ALIAS] QUELLE Erzeuge einen Eintrag NUM kann eine Zahl oder 'next' sein QUELLE kann ein Dateiname, '.text' oder 'eq NUM' sein Fehler bitte melden an <Streu@gmx.de>

source: Usage: %s [-h] %$0s [--config=FILE] [-DKEY=VALUE] [ENV=VALUE] [COMMAND...] Options: %s Report bugs to <Streu@gmx.de>
de: Aufruf: %s [-h] %$0s [--config=DATEI] [-DNAME=WERT] [ENV=WERT] [BEFEHL...] Optionen: %s Fehler bitte melden an <Streu@gmx.de>

source: Usage: %s [-h] %$0s [--proxy=URL] COMMAND... Commands: %$0s cp [-r] [-x] SOURCE DEST Copy everything from SOURCE to DEST %$0s ls [-r] [-l] DIR... List content of the DIRs %$0s sync SOURCE DEST Make DEST contain the same content as SOURCE %$0s clear DIR... Remove content of DIRs %$0s serve SOURCE HOST:PORT Serve SOURCE via HTTP for testing %$0s gc [-n] [-f] PATH Garbage-collect a CA file system %$0s snapshot PATH ls [-l] List snapshots (tags) on CA file system %$0s snapshot PATH add NAME... Create snapshots (tags) on CA file system %$0s snapshot PATH rm NAME... Remove snapshots (tags) on CA file system %$0s snapshot PATH cp OLD NEW... Copy snapshots (tags) on CA file system %$0s snapshot PATH restore NAME Restore from snapshot (tag) on CA file system Command Options: -f Force garbage-collection even on error -l Long format -n Dry run (do not delete anything) -r Recursive -x Expand *.tgz/*.tar.gz files File specifications: PATH Access files within unmanaged file system [PATH@]ca:SPEC Access files within unmanaged content-addressable file system [PATH@]snapshot:NAME:SPEC Access files from a CA file system snapshot (read-only) [PATH@]int:[UNIQ] Internal (RAM, not persistent) file space c2file://[USER@]HOST:PORT/PATH Access in a remote managed file system (c2file server) Report bugs to <Streu@gmx.de>
de: Aufruf: %s [-h] %$0s [--proxy=URL] BEFEHL... Befehle: %$0s cp [-r] [-x] QUELLE ZIEL Kopiere alles von QUELLE nach ZIEL %$0s ls [-r] [-l] VERZEICHNIS... Inhalt der VERZEICHNISse auflisten %$0s sync QUELLE ZIEL ZIEL erhält den gleichen Inhalt wie QUELLE %$0s clear VERZEICHNIS... Inhalt der VERZEICHNISse löschen %$0s serve QUELLE HOST:PORT QUELLE via HTTP bereitstellen %$0s gc [-n] [-f] PFAD Garbage-Collection in einem CA-Dateisystem %$0s snapshot PATH ls [-l] Snapshots (Tags) eines CA-Dateisystems auflisten %$0s snapshot PATH add NAME... Snapshots (Tags) auf einem CA-Dateisystems erzeugen %$0s snapshot PATH rm NAME... Snapshots (Tags) von einem CA-Dateisystems löschen %$0s snapshot PATH cp OLD NEW... Snapshots (Tags) auf einem CA-Dateisystems kopieren %$0s snapshot PATH restore NAME Zustand eines CA-Dateisystems aus Snapshot (Tag) wiederherstellen Befehlsoptionen: -f Garbage-Collection auch bei Fehler erzwingen -l Lang-Format -n Probelauf (nichts löschen) -r Rekursiv -x Packe *.tgz/*.tar.gz-Dateien aus Dateinamen: PFAD Dateien in einem nicht verwalteten Dateisystem [PFAD@]ca:SPEC Dateien in einem nicht verwalteten, content-addressierten Dateisystem [PFAD@]snapshot:NAME:SPEC Zugriff auf einen Snapshot in einem CA-Dateisystem (nur lesen) [PFAD@]int:[UNIQ] Interne Ablage (Arbeitsspeicher, nicht persistent) c2file://[NUTZER@]HOST:PORT/PFAD Zugriff auf verwaltetes Dateisystem (c2file-Server) Fehler bitte melden an <Streu@gmx.de>

source: Usage: %s [-h] %$0s [-ACTION] [-OPTIONS] FILE... %$0s [-ACTION] [-OPTIONS] -k COMMAND... %s Report bugs to <Streu@gmx.de>
de: Aufruf: %s [-h] %$0s [-AKTION] [-OPTIONEN] DATEI... %$0s [-AKTION] [-OPTIONEN] -k BEFEHL... %s Fehler bitte melden an <Streu@gmx.de>

source: Usage: %s [-h] %$0s [-OPTIONS] COMMAND [ARGS] %s Report bugs to <Streu@gmx.de>
de: Aufruf: %s [-h] %$0s [-OPTIONEN] BEFEHL [ARGS] %s Fehler bitte melden an <Streu@gmx.de>

source: Usage: %s [-h] %$0s [-OPTIONS] FILE... %$0s [-OPTIONS] -k COMMAND... %s Report bugs to <Streu@gmx.de>
de: Aufruf: %s [-h] %$0s [-OPTIONEN] DATEI... %$0s [-OPTIONEN] -k BEFEHL... %s Fehler bitte melden an <Streu@gmx.de>

source: Usage: %s [-h] %$0s [-OPTIONS] PLAYER GAMEDIR [ROOTDIR] GAMEDIR can be a local directory, or c2file://USER@HOST:PORT/DIR. %s Report bugs to <Streu@gmx.de>
de: Aufruf: %s [-h] %$0s [-OPTIONEN] SPIELER SPIELVERZ [STAMMVERZ] SPIELVERZ kann ein lokales Verzeichnis oder c2file://NUTZER@HOST:PORT/PFAD sein. %s Fehler bitte melden an <Streu@gmx.de>

source: Usage: %s [-h] %$0s [-OPTIONS] [PLAYER] [GAMEDIR] %s Report bugs to <Streu@gmx.de>
de: Aufruf: %s [-h] %$0s [-OPTIONEN] [SPIELER] [SPIELVERZ] %s Fehler bitte melden an <Streu@gmx.de>

source: Usage: %s [-h] %$0s [-f] [GAMEDIR] %s Report bugs to <Streu@gmx.de>
de: Aufruf: %s [-h] %$0s [-f] [SPIELVERZ] %s Fehler bitte melden an <Streu@gmx.de>

source: Usage: %s [-h] %$0s [-nlx] [-a|player numbers] [gamedir [rootdir]] %s Report bugs to <Streu@gmx.de>
de: Usage: %s [-h] %$0s [-nlx] [-a|spielernummern] [spielverz [stammverz]] %s Fehler bitte melden an <Streu@gmx.de>

source: Usage: %s [-h] %$0s [-opts] "search string" [-type] files... Options: -c Case-sensitive -C CHARSET Select character set Type options apply to all subsequent file names: -r Result files -t Turn files -m Message inbox (MDATA) -d Dosplan outbox (MESS) -w Winplan outbox (MESS35) -a VPA database -A Auto-detect (default) -z Search in ZIP files (implies -A) -I Ignore unknown files (default: warn) Report bugs to <Streu@gmx.de>
de: Aufruf: %s [-h] %$0s [-opts] "suchbegriff" [-typ] dateien... Optionen: -c Groß-/Kleinschreibung berücksichtigen -C CHARSET Zeichensatz auswählen Typ-Optionen betreffen alle folgenden Dateinamen: -r Result-Dateien -t Turn-Dateien -m Eingehende Nachrichten (MDATA) -d Ausgehende Nachrichten, Dosplan (MESS) -w Ausgehende Nachrichten, Winplan (MESS35) -a VPA-Datenbank -A automatische Erkennung (Standard) -z suche in ZIP-Dateien (impliziert -A) -I ignoriere unerkannte Dateien (Standard: Warnung) Fehler bitte melden an <Streu@gmx.de>

source: Usage: %s [-h] %$0s [-opts] FILE.ccb... Utility will load all .ccb files, combine them, and work on the result. %s Report bugs to <Streu@gmx.de>
de: Aufruf: %s [-h] %$0s [-opts] DATEI.ccb... Das Programm wird alle .ccb-Dateien laden, zusammenführen, und mit dem Ergebnis arbeiten. %s Fehler bitte melden an <Streu@gmx.de>

source: Usage: %s [-h] %$0s [-opts] [-f F@W...] [-S|-P|-A OBJECT] [-t TYPE] DIR [ROOT] PLAYER %s Report bugs to <Streu@gmx.de>
de: Aufruf: %s [-h] %$0s [-opts] [-f F@W...] [-S|-P|-A OBJEKT] [-t TYP] VERZ [STAMMVERZ] SPIELEr %s Fehler bitte melden an <Streu@gmx.de>

source: Usage: %s [-options...] [gamedir] Options: %s Default is a report with all sub-ratings and totals. A game directory is processed as a whole (config files and shiplist). Report bugs to <Streu@gmx.de>
de: Aufruf: %s [-optionen...] [spielverz] Optionen: %s Standardmäßig wird ein Bericht mit allen Einzelwertungen und dem Gesamtwert angezeigt. Ein Spielverzeichnis wird im Ganzen verarbeitet (Konfiguration und Schiffsliste). Fehler bitte melden an <Streu@gmx.de>

source: Usage: c2dbexport [--config=FILE] [-DKEY=VALUE] COMMAND [ARGS...] Options: --config=FILE Set path to config file --log=CONFIG Set logger configuration -DKEY=VALUE Override config file entry Commands: db [--delete] WILDCARD... export database keys This utility creates c2console (*.con) scripts to restore a particular situation / set of data in the same or another PlanetsCentral database instance. Report bugs to <Streu@gmx.de>
de: Aufruf: c2dbexport [--config=DATEI] [-DNAME=WERT] BEFEHL [ARGS...] Optionen: --config=DATEI Pfad für Konfigurationsdatei --log=KONFIG Setze Logger-Konfiguration -DNAME=WERT Konfigurationswert überschreiben Befehle: db [--delete] WILDCARD... Exportiere Datenbank-Werte Dieses Programm erstellt ein Skript für c2console (*.con), das eine bestimmte Situation oder Datenmenge in der gleichen oder einer anderen PlanetsCentral-Instanz wiederherstellt. Fehler bitte melden an <Streu@gmx.de>

source: Usage: c2ng [-options] gamedir [player]
de: Aufruf: c2ng [-optionen] spielverz [spieler]

source: Use "OK" to review and correct the expression.
de: Nutze "OK", um den Ausdruck zu überprüfen und korrigieren.

source: Use *.c2p
de: Nutze *.c2p

source: Use default/game relations
de: Nutze Relationen aus Spiel

source: Use parts from storage
de: Vorhandene Teile nutzen

source: Use starbase torpedoes in combat
de: Sternenbasis-Torpedos im Kampf benutzen

source: Use this window to build %s beams and put them into starbase storage for later use.
de: Hier kannst du %s-Geschütze bauen und für die spätere Benutzung im Lager der Sternenbasis ablegen.

source: Use this window to build %s engines and put them into starbase storage for later use.
de: Hier kannst du %s-Triebwerke bauen und für die spätere Benutzung im Lager der Sternenbasis ablegen.

source: Use this window to build %s hulls and put them into starbase storage for later use.
de: Hier kannst du %s-Rümpfe bauen und für die spätere Benutzung im Lager der Sternenbasis ablegen.

source: Use this window to build %s launchers and put them into starbase storage for later use.
de: Hier kannst du %s-Rohre bauen und für die spätere Benutzung im Lager der Sternenbasis ablegen.

source: User cc-res.cfg
de: cc-res.cfg des Benutzers

source: User configuration file
de: Benutzer-Konfigurationsdatei

source: User name
de: Nutzername

source: User name or password not accepted!
de: Nutzername oder Passwort nicht akzeptiert!

source: Using directory "%s"
de: Nutze Verzeichnis "%s"

source: Using turn file %s.
de: Nutze Turn-Datei %s.

source: VCR Options
de: VCR-Optionen

source: VCR algorithm does not accept (incompatible version?)
de: VCR-Algorithmus akzeptiert nicht (inkompatible Version?)

source: VCR algorithm does not accept (wrong shiplist?)
de: VCR-Algorithmus akzeptiert nicht (falsche Schiffsliste?)

source: VCR file is invalid
de: VCR-Datei ist ungültig

source: VCR options [O]
de: VCR-Optionen [O]

source: VERY dangerous
de: SEHR gefährlich

source: Verification succeeded
de: Prüfung erfolgreich

source: Video driver: %s (%dk%s)
de: Video-Treiber: %s (%dk%s)

source: Video driver: %s%s
de: Video-Treiber: %s%s

source: View Mailbox
de: Mailbox ansehen

source: View util.dat
de: util.dat ansehen

source: Viewing history turn %d
de: Zeige vergangenen Zug %d

source: Virtual folder
de: Virtualler Ordner

source: Visibility Range from Planet
de: Sichtbarkeitsbereich von Planet

source: Visibility Range from Ship
de: Sichtbarkeitsbereich von Schiff

source: Visibility range
de: Sichtbarkeitsbereich

source: Visible at
de: Sichtbar bei

source: Visible by sensor scan
de: Auf Sensoren sichtbar

source: Vision alliance
de: Sichtungs-(Vision-)Allianz

source: Visual Combat Recordings
de: Kampf-Aufzeichnungen

source: Visual Contacts
de: Sichtungen

source: Voltage
de: Ladung

source: W - Weapons
de: W - Waffen

source: WARNING: Option '-O' has been ignored because standard output is being used.
de: WARNUNG: Die Option '-O' wurde ignoriert, da die Standardausgabe benutzt wird.

source: Wait One Turn
de: Warte einen Zug

source: Waiting
de: Wartet

source: Warning: 'asset:' content cannot be resolved (blob does not exist)
de: Warnung: 'asset:' kann nicht aufgelöst werden (Blob existiert nicht)

source: Warning: 'asset:' used in <a href> link
de: Warnung: 'asset:' in <a href> verwendet

source: Warning: bad anchor ('#link')
de: Warnung: ungültiger Anker ('#link')

source: Warning: comment in renderer output (invalid tag in input)
de: Warnung: Renderer-Ausgabe enthält Kommentare (ungültiges Tag in Eingabe)

source: Warning: content error (cannot be parsed)
de: Warnung: Fehler in Inhalt (kann nicht geparsed werden)

source: Warning: dead link
de: Warnung: toter Link

source: Warning: document name used in <img src> link
de: Warnung: Dokument-Name in <img src> verwendet

source: Warning: duplicate address
de: Warnung: doppelte Adresse

source: Warning: executing this action produced %d error%!1{s%}, last was "%s". This should not have happened and indicates a bug in PCC2.
de: Warnung: Ausführen dieser Aktion erzeugte %d Fehler, der letzte war "%s". Das sollte nicht passieren und deutet auf einen Fehler in PCC2 hin.

source: Warning: nesting error (child node of page is not a page)
de: Warnung: Verschachtelungsfehler (Unterknoten einer Seite ist keine Seite)

source: Warning: node content cannot be resolved (blob does not exist)
de: Warnung: Knoten-Inhalt kann nicht aufgelöst werden (Blob existiert nicht)

source: Warning: node has no Id
de: Warnung: Knoten hat keine Id

source: Warning: node has no title
de: Warnung: Knoten hat keinen Titel

source: Warning: node has unique secondary Id
de: Warnung: Knoten hat einmalige Sekundär-Id

source: Warning: node is empty (no children and no content)
de: Warnung: Knoten ist leer (keine Unterknoten und kein Inhalt)

source: Warp Factor
de: Warp-Faktor

source: Warp wells
de: Planeten-Gravitation

source: Warp/Time: 6/%d 7/%d 8/%d 9/%d
de: Warp/Zeit: 6/%d 7/%d 8/%d 9/%d

source: Waypoint
de: Kurs

source: Waypoint DX
de: Kurs DX

source: Waypoint DY
de: Kurs DY

source: Waypoint: %s
de: Kurs: %s

source: We are beaming down %d clan%!1{s%}.
de: Wir entladen %d Clan%!1{s%}.

source: We are not at one of our starbases.
de: Wir sind nicht bei einer unserer Sternenbasen.

source: We are not orbiting a planet, sir. If you want to jettison cargo, use the 'c' command instead.
de: Wir befinden uns nicht im Orbit eines Planeten. Um Fracht über Bord zu werfen, verwende 'c'.

source: We can't find a ship that will be at this position next turn.
de: Es kann kein Schiff gefunden werden, das nächsten Zug an dieser Position ist.

source: We can't locate a ship at that position.
de: An dieser Position kann kein Schiff geortet werden.

source: We can't locate another ship at that position.
de: An dieser Position kann kein weiteres Schiff geortet werden.

source: We captured their ship%s.
de: Wir haben das Schiff gekapert%s.

source: We were destroyed%s.
de: Wir wurden zerstört%s.

source: We won%s.
de: Wir haben gesiegt%s.

source: We'd lose this ground combat.
de: Wir würden diesen Kampf verlieren.

source: We'd win this ground combat.
de: Wir würden diesen Kampf gewinnen.

source: We'll lose this ground combat.
de: Wir werden diesen Kampf verlieren.

source: We'll win this ground combat.
de: Wir werden diesen Kampf gewinnen.

source: Weapon
de: Waffe

source: Weapon Effects
de: Wirkungen der Waffen

source: Weapons
de: Waffen

source: Web Mine Field #%d
de: Fangminenfeld #%d

source: What do you want to draw into the starcharts?
de: Was möchtest du in die Sternenkarte zeichnen?

source: Where
de: Wo

source: Width
de: Breite

source: Windows Codepage 1250 (Eastern Europe)
de: Windows-Codeseite 1250 (Osteuropa)

source: Windows Codepage 1251 (Cyrillic)
de: Windows-Codeseite 1251 (Kyrillisch)

source: Windows Codepage 1252 (Western Europe, Latin-1)
de: Windows-Codeseite 1252 (Westeuropa, Latin-1)

source: With this option selected, PCC2 will return you to the status of the last Maketurn. Otherwise, unpacking results will bring you to the beginning of the current turn.
de: Wenn diese Option ausgewählt ist, wird PCC2 dich zum Status des letzten Maketurn zurückbringen. Ansonsten bringt dich das Entpacken deines Results zum Anfang des aktuellen Zuges zurück.

source: Working...
de: Arbeitet...

source: Wormhole #%d
de: Wurmloch #%d

source: Wrapped (rectangular, Sphere)
de: Endlos (rechteckig, Sphere)

source: Write
de: Schreiben

source: Write to file...
de: In Datei schreiben...

source: Writing %s data...
de: Schreibe %s Daten...

source: Writing %s turn file (%d command%!1{s%})...
de: Schreibe %s Turn-Datei (%d Kommando%!1{s%})...

source: Writing '%s', %d object%!1{s%}...
de: Schreibe '%s', %d Objekt%!1{e%}...

source: Writing configuration to %s...
de: Schreibe Konfiguration nach %s...

source: Wrong passcode
de: Falscher Passcode

source: Wrote turn file with %d command%!1{s%}
de: Turn-Datei mit %d Kommando%!1{s%} geschrieben

source: X - Execute
de: X - Ausführen

source: X Movement
de: X-Bewegung

source: X and Y size must be equal for circular wrap.
de: Bei einer kreisförmigen Karte müssen X- und Y-Größe identisch sein.

source: Y Movement
de: Y-Bewegung

source: Yes
de: Ja

source: Yes No
de: Ja Nein

source: Yes No Cancel
de: Ja Nein Abbruch

source: You can buy up to %d supplies. (This is the amount of supplies you already sold this turn but have not used otherwise.) Enter amount to buy
de: Du kannst bis zu %d Vorräte kaufen. (Dies ist die Anzahl Vorräte, die du diesen Zug bereits verkauft, aber noch nicht anderweitig benutzt hast.) Zu kaufende Anzahl

source: You can collect all the money and supplies.
de: Wir können alles Geld und Vorräte einsammeln.

source: You can collect all the money, but only %d kt supplies.
de: Wir können alles Geld, aber nur %d kt Vorräte einsammeln.

source: You can collect all the money.
de: Wir können alles Geld einsammeln.

source: You can collect only %d mc and %d kt supplies.
de: Wir können nur %d mc und %d kt Vorräte einsammeln.

source: You can collect only %d mc, but all supplies.
de: Wir können nur %d mc, aber alle Vorräte einsammeln.

source: You can only collect %d mc.
de: Wir können nur %d mc einsammeln.

source: You can't build a starbase here.
de: Wir können hier keine Sternenbasis bauen.

source: You cannot build this ship.
de: Du kannst dieses Schiff nicht bauen.

source: You cannot buy supplies. Either you have not yet sold any this turn, or you have already spent the money.
de: Du kannst keine Vorräte kaufen. Entweder hast du diesen Zug noch keine verkauft, oder du hast das Geld bereits ausgegeben.

source: You cannot buy this tech level.
de: Du kannst diesen Tech-Level nicht kaufen.

source: You cannot clone ships.
de: Du kannst keine Raumschiffe klonen.

source: You cannot clone this ship, because you do not have enough money to upgrade your technology.
de: Du kannst dieses Schiff nicht klonen, da du nicht genug Geld hast, um die benötigte Technologie zu kaufen.

source: You cannot create files here. Please choose a place (drive, partition) first.
de: Du kannst hier keine Dateien erstellen. Bitte wähle zuerst einen Ort (Laufwerk, Partition).

source: You did not receive any new files with your result this turn, or these files have already been unpacked.
de: Du hast diesen Zug keine neuen Dateien erhalten, oder alle Dateien wurden bereits empfangen.

source: You do no longer play the unit that this Auto Task was controlling. Auto Task terminates.
de: Du spielst die Einheit, die von dieser Aufgabe gesteuert wurde, nicht mehr. Die Aufgabe wird beendet.

source: You do not have any planets. <small>Unload colonists from a starship to a planet to colonize it.</small>
de: Du hast noch keine Planeten. <small>Um Planeten zu kolonisieren, lade Kolonisten aus einem Raumschiff darauf ab.</small>

source: You do not have any ships. <small>To build ships, use <kbd>B</kbd> on a starbase.</small>
de: Du hast keine Raumschiffe. <small>Raumschiffe werden mit <kbd>B</kbd> auf einer Sternenbasis gebaut.</small>

source: You do not have any starbases. <small>To build starbases, use <kbd>F8</kbd> on a planet.</small>
de: Du hast noch keine Sternenbasen. <small>Um eine Sternenbasis zu bauen, verwende <kbd>F8</kbd> auf einem Planeten.</small>

source: You do not have any supplies on this planet.
de: Auf diesem Planeten hast du keine Vorräte.

source: You do not have enough resources to build this ship now. Do you want to add this build order to this base's Auto Task, to build it as soon as resources are available?
de: Du hast nicht genug Material, um dieses Schiff jetzt zu bauen. Möchtest du den Bauauftrag in die Aufgabenliste der Sternenbasis aufnehmen, so dass das Schiff gebaut wird, sobald das Material verfügbar ist?

source: You do not have enough resources to clone this ship. Try anyway?
de: Du hast nicht genug Material, um dieses Schiff zu klonen. Dennoch versuchen?

source: You do not have the required %d megacredits required to upgrade to the required level.
de: Die %d Megacredits, die du für die Verbesserung benötigst, sind nicht verfügbar.

source: You have
de: Verfügbar

source: You have %d fighter%!1{s%}.
de: Du hast %d Raumjäger.

source: You have %d kt supplies. You'll get 1 mc per kiloton. Remember that PCC automatically sells supplies when needed. Enter amount to sell
de: Du hast %d kt Vorräte. Für den Verkauf einer Kilotonne erhältst du 1 mc. PCC verkauft bei Bedarf auch automatisch Vorräte. Zu verkaufende Menge Vorräte

source: You have %d torpedo%!1{es%}.
de: Du hast %d Torpedo%!1{s%}.

source: You have no active ship build orders.
de: Du hast keine aktiven Bauaufträge.

source: You have not yet established a fleet. <small>To start a fleet, use the "Start New Fleet" command on a ship's <kbd>F10</kbd> menu.</small>
de: Du hast noch keine Flotte definiert. <small>Um eine Flotte zu beginne, nutze den Befehl "Beginne neue Flotte" auf dem <kbd>F10</kbd>-Menü eines Schiffes.</small>

source: You have not yet set up a fleet to join. Use the "Start New Fleet" command on the <kbd>F10</kbd> menu to start one.
de: Du hast noch keine Flotte definiert, der du beitreten könntest. Nutze den Befehl "Beginne neue Flotte" auf dem <kbd>F10</kbd>-Menü, um eine Flotte zu beginnen.

source: You have received some additional files with your result. Choose which files you want to accept
de: Du hast ein mit deinem Result weitere Dateien bekommen. Wähle die Dateien, die du akzeptieren möchtest

source: You have room for %d more.
de: Es ist Platz für %d weitere%1{n%}.

source: You need
de: Benötigt

source: You need %d mc
de: Es werden %d weitere mc

source: You should restart PCC2 for the changes to take effect.
de: Du solltest PCC2 neu starten, damit die Änderungen wirksam werden.

source: You wanted to build a starbase at this planet. Cancel this order?
de: An diesem Planeten wird bereits eine Sternenbasis gebaut. Soll dieser Auftrag storniert werden?

source: Your Empire
de: Dein Imperium

source: Your host does not support alliances, or PCC2 does not know how to configure them.
de: Den Host unterstützt keine Allianzen, oder PCC2 weiß nicht, wie sie eingestellt werden.

source: Your input contains characters that are not permitted at this place. Please try again.
de: Deine Eingabe enthält Zeichen, die an dieser Stelle nicht zulässig sind. Bitte versuche es noch einmal.

source: Your order
de: Bauauftrag

source: Your planet expression was not accepted.
de: Dein Planeten-Ausdruck wurde nicht akzeptiert.
